{
  "defaultLanguage": "en-US",
  "fallbackLanguage": "en-US",
  "languages": {
    "en-US": {
      "name": "English (US)",
      "flag": "us",
      "flag_path": "",
      "strings": {
        "privacy.title": "Privacy Statement",
        "privacy.lastUpdated": "Last updated: 24-Jan-2026",
        "privacy.fullText": "<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p><p>Planefence is distributed as a software package (Docker container) and is installed, deployed, and/or operated by individuals (\"Operators\") unrelated to the author(s) or the SDR-Enthusiasts organization. These Operators run Planefence under the terms of the GNU Public License, version 3, and they have the sole and exclusive responsibility for the behavior of the software and for compliance with any applicable laws and regulations.</p><h2>1. No Personal Information Collected</h2><p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p><p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p><ul><li>Names, email addresses, phone numbers, or postal addresses</li><li>User accounts or login details</li><li>IP addresses linked to individuals</li><li>Online identifiers or profiling data</li><li>Location data</li><li>Payment or transaction information</li></ul><p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p><p>Because we do not collect personal information, we:</p><ul><li>Do not sell, share, or disclose personal information to third parties</li><li>Do not use personal information for advertising, profiling, or marketing</li><li>Do not conduct automated decision-making or profiling based on personal data</li></ul><h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2><p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p><p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p><ul><li>Theme preference: whether you prefer dark mode or light mode</li><li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li><li>Language preference: your selected language for the website</li><li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li></ul><p>These preference values:</p><ul><li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li><li>Are stored locally in your browser and are not transmitted to us as personal data</li><li>Do not contain your name, email, IP address, or any other personal identifier</li></ul><p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p><h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2><p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p><p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p><h2>4. Your Choices and Control</h2><p>You can control how preference information is stored in your browser in the following ways:</p><ul><li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li><li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li></ul><h2>5. Children's Privacy</h2><p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p><h2>6. Third-Party Services</h2><p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p><h2>7. International Users</h2><p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p><h2>8. Changes to This Privacy Statement</h2><p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p><h2>9. Contact Us</h2><p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p><p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p><p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "es-ES": {
      "name": "Español",
      "flag": "es",
      "flag_path": "",
      "strings": {
        "privacy.title": "Declaración de privacidad",
        "privacy.lastUpdated": "Última actualización: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"nosotros\", \"nosotros\" o \"nuestro\") está comprometido a proteger su privacidad. Esta Declaración de Privacidad explica cómo manejamos la información cuando utiliza nuestro sitio web.</p><p>Planefence se distribuye como un paquete de software (contenedor Docker) y es instalado, desplegado y/u operado por personas (\"Operadores\") ajenas al autor o a la organización SDR-Enthusiasts. Estos Operadores ejecutan Planefence bajo los términos de la Licencia Pública General de GNU, versión 3, y tienen la responsabilidad única y exclusiva sobre el comportamiento del software y el cumplimiento de las leyes y normativas aplicables.</p><h2>1. No hay información personal recopilada</h2><p>Diseñamos este sitio web para que no recopilamos, almacenamos o procesemos información personal en el sentido del Reglamento General de Protección de Datos de la UE/Reino Unido (\"GDPR\"), la Ley de Privacidad del Consumidor de California y la Ley de Derechos de Privacidad de California (\"CCPA/CPRA\"), y Lei Geral de Protecao de Dados Pessoais (\"LGPD\") de Brasil. Tenga en cuenta que su solicitud de acceso puede pasar a través de otros servidores web antes de que nos alcance, y que estos servidores pueden manejar sus datos de manera diferente. No tenemos conocimiento de estos, y están fuera de nuestro alcance de control; usted debe gestionar sus requisitos de privacidad directamente con estos servicios si es necesario.</p><p>No recopilamos, almacenamos o procesamos ninguna información que identifique o pueda vincularse razonablemente a un individuo (\"información personal\" o \"datos personales\"), como:</p><ul><li>Nombres, direcciones de correo electrónico, números de teléfono o direcciones postales</li><li>Cuentas de usuario o datos de login</li><li>Direcciones IP vinculadas a individuos</li><li>Identificadores en línea o datos de perfiles</li><li>Datos de ubicación</li><li>Información sobre pagos o transacciones</li></ul><p>Tampoco utilizamos análisis, cookies publicitarias, píxeles de seguimiento o tecnologías similares que nos permitan identificar o rastrear usuarios individuales con el tiempo.</p><p>Porque no recopilamos información personal, nosotros:</p><ul><li>No vender, compartir o divulgar información personal a terceros</li><li>No utilice información personal para publicidad, perfiles o marketing</li><li>No lleve a cabo automatizada toma de decisiones ni perfiles basados en datos personales</li></ul><h2>2. Información almacenada en su navegador ( Almacenamiento local / Cookies)</h2><p>El sitio web almacena una cantidad muy pequeña de información sólo en su navegador, sólo para recordar sus preferencias. Esta información no se envía a nuestros servidores y no es accesible para nosotros en un formulario que le identifica.</p><p>Podemos almacenar datos de preferencia en su navegador (a través de almacenamiento local, cookies o tecnologías similares), incluidos pero no limitados a:</p><ul><li>Preferencia del tema: si prefiere modo oscuro o modo de luz</li><li>Última página vista: si visitó por última vez la página \"planefence\" o \"plane-alert\"</li><li>Preferencia del idioma: tu idioma seleccionado para el sitio web</li><li>Registro de consentimiento (si se optó en): si usted consintió en nosotros almacenar estas preferencias en su navegador</li></ul><p>Estos valores de preferencia:</p><ul><li>Se utilizan sólo para mejorar su experiencia (por ejemplo, recordando su tema elegido, idioma y última página)</li><li>Se almacenan localmente en su navegador y no se transmiten a nosotros como datos personales</li><li>No contenga su nombre, correo electrónico, dirección IP o cualquier otro identificador personal</li></ul><p>Si opta por no permitir este almacenamiento de preferencias, todavía puede utilizar el sitio web, pero puede tener que volver a seleccionar sus preferencias cada vez que visite.</p><h2>3. Base jurídica y cumplimiento (GDPR, CCPA/CPRA, LGPD)</h2><p>Bajo el GDPR y el LGPD, no procesamos datos personales. La información de preferencia limitada almacenada en su navegador es necesaria para proporcionar la funcionalidad básica del sitio web y la experiencia del usuario (por ejemplo, manteniendo su selección de idiomas), o almacenada con su consentimiento cuando sea aplicable. Puede deshabilitar este almacenamiento en cualquier momento a través de la configuración de su navegador o ajustando las preferencias disponibles en nuestro sitio web (si se proporciona).</p><p>Para los residentes de California: No recopilamos, vendemos o compartimos \"información personal\" según la definición de CCPA/CPRA. No revelamos información personal a terceros para su consideración monetaria u otra consideración valiosa. No usamos ni revelamos \"información personal sensible\". Debido a que no recopilamos información personal, los derechos típicos de CCPA/CPRA (como el derecho a acceder, eliminar o corregir información personal, y el derecho a no vender o compartir) generalmente no son aplicables a nuestro sitio web. Si usted cree que podemos haber recopilado inadvertidamente información personal, por favor contáctenos con los detalles siguientes, y abordaremos su solicitud de acuerdo con la ley aplicable.</p><h2>4. Sus opciones y control</h2><p>Puede controlar cómo la información de preferencia se almacena en su navegador de las siguientes maneras:</p><ul><li><strong>Ajustes del navegador:</strong> Puede bloquear o eliminar las cookies y los datos de almacenamiento local a través de la configuración de privacidad o seguridad de su navegador. Si lo hace, el sitio web puede ya no recordar su modo oscuro/ligero, última página visitada, idioma o estado de consentimiento.</li><li><strong>Ajustes in situ (si se proporciona):</strong> Podemos ofrecer un control en página (p. ej., un toggle o banner) que le permite optar por dentro o fuera de las preferencias de almacenamiento. Si opta por salir, intentaremos dejar de almacenar nuevos datos de preferencias en su navegador, pero su navegador todavía puede retener los datos existentes hasta que lo aclare.</li></ul><h2>5. Privacidad de los niños</h2><p>Nuestro sitio web no está dirigido a niños menores de 13 años (o a una edad más alta definida por la ley local), y no recopilamos a sabiendas información personal de niños. Puesto que no recopilamos información personal en absoluto, no creamos perfiles de niños ni los orientamos con ningún propósito.</p><h2>6. Servicios de terceros</h2><p>Diseñamos nuestro sitio web para no incorporar servicios de análisis, publicidad o seguimiento de terceros que recopilan información personal. Si en el futuro integramos cualquier contenido o herramientas de terceros que puedan procesar información personal, actualizaremos esta Declaración de Privacidad y proporcionaremos información y controles claros compatibles con las leyes de privacidad aplicables.</p><h2>7. Usuarios internacionales</h2><p>Nuestro sitio web puede ser accesible desde diferentes países, pero nuestras prácticas están diseñadas para que no recoja información personal de ningún usuario, independientemente de su ubicación. En la medida en que se aplica cualquier ley de privacidad (como el GDPR o el LGPD), nuestro enfoque es minimizar la recopilación de datos a los datos de preferencia no personal almacenados localmente en su navegador solamente.</p><h2>8. Cambios en esta Declaración de Privacidad</h2><p>Podemos actualizar esta Declaración de Privacidad de vez en cuando, por ejemplo, si cambiamos cómo almacenamos preferencias o si comenzamos a procesar información personal en el futuro. Cuando hagamos cambios, actualizaremos la fecha \"Última actualización\" en la parte superior de esta página, y publicaremos la Declaración de Privacidad revisada en esta página. Si alguna vez empezamos a recopilar información personal, actualizaremos esta Declaración de Privacidad antes de que dicha colección comience y, cuando sea necesario, obtengamos su consentimiento.</p><h2>9. Contáctenos</h2><p>Si tiene alguna pregunta sobre esta Declaración de Privacidad o cree que podemos haber recopilado inadvertidamente información personal, puede ponerse en contacto con nosotros en:</p><p>Correo electrónico: planefence (at) kx1t (dot) com<br/>Dirección postal: PO Box 11, Belmont, MA 02478, USA</p><p>Revisaremos y responderemos de acuerdo con las leyes de privacidad aplicables.</p>"
      }
    },
    "ca-ES": {
      "name": "Català",
      "flag": "es-ct",
      "flag_path": "",
      "strings": {
        "privacy.title": "Etiqueta de privadesa",
        "privacy.lastUpdated": "Darrera actualització: 24- Jan- 2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>L'avió s'ha comès per protegir la teva privacitat. Aquesta declaració de privadesa explica com gestionem la informació quan useu el nostre web.</p><p>Planefence es distribueix com un paquet de programari (contenidor Docker) i és instal·lat, desplegat i/o operat per persones (\"Operadors\") sense relació amb l’autor o l’organització SDR-Enthusiasts. Aquests Operadors executen Planefence sota els termes de la Llicència Pública General de GNU, versió 3, i tenen la responsabilitat única i exclusiva del comportament del programari i del compliment de les lleis i regulacions aplicables.</p><h2>1. No s' ha recollit informació personal</h2><p>Vam dissenyar aquesta pàgina web per tal de no recollir, emmagatzemar o processar la informació personal dins del significat de la Llei de Protecció general de dades de la UE/UK (GPR), la Llei de privacitat de Califòrnia i els Drets de Califòrnia (\"CCPA/CPRA), i la Llei de Protecció de Lei Geral de Protescao del Pares Pesoisi (\"LGP). Tingueu present que la vostra petició d' accés pot passar per altres servidors web abans d'arribar a nosaltres, i que aquests servidors poden gestionar les vostres dades de manera diferent. No tenim coneixement d'això, i estan fora del nostre abast de control, hauríeu de gestionar els vostres requeriments de privacitat directament amb aquests serveis si calgués.</p><p>No col·leccionem, store, o processem qualsevol informació que identifica o es pot enllaçar raonablement a un individu (\"informació personal\" o \"informació personal\"), com ara:</p><ul><li>Noms, adreces de correu electrònic, números de telèfon o adreces postal</li><li>Comptes d' usuari o detalls de connexió</li><li>Adreces IP relacionades amb els individus</li><li>Identificadors en línia o perfils de dades</li><li>Ubicació de les dades</li><li>Assentaments programats</li></ul><p>També no utilitzem anàlisi, galetes de publicitat, seguiment de píxels, o tecnologies similars que ens permetran o tercera parts identificar o seguir els usuaris individuals durant el temps.</p><p>Perquè no recollim informació personal, nosaltres:</p><ul><li>No venguis, comparteixis o revelis informació personal a tercers grups</li><li>No utilitzis informació personal per publicitat, perfilat o màrqueting</li><li>No gestionis la presa automàtica de decisions o perfileu basats en dades personals</li></ul><h2>2. Informació desada en el vostre navegador (emmagatzematge local / Galetes)</h2><p>La pàgina web desa una quantitat molt petita d'informació al vostre navegador, només per recordar les vostres preferències. Aquesta informació no s' envia als nostres servidors i no és accessible per a nosaltres en un formulari que identifica.</p><p>Podem emmagatzemar dades de preferència al vostre navegador (via magatzem local, galetes o tecnologies similars), incloses però no limitades a:</p><ul><li>Preferències del tema: Si preferiu mode fosc o clar</li><li>Última pàgina visualitzada: Si l' última vegada vàreu visitar la pàgina \"planefència\" o \"plan- alt\"</li><li>Preferències del llenguatge: el vostre idioma seleccionat per al lloc web</li><li>Registre Consent (si opted in): Si ens ha consentit emmagatzemar aquestes preferències al vostre navegador</li></ul><p>Aquests valors de preferència:</p><ul><li>Tan sols s' usen per millorar la vostra experiència (p. ex., recordant el vostre tema escollit, idioma i última pàgina)</li><li>Estan emmagatzemats localment al vostre navegador i no ens transmeten com a dades personals</li><li>No contingui el vostre nom, correu electrònic, adreça IP, o qualsevol altre identificador personal</li></ul><p>Si escolliu no permetre aquest magatzem de preferències, encara podeu usar el lloc web, però podeu haver de tornar a seleccionar les preferències cada vegada que visiteu.</p><h2>3. Base legal i composició (GDPR, CCPA/CPRA, LGPD)</h2><p>Sota el PIBR i LGPD, no processem dades personals. La informació limitada de preferència emmagatzemada al vostre navegador és necessària per proporcionar la funcionalitat bàsica del lloc web i l'experiència d' usuari (p. ex., mantenint la selecció del llenguatge), o emmagatzemar- la amb el vostre consentiment a on sigui aplicable. Podeu deshabilitar aquest magatzem en qualsevol moment a través de les preferències del vostre navegador o ajustant les preferències disponibles al nostre lloc web (si es proporciona).</p><p>Per a residents de Califòrnia: No col·leccionem, venim o compartim \"informació personal\" tal com està definit pel CCPA/CPRA. No revelem informació personal a terceres parts per moneda o una altra consideració valuosa. No utilitzem o revelarem \"informació personal sensible.\" Perquè no recollim informació personal, típics drets CCPA/CPRA (com el dret d'accedir, esborrar o corregir informació personal, i el dret a optar per vendre o compartir) no són generalment aplicables al nostre web. Si creus que potser hem recollit informació personal sense voler, contacteu-nos amb els detalls de sota, i dirigirem la vostra petició d'acord amb la llei aplicable.</p><h2>4. Les vostres opcions i control</h2><p>Podeu controlar com es desa la informació de preferència al vostre navegador de les següents maneres:</p><ul><li><strong>Arranjaments del navegador:</strong> Podeu bloquejar o esborrar les galetes i les dades d' emmagatzematge locals a través de la privacitat del vostre navegador o de les opcions de seguretat. Si ho feu, el lloc web ja no recordarà el vostre mode fosc/ llum, última pàgina visitada, idioma o consentiment.</li><li><strong>Arranjaments del compte (si es proporciona):</strong> Podem oferir un control de pàgines (p. ex., un commutador o cartell) que us permeti optar per o desactivar les preferències d' emmagatzematge. Si opteu, intentarem d' emmagatzemar noves dades de preferència al vostre navegador, però el vostre navegador pot conservar les dades existents fins que l'alliberis.</li></ul><h2>5. La privadesa dels nens</h2><p>La nostra pàgina web no està dirigida als nens sota l'edat de 13 (o d'una edat més alta com la definida per la llei local), i no sabem si hi ha informació personal dels nens. Com que no recollim informació personal, no creem perfils de nens o els apuntem per a qualsevol propòsit.</p><h2>6. Serveis de tercersName</h2><p>Dissenyem la nostra pàgina web per no incorporar anàlisis de tercers, publicitat, serveis de seguiment que recullen informació personal. Si en el futur intem qualsevol contingut de tercers o eines que puguin processar la informació personal, actualitzarà aquesta declaració de privadesa i proporcionem informació neta i controlarem les lleis de privacitat aplicables.</p><h2>7. Usuaris internacionals</h2><p>La nostra pàgina web es pot accedir des de diferents països, però les nostres pràctiques estan dissenyades per tal de no recollir informació personal de qualsevol usuari, independentment de la localització. Fins a quin punt s' aplica qualsevol llei de privacitat (com ara el PIBR o LGPD), la nostra aproximació és minimitzar la col·lecció de dades a les dades no personals emmagatzemades localment al vostre navegador.</p><h2>8 canvis a aquesta sentència de privadesa</h2><p>Podem actualitzar aquesta declaració de privadesa de tant en tant, per exemple, si canviem com desen les preferències o si comencem a processar informació personal en el futur. Quan fem canvis, actualitzarem la data \"última actualització\" a la part superior d'aquesta pàgina i publicarem l' extracte de privadesa a aquesta pàgina. Si mai comencem a recollir informació personal, actualitzarem aquesta declaració de privadesa abans que comenci aquesta col·lecció i, on es requereix, obtenir el seu consentiment.</p><h2>9. Contacte amb nosaltres</h2><p>Si teniu alguna pregunta sobre aquesta declaració de privadesa o creieu que potser hem recollit la informació personal sense voler, podeu contactar amb nosaltres a:</p><p>Correu- e: aviófence (at) kx1t (punt) com<br/>Adreça postal: casella postal 11, Belmont, MA 02478, Estats Units</p><p>Ho revisarem i respondrem d'acord amb les lleis de privacitat aplicables.</p>"
      }
    },
    "eu-ES": {
      "name": "Euskara",
      "flag": "es-pv",
      "flag_path": "",
      "strings": {
        "privacy.title": "Pribatutasun-adierazpena",
        "privacy.lastUpdated": "Azken eguneraketa: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"gu\", \"gu\", \"gu\" edo \"gure\") zure pribatutasuna babesteko konpromisoa hartu du. Pribatutasun-adierazpen honek azaltzen du nola kudeatzen dugun informazioa gure webgunea erabiltzen duzunean.</p><p>Planefence software pakete gisa (Docker edukiontzia) banatzen da, eta egilearekin edo SDR-Enthusiasts erakundearekin loturarik ez duten pertsona fisikoek (\"Eragileek\") instalatu, hedatu eta/edo exekutatzen dute. Eragile hauek Planefence GNU Lizentzia Publiko Orokorraren 3. bertsioaren baldintzen pean exekutatzen dute, eta haien gain dago softwarearen jokabidearen eta aplikagarri diren lege eta araudien betetzearen ardura osoa eta esklusiboa.</p><h2>1. Ez da informazio pertsonalik bildu</h2><p>Webgune hau diseinatu dugu, datu pertsonalak bildu, gorde edo prozesatzeko, Europar Batasuneko/EBko Datuak Babesteko Erregelamendu Orokorraren (GDPR) esanahiaren arabera, Kaliforniako Kontsumitzailearen Pribatutasun Legea eta Kaliforniako Pribatutasun Eskubideei buruzko Legea (\"CCPA/CPRA\") eta Brasilgo Lei Geral de Protecao de Dados Pesssoais (\"LGPD\"). Kontuan izan zure sarbide-eskaera beste web-zerbitzari batzuetatik igaro daitekeela guregana iritsi aurretik, eta zerbitzari horiek zure datuak beste modu batean kudeatu ahal izango dituztela. Ez dugu horien berri, eta gure kontroletik kanpo daude; zure pribatutasun-beharrak zuzenean kudeatu beharko zenituzke zerbitzu horiekin, behar izanez gero.</p><p>Ez dugu biltzen, gordetzen edo prozesatzen pertsona bati lotutako informazioa (\"informazio pertsonala\" edo \"datu pertsonalak\"), adibidez:</p><ul><li>Izenak, helbide elektronikoak, telefono zenbakiak edo posta helbideak</li><li>Erabiltzailearen kontuak edo saio-hasierako xehetasunak</li><li>pertsonei lotutako IP helbideak</li><li>Lineako identifikatzaileak edo datuen profilak</li><li>Kokalekuaren datuak</li><li>Ordainketa edo transakzioaren informazioa</li></ul><p>Analitika, publizitate-cookieak, jarraipen-pixelak edo antzeko teknologiak ere ez ditugu erabiltzen, guk edo hirugarrenek denboran erabiltzaile indibidualak identifikatzeko edo arakatzeko aukera emango digutenak.</p><p>Ez dugulako informazio pertsonala biltzen, guk:</p><ul><li>Ez saldu, partekatu edo zabaldu informazio pertsonala hirugarrenei</li><li>Ez erabili informazio pertsonalik publizitate, profil edo marketinerako.</li><li>Ez egin erabaki automatizaturik edo profilik datu pertsonaletan oinarrituta</li></ul><h2>2. Zure arakatzailean gordetako informazioa (biltegi lokala / cookieak)</h2><p>Webguneak oso informazio gutxi gordetzen du arakatzailean, zure hobespenak gogoratzeko bakarrik. Informazio hau ez da gure zerbitzarietara bidaltzen, eta ez dago erabilgarri zu identifikatzeko moduan.</p><p>Zure arakatzailean hobespenak gorde ditzakegu (biltegi lokalaren, cookieen edo antzeko teknologien bidez), baina ez mugatuta:</p><ul><li>Gaiaren hobespena: modu iluna edo argi modua nahiago duzun ala ez</li><li>Ikusitako azken orrialdea: azken aldiz \"planefentsa\" edo \"plane-alert\" orria bisitatu duzun ala ez</li><li>Hizkuntza-hobespena: web gunerako hautatutako hizkuntza</li><li>Baimenaren erregistroa (hautazkoa bada): zure arakatzailean hobespen hauek gordetzea onartzen duzun ala ez</li></ul><p>Hobespen-balio hauek:</p><ul><li>Zure esperientzia hobetzeko bakarrik erabiltzen dira (adibidez, aukeratutako gaia, hizkuntza eta azken orria gogoratzeko).</li><li>Zure arakatzailean gordetzen dira eta ez digute datu pertsonal gisa transmititzen.</li><li>Ez dauka zure izena, helbide elektronikoa, IP helbidea edo beste edozein identifikatzaile pertsonala.</li></ul><p>Hobespenen biltegi hau ez uztea aukeratzen baduzu, webgunea erabil dezakezu, baina bisita bakoitzean zure hobespenak berriro hautatu beharko dituzu.</p><h2>Lege-oinarria eta betetzea (GDPR, CCPA/CPRA, LGPD)</h2><p>GDPR eta LGPDren pean ez ditugu datu pertsonalak tratatzen. Zure arakatzailean gordetako hobespen-informazio mugatua beharrezkoa da webgunearen oinarrizko funtzionaltasuna eta erabiltzaile-esperientzia emateko (adibidez, hizkuntza-hautapena mantentzea), edo zure baimenarekin gordeta, hala badagokio. Biltegi hau edozein unetan desgaitu dezakezu arakatzailearen ezarpenen bidez edo gure webgunean erabilgarri dauden hobespenak egokituz (ahal izanez gero).</p><p>Kaliforniako biztanleentzat: Ez dugu \"informazio pertsonala\" biltzen, saltzen edo partekatzen CCPA/CPRAk definitutako moduan. Ez diegu hirugarrenei informazio pertsonalik ematen, diru- edo beste kontu baliotsu baterako. Ez dugu \"informazio pertsonala sentikorra\" erabiltzen edo zabaltzen. Informazio pertsonala biltzen ez dugunez, CCPA/CPRAren ohiko eskubideak (hala nola informazio pertsonala eskuratzeko, ezabatzeko edo zuzentzeko eskubidea, eta salmentatik edo partekatzetik baztertzeko eskubidea) ez dira aplikagarriak gure webgunean. Uste baduzu informazio pertsonala oharkabean bildu dugula, jar zaitez gurekin harremanetan beheko xehetasunak erabiliz, eta zure eskaera zuzenduko dugu lege aplikagarriaren arabera.</p><h2>4. Zure aukerak eta kontrola</h2><p>Zure arakatzailean hobespen-informazioa nola gordetzen den kontrolatu dezakezu honela:</p><ul><li><strong>Arakatzailearen ezarpenak:</strong> Cookieak eta biltegiratze lokaleko datuak blokeatu edo ezabatu ditzakezu arakatzailearen pribatutasun- edo segurtasun-ezarpenen bidez. Hori egiten baduzu, webguneak ez du gogoratuko zure modu ilun eta arina, bisitatutako azken orria, hizkuntza edo baimen egoera.</li><li><strong>Gunearen ezarpenak (ematen bada):</strong> Orrialdeen kontrol bat eskain dezakegu (adibidez, txandakatze-bandera edo bannerra) hobespenak gordetzeko aukera ematen dizuna. Aukeratzen baduzu, zure arakatzailean hobespen-datu berriak gordetzeari utziko diogu, baina arakatzaileak oraindik existitzen diren datuak gorde ditzake garbitu arte.</li></ul><h2>5. Haurren pribatutasuna</h2><p>Gure webgunea ez dago 13 urtetik beherako umeei zuzendua (edo adin garaiago bati tokiko legeak definitzen duen bezala), eta ez dugu haurren informazio pertsonala biltzen. Informazio pertsonala biltzen ez dugunez, ez dugu haurren profilik sortzen, ezta helbururik ere.</p><h2>6 Hirugarrenen zerbitzuak</h2><p>Gure webgunea diseinatzen dugu informazio pertsonala biltzen duten hirugarrenen analisi, publizitate edo jarraipen zerbitzuak ez sartzeko. Etorkizunean informazio pertsonala prozesatu dezaketen hirugarrenen eduki edo tresnak integratzen baditugu, Pribatutasun-adierazpen hau eguneratuko dugu, eta informazio eta kontrol argiak emango ditugu aplikagarriak diren pribatutasun-legeekin bat etorriz.</p><h2>7. Nazioarteko erabiltzaileak</h2><p>Gure webgunea beste herrialde batzuetatik sar daiteke, baina gure praktikak diseinatuta daude erabiltzaile baten informazio pertsonala biltzeko, kokalekua kontuan hartu gabe. Pribatutasun-legeak (DBEO edo LGPD kasu) aplikatzen diren neurrian, gure ikuspegia da datuak biltzea zure arakatzailean bakarrik gordetako lehentasun-datu ez-pertsonaletara murriztea.</p><h2>8. Pribatutasun-adierazpen honen aldaketak</h2><p>Pribatutasun-adierazpen hau noizean behin eguneratu dezakegu, adibidez, hobespenak nola gordetzen ditugun edo etorkizunean informazio pertsonala prozesatzen hasten bagara. Aldaketak egiten ditugunean, \"Azken eguneratzea\" orri honen goialdean eguneratuko dugu eta Pribatutasun-adierazpena argitaratuko dugu orrialde honetan. Informazio pertsonala biltzen hasten bagara, pribatutasun-adierazpen hau eguneratuko dugu bilduma hasi aurretik eta, behar izanez gero, zure baimena lortu aurretik.</p><h2>9. Jarri gurekin harremanetan</h2><p>Pribatutasun-adierazpen honi buruzko galderarik baduzu edo informazio pertsonala oharkabean bildu dugula uste baduzu, jar zaitez gurekin harremanetan:</p><p>Posta elektronikoa: planefence (at) kx1t (dot) com<br/>Helbide elektronikoa: PO Box 11, Belmont, MA 02478, USA</p><p>Pribatutasun lege aplikagarrien arabera berrikusi eta erantzungo dugu.</p>"
      }
    },
    "gl-ES": {
      "name": "Galego",
      "flag": "es-ga",
      "flag_path": "",
      "strings": {
        "privacy.title": "Declaración de privacidade",
        "privacy.lastUpdated": "Última actualización: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"nós\" ou \"noso\") está comprometida coa protección da súa privacidade. Esta declaración de privacidade explica como tratamos a información cando usa o noso sitio web.</p><h2>Sen información persoal recollida</h2><p>Deseñamos este sitio web para que non recollamos, almacenemos ou procesemos información persoal dentro do significado do Regulamento xeral de protección de datos da UE / Reino Unido (\"GDPR\"), a Lei de privacidade dos consumidores de California e a Lei de dereitos de privacidade de California (\"CCPA / CPRA\"), e a Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Teña en conta que a súa solicitude de acceso pode pasar a través doutros servidores web antes de chegar a nós, e que estes servidores poden tratar os seus datos de forma diferente. Non temos coñecemento diso e están fóra do noso alcance de control; ten que xestionar os seus requisitos de privacidade directamente con estes servizos se é necesario.</p><p>Non recollemos, almacenamos ou procesamos calquera información que identifique ou poida razoablemente estar vinculada a un individuo (\"información persoal\" ou \"datos persoais\"), como:</p><ul><li>Nomes, enderezos de correo electrónico, números de teléfono ou enderezos postais</li><li>Contas de usuario ou login details</li><li>direccións IP ligadas a persoas</li><li>Identificadores en liña ou datos de perfil</li><li>Datos de localización</li><li>Información de pago ou transacción</li></ul><p>Tampouco utilizamos analíticas, cookies publicitarias, píxeles de seguimento ou tecnoloxías similares que nos permitan identificar ou rastrexar usuarios individuais ao longo do tempo.</p><p>Porque non recollemos información persoal, nós:</p><ul><li>Non vender, compartir ou divulgar información persoal a terceiros.</li><li>Non empregue información persoal para publicidade, perfís ou mercadotecnia.</li><li>Non realizar decisións automatizadas ou perfís baseados en datos persoais.</li></ul><h2>Información almacenada no seu navegador (almacenamento local / cookies)</h2><p>O sitio web almacena unha pequena cantidade de información unicamente no seu navegador, unicamente para lembrar as súas preferencias. Esta información non se envía aos nosos servidores e non é accesible para nós nun formulario que o identifica.</p><p>Podemos almacenar datos de preferencia no seu navegador (a través de almacenamento local, cookies ou tecnoloxías similares), incluídos pero non limitados a:</p><ul><li>preferencia de tema: se prefire o modo escuro ou o modo claro</li><li>Última páxina vista: se visitou por última vez a páxina \"planefence\" ou \"plane-alert\"</li><li>Idioma: o teu idioma seleccionado para o sitio web</li><li>Rexistro de consentimento (en caso de optar): se aceptou que almacenamos estas preferencias no seu navegador.</li></ul><p>Estes valores preferenciais:</p><ul><li>Utilízanse só para mellorar a súa experiencia (por exemplo, lembrar o tema escollido, o idioma e a última páxina).</li><li>Son almacenados localmente no seu navegador e non se nos transmiten como datos persoais.</li><li>Non contén o seu nome, correo electrónico, enderezo IP ou calquera outro identificador persoal.</li></ul><p>Se decide non permitir este almacenamento de preferencias, aínda pode usar o sitio web, pero pode ter que volver seleccionar as súas preferencias cada vez que visite.</p><h2>Bases legais e cumprimento (GDPR, CCPA / CPRA, LGPD)</h2><p>Baixo o GDPR e o LGPD non procesamos datos persoais. A información de preferencia limitada almacenada no seu navegador é necesaria para proporcionar a funcionalidade básica do sitio web e a experiencia do usuario (por exemplo, manter a súa selección de idioma), ou almacenada co seu consentimento se é o caso. Pode desactivar este almacenamento en calquera momento a través da configuración do seu navegador ou axustando as preferencias dispoñibles no noso sitio web (se se fornece).</p><p>Habitantes de California: Non recollemos, vendemos ou compartimos información persoal definida polo CCPA/CPRA. Non revelamos información persoal a terceiros para unha consideración monetaria ou outra valiosa. Non usamos nin revelamos información persoal sensible. Debido a que non recollemos información persoal, os dereitos típicos de CCPA / CPRA (como o dereito de acceso, eliminación ou correcta información persoal, eo dereito de optar por saír de venda ou compartir) xeralmente non son aplicables ao noso sitio web. Se cre que podemos recoller inadvertidamente información persoal, póñase en contacto connosco usando os datos a continuación, e imos atender a súa solicitude de acordo coa lei aplicable.</p><h2>4. As túas opcións e control</h2><p>Pode controlar como se almacena a información de preferencia no seu navegador das seguintes maneiras:</p><ul><li><strong>Configuración do navegador:</strong> Pode bloquear ou borrar as cookies e os datos de almacenamento local a través da configuración de privacidade ou seguridade do seu navegador. Se o fai, o sitio web pode non lembrar máis o seu modo escuro / lixeiro, a última páxina visitada, idioma ou estado de consentimento.</li><li><strong>Configuración local (se se fornece):</strong> Podemos ofrecer un control de páxina (por exemplo, unha barra ou un banner) que lle permite optar por entrar ou non de almacenar preferencias. Se optas por saír, intentaremos deixar de almacenar novos datos de preferencia no teu navegador, pero o teu navegador aínda pode conservar os datos existentes ata que os limpe.</li></ul><h2>5. Privacidade dos nenos</h2><p>O noso sitio web non está dirixido a nenos menores de 13 anos (ou unha idade superior, como definido pola lei local), e non recollemos conscientemente información persoal de nenos. Dado que non recompilamos información persoal en absoluto, non elaboramos perfís de nenos nin os dirixemos para ningún propósito.</p><h2>6. Servizos de terceiros</h2><p>Deseñamos o noso sitio web para non incorporar servizos de análise de terceiros, publicidade ou seguimento que recompilan información persoal. Se no futuro integramos calquera contido ou ferramentas de terceiros que poidan procesar información persoal, actualizaremos esta Política de privacidade e proporcionaremos información e controis claros conforme ás leis de privacidade aplicables.</p><h2>Usuarios internacionais</h2><p>O noso sitio web pode ser accesible desde diferentes países, pero as nosas prácticas son deseñados para que non recompilemos información persoal de calquera usuario, independentemente da súa localización. Na medida en que se aplique calquera lei de privacidade (como o GDPR ou o LGPD), o noso enfoque é minimizar a recollida de datos a datos de preferencia non persoais almacenados localmente no seu navegador.</p><h2>Cambios a esta declaración de privacidade</h2><p>Podemos actualizar esta Política de privacidade de cando en vez, por exemplo, se cambiamos o xeito en que almacenamos as preferencias ou se comezamos a procesar información persoal no futuro. Cando realicemos cambios, actualizaremos a última data actualizada na parte superior desta páxina e publicaremos a Declaración de privacidade revisada nesta páxina. Se algunha vez iniciamos a recollida de información persoal, actualizaremos esta Política de Privacidade antes de que comece a recollida e, no seu caso, obteñamos o seu consentimento.</p><h2>9. Contacta con nós</h2><p>Se ten algunha dúbida sobre esta declaración de privacidade ou cre que podemos recoller inadvertidamente información persoal, pode poñerse en contacto connosco en:</p><p>Email: planefence (at) kx1t (dot) com<br/>PO Box 11, Belmont, MA 02478, Estados Unidos</p><p>Revisaremos e responderemos de acordo coas leis de privacidade aplicables.</p>"
      }
    },
    "ga-IE": {
      "name": "Gaeilge",
      "flag": "ie",
      "flag_path": "",
      "strings": {
        "privacy.title": "Ráiteas Príobháideachais",
        "privacy.lastUpdated": "Nuashonraithe deireanach: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Tá Planefence (\"muid\", \"sinn\", nó \"ár\") tiomanta do do phríobháideachas a chosaint. Míníonn an Ráiteas Príobháideachais seo conas a láimhseáilimid faisnéis nuair a úsáideann tú ár suíomh gréasáin.</p><p>Déantar Planefence a dháileadh mar phacáiste bogearraí (coimeádán Docker) agus déantar é a shuiteáil, a imscaradh agus/nó a oibriú ag daoine aonair (\"Oibreoirí\") nach bhfuil baint acu leis an údar(údair) ná leis an eagraíocht SDR-Enthusiasts. Ritheann na hOibreoirí seo Planefence faoi théarmaí an GNU Public License, leagan 3, agus tá freagracht iomlán agus eisiach acu as iompar na mbogearraí agus as comhlíonadh dlíthe agus rialachán ábhartha.</p><h2>1. Gan Faisnéis Phearsanta a Bhailiú</h2><p>Dearadh an suíomh gréasáin seo sa chaoi nach mbailímid, nach stórálaimid, ná nach bpróiseálaimid faisnéis phearsanta de réir bhrí Rialachán Ginearálta an AE/RA um Chosaint Sonraí (\"GDPR\"), an California Consumer Privacy Act agus an California Privacy Rights Act (\"CCPA/CPRA\"), agus Lei Geral de Protecao de Dados Pessoais (\"LGPD\") na Brasaíle. Tabhair faoi deara go bhféadfadh d’iarratas rochtana dul trí fhreastalaithe gréasáin eile sula sroicheann sé muid, agus go bhféadfadh na freastalaithe sin do shonraí a láimhseáil ar bhealach difriúil. Níl eolas againn orthu agus tá siad lasmuigh dár smacht; ba cheart duit do riachtanais phríobháideachais a bhainistiú go díreach leis na seirbhísí sin más gá.</p><p>Ní bhailímid, ní stórálaimid, ná ní phróiseálaimid aon fhaisnéis a aithníonn nó is féidir a cheangal go réasúnta le duine aonair (\"faisnéis phearsanta\" nó \"sonraí pearsanta\"), amhail:</p><ul><li>Ainmneacha, seoltaí ríomhphoist, uimhreacha gutháin, nó seoltaí poist</li><li>Cuntais úsáideora nó sonraí logála isteach</li><li>Seoltaí IP atá ceangailte le daoine aonair</li><li>Aitheantais ar líne nó sonraí próifíliúcháin</li><li>Sonraí suímh</li><li>Faisnéis íocaíochta nó idirbhirt</li></ul><p>Chomh maith leis sin, ní úsáidimid anailísíocht, fianáin fógraíochta, picteilíní rianaithe ná teicneolaíochtaí cosúla a ligfeadh dúinne nó tríú páirtithe úsáideoirí aonair a aithint nó a rianú thar am.</p><p>Toisc nach mbailímid faisnéis phearsanta, ní:</p><ul><li>Díolfaimid, roinnfimid ná nochtfaimid faisnéis phearsanta do thríú páirtithe</li><li>Úsáidfimid faisnéis phearsanta le haghaidh fógraíochta, próifíliúcháin nó margaíochta</li><li>Dhéanfaimid cinntí uathoibrithe ná próifíliú bunaithe ar shonraí pearsanta</li></ul><h2>2. Faisnéis Stóráilte i do Bhrabhsálaí (Stóráil Áitiúil / Fianáin)</h2><p>Stórálann an suíomh gréasáin méid an-bheag faisnéise i do bhrabhsálaí amháin, chun do roghanna a mheabhrú. Ní seoltar an fhaisnéis seo chuig ár bhfreastalaithe agus níl sí inrochtana dúinn i bhfoirm a aithníonn tú.</p><p>D’fhéadfaimis sonraí rogha a stóráil i do bhrabhsálaí (trí stóráil áitiúil, fianáin nó teicneolaíochtaí cosúla), lena n-áirítear ach gan a bheith teoranta do:</p><ul><li>Rogha téama: an fearr leat mód dorcha nó mód éadrom</li><li>An leathanach deireanach a chonaic tú: cibé acu a thug tú cuairt go deireanach ar an leathanach \"planefence\" nó \"plane-alert\"</li><li>Rogha teanga: an teanga roghnaithe don suíomh</li><li>Taifead toiliú (más roghnaithe): cibé acu a thug tú cead dúinn na roghanna seo a stóráil i do bhrabhsálaí</li></ul><p>Tá na luachanna rogha seo:</p><ul><li>Úsáidte amháin chun do thaithí a fheabhsú (m.sh., do théama, teanga agus an leathanach deireanach a mheabhrú)</li><li>Stóráilte go háitiúil i do bhrabhsálaí agus ní sheoltar chugainn mar shonraí pearsanta</li><li>Gan do ainm, do ríomhphost, do sheoladh IP ná aon aitheantóir pearsanta eile</li></ul><p>Má roghnaíonn tú gan an stóráil rogha seo a cheadú, is féidir leat an suíomh a úsáid fós, ach seans go mbeidh ort do roghanna a athroghnú gach uair a thugann tú cuairt.</p><h2>3. Bunús Dlí agus Comhlíonadh (GDPR, CCPA/CPRA, LGPD)</h2><p>Faoin GDPR agus an LGPD, ní phróiseálaimid sonraí pearsanta. Tá an fhaisnéis rogha theoranta a stóráiltear i do bhrabhsálaí riachtanach chun feidhmiúlacht bhunúsach agus taithí úsáideora an tsuímh a sholáthar (m.sh., do rogha teanga a choinneáil), nó stóráiltear í le do thoiliú nuair is infheidhme. Is féidir leat an stóráil seo a dhíchumasú ag am ar bith trí shocruithe do bhrabhsálaí nó trí na roghanna ar ár suíomh (más ar fáil).</p><p>Do chónaitheoirí California: Ní bhailímid, ní dhíolaimid ná ní roinnimid \"faisnéis phearsanta\" mar a shainmhínítear faoi CCPA/CPRA. Ní nochtann muid faisnéis phearsanta do thríú páirtithe ar mhaithe le luach airgeadais ná luach eile. Ní úsáidimid ná nochtann muid \"faisnéis phearsanta íogair\". Toisc nach mbailímid faisnéis phearsanta, ní bhíonn na cearta tipiciúla CCPA/CPRA (cosúil leis an gceart rochtana, scriosta nó ceartúcháin, agus an ceart diúltú do dhíol nó do chomhroinnt) infheidhme go ginearálta ar ár suíomh. Má chreideann tú gur bhailíomar faisnéis phearsanta gan rún, déan teagmháil linn leis na sonraí thíos agus freagróimid de réir an dlí ábhartha.</p><h2>4. Do Roghanna agus Rialú</h2><p>Is féidir leat rialú a dhéanamh ar an gcaoi a stóráiltear faisnéis rogha i do bhrabhsálaí ar na bealaí seo:</p><ul><li><strong>Socruithe brabhsálaí:</strong> Is féidir leat fianáin agus sonraí stórála áitiúla a bhlocáil nó a scriosadh trí shocruithe príobháideachais nó slándála do bhrabhsálaí. Má dhéanann tú amhlaidh, seans nach gcuimhneoidh an suíomh ar do mhód dorcha/éadrom, ar an leathanach deireanach a thug tú cuairt air, ar do theanga ná ar stádas an toilithe.</li><li><strong>Socruithe ar an suíomh (más ar fáil):</strong> D’fhéadfadh go gcuirfimis rialú ar an leathanach ar fáil (m.sh., scorán nó fógra) a ligeann duit rogha a dhéanamh maidir le stóráil roghanna. Má dhiúltaíonn tú, déanfaimid iarracht stop a chur le stóráil sonraí rogha nua i do bhrabhsálaí, ach féadfaidh do bhrabhsálaí na sonraí atá ann cheana a choinneáil go dtí go scriosfaidh tú iad.</li></ul><h2>5. Príobháideachas Leanaí</h2><p>Níl ár suíomh gréasáin dírithe ar leanaí faoi bhun 13 bliana d’aois (nó aois níos airde mar a shainmhínítear faoi dhlí áitiúil), agus ní bhailímid faisnéis phearsanta ó leanaí d’aon ghnó. Ós rud é nach mbailímid faisnéis phearsanta ar chor ar bith, ní chruthaímid próifílí do leanaí ná ní dhírímid orthu ar aon chuspóir.</p><h2>6. Seirbhísí Tríú Páirtí</h2><p>Dearaimid ár suíomh gréasáin chun gan seirbhísí anailíse, fógraíochta nó rianaithe tríú páirtí a chuimsíonn faisnéis phearsanta a bhailiú. Má chomhtháthaímid ábhar nó uirlisí tríú páirtí amach anseo a d’fhéadfadh faisnéis phearsanta a phróiseáil, nuashonróimid an Ráiteas Príobháideachais seo agus cuirfimid faisnéis agus rialuithe soiléire ar fáil atá comhsheasmhach le dlíthe príobháideachais ábhartha.</p><h2>7. Úsáideoirí Idirnáisiúnta</h2><p>D’fhéadfadh ár suíomh gréasáin a bheith inrochtana ó thíortha éagsúla, ach tá ár gcleachtais deartha sa chaoi nach mbailímid faisnéis phearsanta ó aon úsáideoir, is cuma cén áit ina bhfuil siad. A mhéid a bhaineann aon dlí príobháideachais (mar an GDPR nó an LGPD), is é ár gcur chuige bailiú sonraí a íoslaghdú go dtí sonraí rogha neamhphearsanta a stóráiltear go háitiúil i do bhrabhsálaí amháin.</p><h2>8. Athruithe ar an Ráiteas Príobháideachais seo</h2><p>Féadfaimid an Ráiteas Príobháideachais seo a nuashonrú ó am go ham, mar shampla má athraímid an chaoi a stórálaimid roghanna nó má thosaímid ag próiseáil faisnéis phearsanta sa todhchaí. Nuair a dhéanaimid athruithe, nuashonróimid an dáta \"Nuashonraithe deireanach\" ag barr an leathanaigh seo, agus foilseoimid an Ráiteas Príobháideachais athbhreithnithe ar an leathanach seo. Má thosaímid riamh ag bailiú faisnéis phearsanta, nuashonróimid an Ráiteas Príobháideachais seo sula dtosaíonn an bailiú sin agus, nuair is gá, gheobhaimid do thoiliú.</p><h2>9. Téigh i dTeagmháil Linn</h2><p>Má tá aon cheist agat faoin Ráiteas Príobháideachais seo nó má chreideann tú gur bhailíomar faisnéis phearsanta gan rún, is féidir leat teagmháil a dhéanamh linn ag:</p><p>Ríomhphost: planefence (at) kx1t (dot) com<br>Seoladh poist: PO Box 11, Belmont, MA 02478, USA</p><p>Déanfaimid athbhreithniú agus freagróimid de réir na ndlíthe príobháideachais ábhartha.</p>"
      }
    },
    "qu-PE": {
      "name": "Quechua",
      "flag": "pe",
      "flag_path": "",
      "strings": {
        "privacy.title": "Rikchʼayqa Rimay",
        "privacy.lastUpdated": "Qhipa kunan: 24-ina-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"ñuqayku\") llapaq ñawinchayki waqaychayman qhawapachkan. Kay Rikchʼayqa rimaymi imayna manejasunchik willakuyta qankuna wasichaqku ruwaspa.</p><p>Planefenceqa software paquetem kanki (Docker container), runakunamanta (\"Operadorkuna\") instalasqa, despliegasqa, operasqata, mana qillqaqkuna utaq SDR-Enthusiasts organizacionwan t’inkisqa. Kay Operadorkuna Planefence-ta GNU Public License, versión 3 nisqamanta hukllawan llamk’achinku, hukllawanmi softwarepa ruranakuyninpata, ley norma aplicablekunataqa hamuq ruwanakunapaq kargan.</p><h2>1. Mana runa willakuyta apaykuq</h2><p>Kay wasichaqa rurasqa kayku mana ima runa willakuyta qhapaq, almacenaqa, ni procesaqqa, EU/UK GDPR, California CCPA/CPRA, huknin Brasil LGPD nisqapi. Qankuna tapuykiqa aswan servidorukunamanta pasaykusaq, chaykunaqa hinaptin imayna kasqantaqa mana riqsichiyku; chaymanta qankunaqa chaykunawan hina qhawakuyki.</p><p>Mana apaykuyku, almacenaqa, ni procesaqqa runakunata riqsichiq willakuyta (\"personal information\" o \"personal data\"), kaykuna hina:</p><ul><li>Suti, correo electrónico, celular, utaq wasi direccionkuna</li><li>Cuenta de usuario utaq lliw yaykuna</li><li>IP direccionkuna runawan tʼinkisqa</li><li>Online identificadorkuna utaq perfil willakuy</li><li>Kawsay lugar willakuy</li><li>Pago utaq transacción willakuy</li></ul><p>Manaqa analytics, publicidad cookies, tracking pixel ni huk tecnología kananpaq llamkʼayku mana sapa runata qatiqpaq.</p><p>Manam runa willakuyta apaykuyku, chayrayku:</p><ul><li>Manam willakuyta rantikunchu, repartikunchu, ni qapaqkunaman churanchu</li><li>Manam publicidadda, perfil nisqapi, utaq marketingpi llamkʼakunchu</li><li>Manam decisión automatizada ni profiling ruwaykuqchu personal datawan</li></ul><h2>2. Qankuna navegadorpi waqaychasqa willakuy (local storage / cookies)</h2><p>Wasichaqa achka mana, pisilla willakuyta navegadorniyki-pi waqaychanki, qankuta llapa preferenciayki yuyarinapaq. Mana servidorniyku-man apachikusqachu, manam ñuqaykuqa hapʼinanchu.</p><p>Waqaychaykuchkan preferenciakuna navegadorniyki-pi (local storage, cookies utaq huk tecnologia):</p><ul><li>Tema preferencia: yana utaq yuraq modo</li><li>Qhipa ñawiriykikuna: \"planefence\" utaq \"plane-alert\"</li><li>Simi aklla: imayna simita munanki</li><li>Konsento record (hinaspa akllanki): hinaqa ñuqayku waqaychaniykiku hinataqmi</li></ul><p>Kay preferenciakuna:</p><ul><li>Servicio allinta ruraypaq sapa kuti (tema, simi, qhipa panqa yuyay)</li><li>Navegadorniyki-pilla chaskisqa, mana ñuqaykumanta personal dataman apachikusqachu</li><li>Manam suti, correo, IP, utaq huk runa riqsichiqta hapʼinanchu</li></ul><p>Mana waqaychay munanki chaykuna, hinaqa wasichaqa llamkanqa, ichaqa sapa kuti preferenciaykiqa wakmanta akllananki.</p><h2>3. Ley base nisqa (GDPR, CCPA/CPRA, LGPD)</h2><p>GDPR hinallataq LGPD nisqapi manam personal datata procesakuchu. Navegadorniyki-pi waqaychasqa preferenciakunaqa básica funcionalidadpaq uyayniyoqmi (simi akllay hina), utaq consentoniymi waqaychasqa. Browserniyki settings utaq wasichaq preferenciakunapi pichaspa hichʼayta atinki.</p><p>California runakunapaq: manam CCPA/CPRA nisqapi \"personal information\" apaykuqchu, rantikuqchu, ni repartikuqchu. Manam \"sensitive personal information\" llamkʼakuqchu. Manam runa willakuyta apaykuqtaq, chayrayku derecho kananpiqa (acceso, pichana, allinchay, utaq venta/compartirpi mana munay) generalmentem mana applychu. Yachankiña, qhawariy warmiqa willakuyta hapʼisqa chayta, rikhuriptiyki ñuqayku churayku leywan ruranayku.</p><h2>4. Akllanakuykikuna</h2><p>Imayna preferenciakuna navegadorpi waqaychanataqa controla atinki:</p><ul><li><strong>Navegador settings:</strong> Cookies, local storage chinkachiy utaq pichaykuy privacidad/siguridaddi qutupi. Chayta ruwaspa, wasichaqa manaña yuyarinchu tema, qhipa panqa, simi, consentoni.</li><li><strong>Wasichaq control (kaykuchkanchik kaptin):</strong> Panqapi toggleta utaq bannerqa churanchik consentopa. Mana munaspayki, chaymantaqa llapan musuq preferenciata mana waqaychasunchik; navegadorniykiqa qhipaq hina waqaychasqa kachkanqa chayta mana pichanki kashanqaman.</li></ul><h2>5. Wawa waqaychay</h2><p>Kay wasichaqa manam 13 watapi (utaq ley sutiyoq aswan hatun watapi) wawakunaman llamkaykuchu, manam willakuyta apaykuqchu wawakunamanta. Mana personal datata apaykuqtaq, chayrayku manam perfilniyoqchu utaq targeteokuchu wawakunata.</p><h2>6. Trato maska masi</h2><p>Kay wasichaqa manam huk analytics, publicidad utaq tracker tercerokunata churanapaq rurasqachu. Hinaspaqa, ñoqayku imaynataq ruwasunchik chaykuna willakuyta, controlkuna sutʼisqa leywan uyariqmi.</p><h2>7. Tawa suyumanta qankuna</h2><p>Wasichaqa llaqtakuna hukninmanta llamkʼasqa, ichaqa ñoqayku manam ima personal datata apaykuyku, maypi kashaspa chayrayku. Huk privacy ley kanan (GDPR utaq LGPD hina) applykiptinchik, ñoqaykuqa pisillata apaykuyta, preferenciakuna navegadorniyki-pi localmente waqaychasqa.</p><h2>8. Hukmanta tikraykuna</h2><p>Hinaptinqa kay Rikchʼayqa hukmanta tikrankuman, hukmanta preferenciakuna imayna waqaychasunchik utaq personal data llamkʼayta qallarimunanchik. Tikrakuspan, \"Qhipa kunan\" fecha tikranku chaypi, kay panqapi huk versiónta churanku. Personal datata apaykuyta qallarimusaq kay rikchʼayta ñawpaqta churayku, mosoq consentimientoqa hinaspaqa.</p><h2>9. Ñawpaqta rimakuy</h2><p>Kay Rikchʼaymanta tapuykuna kashanki utaq imapaq mana munasqa personal willakuyta chaskirqayku niruwaykita yuyarispa, qawayku chaypin:</p><p>Email: planefence (at) kx1t (dot) com<br>Dirección postal: PO Box 11, Belmont, MA 02478, USA</p><p>Leyta uyarispa qhawarisunchik huknin willakuykuna.</p>"
      }
    },
    "nl-NL": {
      "name": "Nederlands",
      "flag": "nl",
      "flag_path": "",
      "strings": {
        "privacy.title": "Privacyverklaring",
        "privacy.lastUpdated": "Laatst bijgewerkt: 24-jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"wij,\" \"ons,\" of \"onze\") is toegewijd aan het beschermen van uw privacy. Deze Privacyverklaring legt uit hoe wij omgaan met informatie wanneer u onze website gebruikt.</p><p>Planefence wordt verspreid als softwarepakket (Docker-container) en wordt geïnstalleerd, uitgerold en/of beheerd door personen (\"Operators\") die geen band hebben met de auteur(s) of de SDR-Enthusiasts-organisatie. Deze Operators draaien Planefence onder de voorwaarden van de GNU Public License, versie 3, en zijn als enigen volledig verantwoordelijk voor het gedrag van de software en voor naleving van alle toepasselijke wetten en regelgeving.</p><h2>1. Geen persoonlijke gegevens verzameld</h2><p>We hebben deze website ontworpen zodat we geen persoonsgegevens verzamelen, opslaan of verwerken in de zin van de EU/Verenigd Koninkrijk Algemene Verordening Gegevensbescherming (\"GDPR\"), de California Consumer Privacy Act en de California Privacy Rights Act (\"CCPA/CPRA\"), en de Braziliaanse Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Merk op dat uw toegangsverzoek door andere webservers kan gaan voordat het ons bereikt, en dat deze servers uw gegevens anders kunnen behandelen. We hebben hier geen kennis van, en ze zijn buiten onze reikwijdte van controle; indien nodig moet u uw privacy eisen direct beheren bij deze diensten.</p><p>Wij verzamelen, bewaren of verwerken geen informatie die een persoon identificeert of redelijkerwijs kan worden gekoppeld (\"persoonlijke informatie\" of \"persoonsgegevens\"), zoals:</p><ul><li>Namen, e-mailadressen, telefoonnummers of postadressen</li><li>Gebruikersaccounts of inloggegevens</li><li>IP-adressen gekoppeld aan individuen</li><li>Online identificatie- of profileringsgegevens</li><li>Locatiegegevens</li><li>Informatie over betalingen of transacties</li></ul><p>We gebruiken ook geen analytics, reclamecookies, tracking pixels of soortgelijke technologieën waarmee wij of derden individuele gebruikers in de loop der tijd kunnen identificeren of volgen.</p><p>Omdat we geen persoonlijke informatie verzamelen, doen wij het volgende ook niet:</p><ul><li>Wij verkopen of delen geen persoonlijke informatie aan derden</li><li>Wij gebruiken geen persoonlijke informatie voor reclame, profilering of marketing</li><li>wij voeren geen geautomatiseerde besluitvorming of profilering uit op basis van persoonsgegevens</li></ul><h2>2. Informatie opgeslagen in uw browser (lokale opslag / cookies)</h2><p>De website slaat een zeer kleine hoeveelheid informatie op in uw browser, alleen om uw voorkeuren te onthouden. Deze informatie wordt niet naar onze servers verzonden en is voor ons niet toegankelijk in een vorm die u identificeert.</p><p>We kunnen voorkeursgegevens opslaan in uw browser (via lokale opslag, cookies of soortgelijke technologieën), inclusief maar niet beperkt tot:</p><ul><li>Themavoorkeur: of u de voorkeur geeft aan donkere modus of lichtmodus</li><li>Laatst bekeken pagina: of u voor het laatst de \"planefence\" of \"plane-alert\" pagina bezocht</li><li>Taalvoorkeur: uw gekozen taal voor de website</li><li>Toestemmingsrecord (indien gekozen): of u toestemming heeft gegeven om deze voorkeuren op te slaan in uw browser</li></ul><p>Deze voorkeurswaarden:</p><ul><li>Worden alleen gebruikt om uw ervaring te verbeteren (bijvoorbeeld, het onthouden van uw gekozen thema, taal, en laatste pagina)</li><li>Worden lokaal opgeslagen in uw browser en worden niet aan ons doorgegeven als persoonlijke gegevens</li><li>Bevatten uw naam, e-mail, IP-adres of andere persoonlijke identificatiecode niet</li></ul><p>Als u ervoor kiest om deze voorkeursopslag niet toe te staan, kunt u nog steeds de website gebruiken, maar dan moet u uw voorkeuren telkens opnieuw selecteren wanneer de website bezoekt.</p><h2>3. Rechtsgrond en naleving (GDPR, CCPA/CPRA, LGPD)</h2><p>Onder de GDPR en LGPD verwerken we geen persoonsgegevens. De beperkte voorkeursinformatie die in uw browser is opgeslagen, is nodig voor het verstrekken van de basisfunctionaliteit en gebruikerservaring van de website (bijvoorbeeld het bijhouden van uw taalkeuze), of opgeslagen met uw toestemming, indien van toepassing. U kunt deze opslag op elk moment uitschakelen via uw browserinstellingen of door het aanpassen van de voorkeuren die beschikbaar zijn op onze website (indien beschikbaar).</p><p>Voor inwoners van Californië: Wij verzamelen, verkopen of delen geen \"persoonlijke informatie\" zoals gedefinieerd door de CCPA/CPRA. We geven geen persoonlijke informatie aan derden voor monetaire of andere waardevolle overweging. Wij gebruiken of maken geen \"gevoelige persoonlijke informatie\" bekend. Omdat we geen persoonlijke informatie verzamelen, zijn de typische CCPA/CPRA-rechten (zoals het recht op toegang tot, wissen of corrigeren van persoonlijke informatie, en het recht om af te zien van verkoop of delen) over het algemeen niet van toepassing op onze website. Als u van mening bent dat we mogelijk per ongeluk persoonlijke informatie hebben verzameld, neem dan contact met ons op met behulp van onderstaande gegevens en wij zullen uw verzoek behandelen in overeenstemming met de toepasselijke wetgeving.</p><h2>4. Uw keuzes en controle</h2><p>U kunt controleren hoe voorkeursinformatie in uw browser wordt opgeslagen op de volgende manieren:</p><ul><li><strong>Browserinstellingen:</strong> U kunt cookies en lokale opslaggegevens blokkeren of verwijderen via de privacy- of beveiligingsinstellingen van uw browser. Als u dit doet, mag de website uw donker/lichtmodus, laatst bezochte pagina, taal of toestemmingsstatus niet meer onthouden.</li><li><strong>Instellingen ter plaatse (indien aanwezig):</strong> We kunnen een in-page controle (bijvoorbeeld een toggle of banner) bieden, zodat u kunt kiezen in of uit het opslaan van voorkeuren. Als u zich afmeldt, zullen we proberen te stoppen met het opslaan van nieuwe voorkeursgegevens in uw browser, maar uw browser kan nog steeds bestaande gegevens bewaren totdat u deze hebt gewist.</li></ul><h2>5. Privacy voor kinderen</h2><p>Onze website is niet gericht op kinderen jonger dan 13 jaar (of een hogere leeftijd zoals gedefinieerd door de lokale wet), en we verzamelen niet bewust persoonlijke informatie van kinderen. Aangezien we helemaal geen persoonlijke informatie verzamelen, maken we geen profielen van kinderen of richten we ons op hen voor welke doeleinden dan ook.</p><h2>6. Diensten van derden</h2><p>Wij ontwerpen onze website niet om derden analytics, reclame, of tracking diensten die persoonlijke informatie te verzamelen. Als we in de toekomst inhoud of tools van derden integreren die persoonsgegevens kunnen verwerken, zullen we deze Privacyverklaring bijwerken en duidelijke informatie en controles verstrekken die in overeenstemming zijn met de toepasselijke privacywetgeving.</p><h2>7. Internationale gebruikers</h2><p>Onze website is toegankelijk vanuit verschillende landen, maar onze praktijken zijn zo ontworpen dat we geen persoonlijke informatie verzamelen van een gebruiker, ongeacht de locatie. Voor zover privacywetgeving (zoals de AVG of LGPD) van toepassing is, is onze aanpak om gegevensverzameling tot een minimum te beperken tot niet-persoonlijke voorkeursgegevens die alleen lokaal in uw browser worden opgeslagen.</p><h2>8. Wijzigingen in deze privacyverklaring</h2><p>We kunnen deze Privacyverklaring van tijd tot tijd bijwerken, bijvoorbeeld als we wijzigen hoe we voorkeuren opslaan of als we in de toekomst met de verwerking van persoonsgegevens beginnen. Wanneer we wijzigingen aanbrengen, zullen we de \"Laatst bijgewerkt\" datum bovenaan deze pagina bijwerken en de herziene Privacyverklaring op deze pagina plaatsen. Als we ooit beginnen met het verzamelen van persoonlijke informatie, zullen we deze Privacyverklaring bijwerken voordat deze verzameling begint en, waar nodig, uw toestemming verkrijgen.</p><h2>9. Contacteer ons</h2><p>Als u vragen heeft over deze Privacyverklaring of denkt dat we mogelijk per ongeluk persoonlijke informatie hebben verzameld, kunt u contact met ons opnemen op:</p><p>E-mail: planefence (at) kx1t (dot) com<br/>Postadres: PO Box 11, Belmont, MA 02478, VS</p><p>Wij beoordelen en reageren in overeenstemming met de toepasselijke privacywetgeving.</p>"
      }
    },
    "fy-NL": {
      "name": "Frysk",
      "flag": "nl",
      "flag_path": "./assets/flags/Friesland.gif",
      "strings": {
        "privacy.title": "Privacyferklearring",
        "privacy.lastUpdated": "Lêst bywurke: 24-jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"wy\") set him yn foar dyn privacy. Dizze Privacyferklearring leit út hoe’t wy ynformaasje behannelje as do ús webside brûkst.</p><p>Planefence wurdt as softwarepakket (Docker-kontener) ferspraat en wurdt ynstallearre, útrôle en/of betsjinne troch persoanen (\"Operators\") sûnder bân mei de skriuwer(s) of de SDR-Enthusiasts-organisaasje. Dizze Operators draaie Planefence ûnder de betingsten fan de GNU Public License, ferzje 3, en hawwe allinnich en folslein de ferantwurdlikens foar it gedrach fan de software en it neilibjen fan alle jildende wetten en regeljouwing.</p><h2>1. Gjin persoanlike gegevens sammelje</h2><p>Wy ha de side sa makke dat wy gjin persoanlike gegevens sammelje, opslaan of ferwurkje neffens de EU/UK GDPR, de California CCPA/CPRA, en de Braziliaanske LGPD. Dyn fersyk kin oer oare servers gean foardat it ús berikt; dy kinne dyn gegevens oars behannelje. Wy hawwe dêr gjin kontrôle oer; regelje dyn privacy-easken mei dy tsjinsten sels.</p><p>Wy sammelje, bewarje of ferwurkje gjin gegevens dy’t in persoan identifisearje of ridlikerwize keppele wurde kinne, lykas:</p><ul><li>Namme, e-mail, telefoannûmer of postadres</li><li>Brûkersakkounts of oanmeldgegevens</li><li>IP-adressen keppele oan persoanen</li><li>Online identifiers of profylgegevens</li><li>Lokasjedata</li><li>Betelling of transaksje-ynformaasje</li></ul><p>Wy brûke ek gjin analytics, advertinsjecookies, trackingpixels of ferlykbere techniken om brûkers oer tiid te folgjen.</p><p>Omdat wy gjin persoanlike gegevens sammelje, dogge wy it folgjende net:</p><ul><li>Ferkeapje, diele of iepenbierje persoanlike gegevens oan tredden</li><li>Brûke persoanlike gegevens foar reklame, profiling of marketing</li><li>Utfiere automatyske besluten of profiling op basis fan persoanlike gegevens</li></ul><h2>2. Ynformaasje bewarre yn dyn browser (lokale opslach / cookies)</h2><p>De webside bewarret in hiel lyts bytsje ynformaasje yn dyn browser, allinnich om dyn foarkarren te ûnthâlden. Dy ynformaasje giet net nei ús servers en is foar ús net tagonklik as persoansgegevens.</p><p>Wy kinne foarkarsgegevens yn dyn browser bewarje (lokale opslach, cookies of ferlykbere techniken), ûnder oaren:</p><ul><li>Tema: donker of ljocht</li><li>Lêst besochte side: \"planefence\" of \"plane-alert\"</li><li>Taal: de selektearre taal fan de webside</li><li>Consentrecord (as keazen): oftst tastimming joech om dizze foarkarren te bewarjen</li></ul><p>Dizze foarkarswearden:</p><ul><li>Wurden allinnich brûkt om dyn ûnderfining te ferbetterjen (tema, taal, lêste side ûnthâlde)</li><li>Steane lokaal yn dyn browser en wurde net as persoansgegevens nei ús stjoerd</li><li>Bevatte gjin namme, e-mail, IP of oare identifisearjende gegevens</li></ul><p>Kiest net foar dizze opslach, dan wurket de side noch, mar moatst elke kear op ’e nij foarkarren kieze.</p><h2>3. Juridyske basis en neilibjen (GDPR, CCPA/CPRA, LGPD)</h2><p>Under GDPR en LGPD ferwurkje wy gjin persoansgegevens. De beheinde foarkarsynformaasje yn dyn browser is nedich foar basisfunksjes (bgl. taal ûnthâlde) of wurdt mei dyn tastimming bewarre. Do kinst dizze opslach útskeakelje yn de browsersettings of yn de foarkarren fan de side (as oanbean).</p><p>Foar ynwenners fan Kalifornje: Wy sammelje, ferkeapje of diele gjin \"persoanlike ynformaasje\" neffens CCPA/CPRA. Wy jouwe gjin persoansgegevens oan tredden foar jild of oare wearde. Wy brûke of diele gjin \"gefoelige persoanlike ynformaasje\". Om’t wy gjin persoansgegevens sammelje, jilde de measte CCPA/CPRA-rjochten (tagong, wiskjen, korrizjearjen, of ôfmelde foar ferkeap/dielen) meast net. Tinkst dat wy per ûngelok persoansgegevens krigen hawwe, nim kontakt op; wy hannelje it neffens de wet ôf.</p><h2>4. Dyn keuzes en kontrôle</h2><p>Do kinst beheare hoe’t foarkarren bewarre wurde yn dyn browser:</p><ul><li><strong>Browsersettings:</strong> Cookies en lokale opslach blokkearje of wiskje yn privacy- of feilichheidsynstellingen. De side kin dan tema, lêste side, taal of tastimmingsstatus net mear ûnthâlde.</li><li><strong>Yn-site kontrôles (as oanbean):</strong> In schakelaar of banner kin oanbean wurde om foarkarsopslach oan/út te setten. Setst it út, dan stopje wy mei nije foarkarren; besteande gegevens bliuwe oant do se sels wiskest.</li></ul><h2>5. Bern</h2><p>De webside is net bedoeld foar bern ûnder 13 jier (of hegere leeftyd neffens lokale wet) en wy sammelje bewust gjin persoansgegevens fan bern. Wy meitsje gjin profilen fan bern en rjochtsje ús net spesifyk op harren.</p><h2>6. Tsjinsten fan tredden</h2><p>Wy ûntwerpe de side sa dat der gjin analytics-, advertinsje- of trackingtsjinsten fan tredden mei persoansgegevens brûkt wurde. Mocht dat yn ’e takomst feroarje, dan wurkje wy dizze ferklearring by en leverje dúdlike ynformaasje en kontrôles neffens de wet.</p><h2>7. Ynternasjonale brûkers</h2><p>De side kin wrâldwiid besjoen wurde, mar ús praktyk is om gjin persoansgegevens fan hokker brûker dan ek te sammeljen. As in privacywet (lykas GDPR of LGPD) fan tapassing is, minimalisearje wy de samling ta net-persoanlike foarkarsgegevens bewarre yn dyn browser.</p><h2>8. Wizigingen fan dizze ferklearring</h2><p>Wy kinne dizze ferklearring bywurkje as wy foarkarsopslach oanpasse of persoansgegevens begjinne te ferwurkjen. Wy ferfarskje dan de datum \"Lêst bywurke\" boppe-oan en publisearje de nije ferzje hjir. As wy ea persoansgegevens sammelje, dogge wy dat pas nei in bywurke ferklearring en, wêr’t nedich, mei dyn tastimming.</p><h2>9. Kontakt</h2><p>Fragen of tinkst dat wy persoansgegevens per ûngelok krigen hawwe? Nim kontakt op mei:</p><p>Email: planefence (at) kx1t (dot) com<br>Postadres: PO Box 11, Belmont, MA 02478, USA</p><p>Wy beäntwurdzje neffens jildende privacywetjouwing.</p>"
      }
    },
    "li-NL": {
      "name": "Limburgs",
      "flag": "nl",
      "flag_path": "./assets/flags/Limburg.gif",
      "strings": {
        "privacy.title": "Privacyverklaring",
        "privacy.lastUpdated": "Laatste aanpassing: 24-jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"veur mich\") set zich in veur dien privacy. Dees Privacyverklaring leet zien hoe veer mit informatie umgaon as geer ós website gebroek.</p><p>Planefence weurt es softwarepakket (Docker-container) verspreid en weurt geïnstalleerd, uitgerold en/of oetgebaat door personen (\"Operators\") die gein band höbbe mit de auteur(s) of de SDR-Enthusiasts-organisasie. Diese Operators draaie Planefence ónger de veurwaarde van de GNU Public License, versie 3, en höbbe allein en exklusief de verantwoording veur ’t gedrach van de software en veur ’t nao-leve van alle toepaslike wetten en regels.</p><h2>1. Gein persoonsgegajevene verzuumele</h2><p>We höbbe de site zo opgezet dat veer gein persoonsgegajevene verzuumele, opsjlaon of verwerke ónger de EU/UK GDPR, de Californische CCPA/CPRA en de Braziliaanse LGPD. Dien verzeuk kin via anger servers gaon veur ’t ós bereik; die kinne angers mit dien gegajeve umgaon. Veer höbbe daar gein invloead op; regelt dien privacywense zelf mit die diens.</p><p>Veer verzuumele, bewere of verwerke gein gegajeve die ’n persoon kinne óngerkennen of realisties koppelen, such as:</p><ul><li>Name, e-mail, telefoon of postadres</li><li>Gebroekersaccounts of inloggegajeve</li><li>IP-adresse gekoppeld aan personen</li><li>Online identifiers of profielgegajeve</li><li>Locatiegegajeve</li><li>Betalings- of transactie-informatie</li></ul><p>Veer gebroeke ouch gein analytics, advertentiecookies, trackingpixels of vergelijkbare technieken óm gebroekers euver tied te volgke.</p><p>Omdat veer gein persoonsgegajevene verzuumele, doon veer ’t volgende neet:</p><ul><li>Persoonsgegajevene verkaupe, deile of openbaar make aan derden</li><li>Persoonsgegajevene gebroeke veur reclames, profiling of marketing</li><li>Automatisch beslute of profilere op basis van persoonsgegajevene</li></ul><h2>2. Informatie in dien browser (locale opsjlaog / cookies)</h2><p>De website bewaart ’n klein beetje informatie allein in dien browser, óm dien voorkeuren te onthauwe. Dat geit neet nao ós servers en is veur ós neet te zien as persoonsgegajeve.</p><p>Veer kinne voorkeurgegajeve opsjlaon in dien browser (locale opsjlaog, cookies of vergelijkbare technieken), ónger anger:</p><ul><li>Themapreferentie: donkeren of lichte modus</li><li>Laotste bezoch site: \"planefence\" of \"plane-alert\"</li><li>Taalpreferentie: de geselekteerde taal van de site</li><li>Consent-registratie (as geer ’t aanzet): of geer toestem eigs veur ’t opsjlaon van dizze voorkeuren</li></ul><p>Deze voorkeurwaarden:</p><ul><li>Gebroek veur ’t verbetere van dien ervaoring (thema, taal, laotste pagina onthauwe)</li><li>Staon lokaal in dien browser en gaon neet as persoonsgegajeve nao ós</li><li>Bevotte gein name, e-mail, IP of anger identificerende gegajeve</li></ul><p>Kiest geer neet veur diese opsjlaog, dan blieft de site werke, mer mot geer mogelijk elke kiër opnuuj voorkeuren instelle.</p><h2>3. Juridische basis en naleving (GDPR, CCPA/CPRA, LGPD)</h2><p>Ónger GDPR en LGPD verweke veer gein persoonsgegajevene. De beperkte voorkeurinformatie in dien browser is óf noodzakelek veur basisfuncties (b.v. taal onthauwe) óf bewaard mit dien toestem. Geer kinne deze opsjlaog uitschaekele in browserinstellingen of in de site-voorkeuren (as aangebaj).</p><p>Veur inwoners van Californië: Veer verzuumele, verkaupe of deile gein \"persoonsinformasie\" ónger de CCPA/CPRA. Veer geave gein persoonsgegajeve aan derden veur geld of anger wearde. Veer gebroeke of deile gein \"gevoelige persoonsinformasie\". Omdat veer gein persoonsgegajevene verzuumele, zint de meiste CCPA/CPRA-rechte (toegang, wisse, corrigere, of ófmelden veur verkoop/deling) meestal neet van toepassing. Dinkse dat veer per ongelt persoongsgegajeve kriege höbbe, meld ’t ós; veer hanjele neet volgens de wet.</p><h2>4. Dien keuzen en controle</h2><p>Geer kinne bepaole hoe voorkeurinformatie in dien browser bewaart weurt:</p><ul><li><strong>Browserinstellingen:</strong> Cookies en locale opsjlaog blokkere of wisse in privacy- of beveiligingsinstellingen. De site kan dan thema, laotste pagina, taal of consentstatus neet mie onthauwe.</li><li><strong>In-site controles (as aangebaj):</strong> ’n Schakelaar of banner kan aangebaj weure om opsjlaog van voorkeuren aan/uit te setten. Zet geer ’t oet, dan höbbe veer op houwe mit nieuwe voorkeuren; bestaande data blief tot geer ze zelf wisse.</li></ul><h2>5. Kinger</h2><p>De site is neet bedoeld veur kinger ónger 13 jaor (of ’n hogere leefdied volgens locale wet) en veer verzuumele bewust gein persoonsgegajevene van kinger. Veer make gein profielen van kinger en richtse ós neet op höbbe.</p><h2>6. Derdepatsdiensten</h2><p>Veer ontwerpe de site zo dat gein analytics-, advertinsje- of trackingdiensten van derden die persoonsgegajeve verweke yngezet weure. As dat in de toekomst toch gebaort, passe veer deze ferklearing aan en biede duidlike informatie en controles neet de wet.</p><h2>7. Internasjonale gebroekers</h2><p>De site kin wereldwijd bezoch weure, mer ós praktyk is gein persoonsgegajevene van ook wae gebroeker te verzuumele. As ’n privacywet (b.v. GDPR of LGPD) geld, minimalisere veer de sameling tot niet-persoonlike voorkeurdata lokaal opsjlaon in dien browser.</p><h2>8. Wizjigingen</h2><p>Veer kinne deze ferklearing bieje as veer de opsjlaog fan voorkeuren oanpasse of begós mit persoonsgegajeve. Veer werk de datum \"Laatste aanpassing\" boppe biij en publiceer de nije versie hie. As veer oait persoongsgegajeve verzuumele, dóón veer dat pas nao ’n bieje ferklearing en, waernodig, mit dien toestem.</p><h2>9. Contact</h2><p>Vraoge of vermoedens dat veer per ongelt persoonsgegajeve kriege höbbe? Nem contact op:</p><p>Email: planefence (at) kx1t (dot) com<br>Postadres: PO Box 11, Belmont, MA 02478, USA</p><p>Veer reageere neet de geljende privacywetgeving.</p>"
      }
    },
    "de-DE": {
      "name": "Deutsch",
      "flag": "de",
      "flag_path": "",
      "strings": {
        "privacy.title": "Datenschutzerklärung",
        "privacy.lastUpdated": "Letzte Aktualisierung: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"wir\", \"uns\" oder \"unser\") verpflichtet sich, Ihre Privatsphäre zu schützen. Diese Datenschutzerklärung erklärt, wie wir mit Informationen umgehen, wenn Sie unsere Website nutzen.</p><p>Planefence wird als Softwarepaket (Docker-Container) verbreitet und von Personen (\"Operatoren\") installiert, bereitgestellt und/oder betrieben, die weder mit dem/den Autor(en) noch mit der Organisation SDR-Enthusiasts verbunden sind. Diese Operatoren betreiben Planefence unter den Bedingungen der GNU Public License, Version 3, und tragen allein und ausschließlich die Verantwortung für das Verhalten der Software sowie die Einhaltung aller anwendbaren Gesetze und Vorschriften.</p><h2>1. Keine persönlichen Daten gesammelt</h2><p>Wir haben diese Website so gestaltet, dass wir keine personenbezogenen Daten im Sinne der EU/UK-Datenschutz-Grundverordnung (\"DSGVO\"), des California Consumer Privacy Act und des California Privacy Rights Act (\"CCPA/CPRA\") und der brasilianischen Lei Geral de Protecao de Dados Pessoais (\"LGPD\") erheben, speichern oder verarbeiten. Beachten Sie, dass Ihre Zugriffsanfrage andere Webserver passieren kann, bevor sie uns erreicht, und dass diese Server Ihre Daten anders behandeln können. Wir haben keine Kenntnis davon, und sie sind außerhalb unseres Kontrollbereichs; Sie sollten Ihre Datenschutzanforderungen direkt mit diesen Dienstleistungen verwalten, wenn erforderlich.</p><p>Wir erheben, speichern oder verarbeiten keine Informationen, die mit einer Person (\"persönliche Informationen\" oder \"persönliche Daten\") identifizierbar sind, wie z.B.:</p><ul><li>Namen, E-Mail-Adressen, Telefonnummern oder Postadressen</li><li>Benutzerkonten oder Anmeldedaten</li><li>IP-Adressen im Zusammenhang mit Einzelpersonen</li><li>Online-Kennzeichen oder Profilierungsdaten</li><li>Standortdaten</li><li>Zahlungs- und Transaktionsinformationen</li></ul><p>Wir verwenden auch keine Analyse, Werbe-Cookies, Tracking-Pixel oder ähnliche Technologien, die es uns oder Dritten ermöglichen würden, einzelne Nutzer im Laufe der Zeit zu identifizieren oder zu verfolgen.</p><p>Weil wir keine persönlichen Daten sammeln, wir:</p><ul><li>Verkaufen, Teilen oder Weitergabe personenbezogener Daten an Dritte</li><li>Verwenden Sie keine personenbezogenen Daten für Werbung, Profiling oder Marketing</li><li>Sie führen keine automatisierte Entscheidungsfindung oder Profilierung aufgrund personenbezogener Daten durch</li></ul><h2>2. In Ihrem Browser gespeicherte Informationen (Speicher / Cookies)</h2><p>Die Website speichert eine sehr kleine Menge von Informationen nur in Ihrem Browser, nur um Ihre Präferenzen zu erinnern. Diese Informationen werden nicht an unsere Server gesendet und sind uns nicht in einer Form zugänglich, die Sie identifiziert.</p><p>Wir können Präferenzdaten in Ihrem Browser speichern (über lokale Speicherung, Cookies oder ähnliche Technologien), inklusive, aber nicht beschränkt auf:</p><ul><li>Thema Präferenz: ob Sie dunklen Modus oder Lichtmodus bevorzugen</li><li>Zuletzt angesehene Seite: ob Sie zuletzt die \"Planefence\" oder \"plane-alert\" Seite besucht haben</li><li>Spracheinstellung: Ihre gewählte Sprache für die Website</li><li>Einwilligungsdatensatz (falls abweichend): ob Sie uns bei der Speicherung dieser Präferenzen in Ihrem Browser einverstanden waren</li></ul><p>Diese Vorzugswerte:</p><ul><li>Werden nur verwendet, um Ihre Erfahrung zu verbessern (z.B. Erinnerung an Ihr gewähltes Thema, Sprache und letzte Seite)</li><li>werden lokal in Ihrem Browser gespeichert und nicht als personenbezogene Daten an uns übermittelt</li><li>Enthalten Sie Ihren Namen, Ihre E-Mail, Ihre IP-Adresse oder eine andere persönliche Kennung nicht</li></ul><p>Wenn Sie diese Präferenzspeicherung nicht zulassen möchten, können Sie die Website dennoch nutzen, aber Sie müssen Ihre Präferenzen bei jedem Besuch neu auswählen.</p><h2>3. Rechtsgrundlage und Compliance (DSGVO, CCPA/CPRA, LGPD)</h2><p>Unter DSGVO und LGPD verarbeiten wir keine personenbezogenen Daten. Die in Ihrem Browser gespeicherten eingeschränkten Präferenzinformationen sind entweder notwendig, um die grundlegende Funktionalität und Benutzererfahrung der Website (z.B. die Sprachauswahl zu halten) bereitzustellen oder gegebenenfalls mit Ihrer Einwilligung zu speichern. Sie können diese Speicherung jederzeit über Ihre Browser-Einstellungen deaktivieren oder die auf unserer Website verfügbaren Präferenzen anpassen (falls vorhanden).</p><p>Für Einwohner in Kalifornien: Wir sammeln, verkaufen oder teilen \"persönliche Informationen\" im Sinne der CCPA/CPRA. Wir geben keine personenbezogenen Daten an Dritte zur monetären oder anderen wertvollen Betrachtung weiter. Wir verwenden oder offenlegen \"sensitive personenbezogene Daten\". Da wir keine personenbezogenen Daten erheben, sind die typischen CCPA/CPRA-Rechte (z.B. das Recht auf Zugriff, Löschung oder Berichtigung personenbezogener Daten und das Recht auf Ausverkauf oder Weitergabe) in der Regel nicht auf unsere Website anwendbar. Wenn Sie glauben, dass wir unabsichtlich personenbezogene Daten gesammelt haben, kontaktieren Sie uns bitte unter Verwendung der untenstehenden Angaben und wir werden Ihre Anfrage gemäß geltendem Recht ansprechen.</p><h2>4. Ihre Auswahl und Kontrolle</h2><p>Sie können steuern, wie Präferenzinformationen in Ihrem Browser auf folgende Weise gespeichert werden:</p><ul><li><strong>Browsereinstellungen:</strong> Sie können Cookies und lokale Speicherdaten durch die Datenschutz- oder Sicherheitseinstellungen Ihres Browsers blockieren oder löschen. Wenn Sie dies tun, kann sich die Website nicht mehr an Ihren dunklen / hellen Modus, zuletzt besuchte Seite, Sprache oder Zustimmung Status erinnern.</li><li><strong>Vor-Ort-Einstellungen (falls vorhanden):</strong> Wir können eine in-page-Steuerung (z.B. ein Knebel oder Banner) anbieten, die es Ihnen erlaubt, Präferenzen einzu- oder ausspeichern. Wenn Sie sich entscheiden, werden wir versuchen, die Speicherung neuer Präferenzdaten in Ihrem Browser zu stoppen, aber Ihr Browser kann noch vorhandene Daten speichern, bis Sie es löschen.</li></ul><h2>5. Kinderschutz</h2><p>Unsere Website richtet sich nicht an Kinder unter 13 Jahren (oder ein höheres Alter nach dem lokalen Recht), und wir sammeln keine persönlichen Daten von Kindern. Da wir überhaupt keine personenbezogenen Daten sammeln, erstellen wir keine Profile von Kindern oder zielen sie für beliebige Zwecke an.</p><h2>6. Dienstleistungen Dritter Teil</h2><p>Wir entwerfen unsere Website nicht, um Fremdanalytik, Werbung oder Tracking-Dienste zu integrieren, die persönliche Informationen sammeln. Wenn wir in Zukunft Inhalte oder Tools von Drittanbietern integrieren, die personenbezogene Daten verarbeiten könnten, werden wir diese Datenschutzerklärung aktualisieren und klare Informationen und Kontrollen im Einklang mit den geltenden Datenschutzgesetzen bereitstellen.</p><h2>7. Internationale Nutzer</h2><p>Unsere Website kann aus verschiedenen Ländern aufgerufen werden, aber unsere Praktiken sind so konzipiert, dass wir keine persönlichen Informationen von jedem Benutzer sammeln, unabhängig von Standort. Soweit ein Datenschutzrecht (z.B. DSGVO oder LGPD) gilt, ist unser Ansatz, die Datenerhebung auf nicht personenbezogene Daten, die lokal in Ihrem Browser gespeichert sind, zu minimieren.</p><h2>8. Änderungen an dieser Datenschutzerklärung</h2><p>Wir können diese Datenschutzerklärung von Zeit zu Zeit aktualisieren, zum Beispiel, wenn wir ändern, wie wir Präferenzen speichern oder wenn wir in Zukunft die Verarbeitung personenbezogener Daten beginnen. Wenn wir Änderungen vornehmen, werden wir das \"Letzte aktualisierte\" Datum oben auf dieser Seite aktualisieren und die überarbeitete Datenschutzerklärung auf dieser Seite veröffentlichen. Wenn wir jemals beginnen, personenbezogene Daten zu sammeln, werden wir diese Datenschutzerklärung aktualisieren, bevor diese Sammlung beginnt und, falls erforderlich, Ihre Einwilligung einholen.</p><h2>9. Kontaktieren Sie uns</h2><p>Wenn Sie Fragen zu dieser Datenschutzerklärung haben oder glauben, dass wir unabsichtlich personenbezogene Daten gesammelt haben, können Sie sich an uns wenden:</p><p>Email: planfence (at) kx1t (dot) com<br/>Postanschrift: PO Box 11, Belmont, MA 02478, USA</p><p>Wir werden nach den geltenden Datenschutzgesetzen überprüfen und reagieren.</p>"
      }
    },
    "de-CH": {
      "name": "Schwiizerdütsch",
      "flag": "ch",
      "flag_path": "",
      "strings": {
        "privacy.title": "Datenschutzerklärung",
        "privacy.lastUpdated": "Letzte Aktualisierung: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"wir\", \"uns\" oder \"unser\") verpflichtet sich, Ihre Privatsphäre zu schützen. Diese Datenschutzerklärung erklärt, wie wir mit Informationen umgehen, wenn Sie unsere Website nutzen.</p><p>Planefence wird als Softwarepaket (Docker-Container) verteilt und von Persone (\"Operatoren\") installiert, usgerollt und/oder bedient, wo weder mit em Autor/den Autore no mit dr SDR-Enthusiasts-Organisation verbunde sind. Die Operatoren betreibe Planefence unter dr GNU Public License, Version 3, und trage alleinig und exklusiv d Verantwortung für s Verhalte vo dr Software und für d Iihaltig vo allne gültige Gsetze und Vorschrifte.</p><h2>1. Keine persönlichen Daten gesammelt</h2><p>Wir haben diese Website so gestaltet, dass wir keine personenbezogenen Daten im Sinne der EU/UK-Datenschutz-Grundverordnung (\"DSGVO\"), des California Consumer Privacy Act und des California Privacy Rights Act (\"CCPA/CPRA\") und der brasilianischen Lei Geral de Protecao de Dados Pessoais (\"LGPD\") erheben, speichern oder verarbeiten. Beachten Sie, dass Ihre Zugriffsanfrage andere Webserver passieren kann, bevor sie uns erreicht, und dass diese Server Ihre Daten anders behandeln können. Wir haben keine Kenntnis davon, und sie sind außerhalb unseres Kontrollbereichs; Sie sollten Ihre Datenschutzanforderungen direkt mit diesen Dienstleistungen verwalten, wenn erforderlich.</p><p>Wir erheben, speichern oder verarbeiten keine Informationen, die mit einer Person (\"persönliche Informationen\" oder \"persönliche Daten\") identifizierbar sind, wie z.B.:</p><ul><li>Namen, E-Mail-Adressen, Telefonnummern oder Postadressen</li><li>Benutzerkonten oder Anmeldedaten</li><li>IP-Adressen im Zusammenhang mit Einzelpersonen</li><li>Online-Kennzeichen oder Profilierungsdaten</li><li>Standortdaten</li><li>Zahlungs- und Transaktionsinformationen</li></ul><p>Wir verwenden auch keine Analyse, Werbe-Cookies, Tracking-Pixel oder ähnliche Technologien, die es uns oder Dritten ermöglichen würden, einzelne Nutzer im Laufe der Zeit zu identifizieren oder zu verfolgen.</p><p>Weil wir keine persönlichen Daten sammeln, wir:</p><ul><li>Verkaufen, Teilen oder Weitergabe personenbezogener Daten an Dritte</li><li>Verwenden Sie keine personenbezogenen Daten für Werbung, Profiling oder Marketing</li><li>Sie führen keine automatisierte Entscheidungsfindung oder Profilierung aufgrund personenbezogener Daten durch</li></ul><h2>2. In Ihrem Browser gespeicherte Informationen (Speicher / Cookies)</h2><p>Die Website speichert eine sehr kleine Menge von Informationen nur in Ihrem Browser, nur um Ihre Präferenzen zu erinnern. Diese Informationen werden nicht an unsere Server gesendet und sind uns nicht in einer Form zugänglich, die Sie identifiziert.</p><p>Wir können Präferenzdaten in Ihrem Browser speichern (über lokale Speicherung, Cookies oder ähnliche Technologien), inklusive, aber nicht beschränkt auf:</p><ul><li>Thema Präferenz: ob Sie dunklen Modus oder Lichtmodus bevorzugen</li><li>Zuletzt angesehene Seite: ob Sie zuletzt die \"Planefence\" oder \"plane-alert\" Seite besucht haben</li><li>Spracheinstellung: Ihre gewählte Sprache für die Website</li><li>Einwilligungsdatensatz (falls abweichend): ob Sie uns bei der Speicherung dieser Präferenzen in Ihrem Browser einverstanden waren</li></ul><p>Diese Vorzugswerte:</p><ul><li>Werden nur verwendet, um Ihre Erfahrung zu verbessern (z.B. Erinnerung an Ihr gewähltes Thema, Sprache und letzte Seite)</li><li>werden lokal in Ihrem Browser gespeichert und nicht als personenbezogene Daten an uns übermittelt</li><li>Enthalten Sie Ihren Namen, Ihre E-Mail, Ihre IP-Adresse oder eine andere persönliche Kennung nicht</li></ul><p>Wenn Sie diese Präferenzspeicherung nicht zulassen möchten, können Sie die Website dennoch nutzen, aber Sie müssen Ihre Präferenzen bei jedem Besuch neu auswählen.</p><h2>3. Rechtsgrundlage und Compliance (DSGVO, CCPA/CPRA, LGPD)</h2><p>Unter DSGVO und LGPD verarbeiten wir keine personenbezogenen Daten. Die in Ihrem Browser gespeicherten eingeschränkten Präferenzinformationen sind entweder notwendig, um die grundlegende Funktionalität und Benutzererfahrung der Website (z.B. die Sprachauswahl zu halten) bereitzustellen oder gegebenenfalls mit Ihrer Einwilligung zu speichern. Sie können diese Speicherung jederzeit über Ihre Browser-Einstellungen deaktivieren oder die auf unserer Website verfügbaren Präferenzen anpassen (falls vorhanden).</p><p>Für Einwohner in Kalifornien: Wir sammeln, verkaufen oder teilen \"persönliche Informationen\" im Sinne der CCPA/CPRA. Wir geben keine personenbezogenen Daten an Dritte zur monetären oder anderen wertvollen Betrachtung weiter. Wir verwenden oder offenlegen \"sensitive personenbezogene Daten\". Da wir keine personenbezogenen Daten erheben, sind die typischen CCPA/CPRA-Rechte (z.B. das Recht auf Zugriff, Löschung oder Berichtigung personenbezogener Daten und das Recht auf Ausverkauf oder Weitergabe) in der Regel nicht auf unsere Website anwendbar. Wenn Sie glauben, dass wir unabsichtlich personenbezogene Daten gesammelt haben, kontaktieren Sie uns bitte unter Verwendung der untenstehenden Angaben und wir werden Ihre Anfrage gemäß geltendem Recht ansprechen.</p><h2>4. Ihre Auswahl und Kontrolle</h2><p>Sie können steuern, wie Präferenzinformationen in Ihrem Browser auf folgende Weise gespeichert werden:</p><ul><li><strong>Browsereinstellungen:</strong> Sie können Cookies und lokale Speicherdaten durch die Datenschutz- oder Sicherheitseinstellungen Ihres Browsers blockieren oder löschen. Wenn Sie dies tun, kann sich die Website nicht mehr an Ihren dunklen / hellen Modus, zuletzt besuchte Seite, Sprache oder Zustimmung Status erinnern.</li><li><strong>Vor-Ort-Einstellungen (falls vorhanden):</strong> Wir können eine in-page-Steuerung (z.B. ein Knebel oder Banner) anbieten, die es Ihnen erlaubt, Präferenzen einzu- oder ausspeichern. Wenn Sie sich entscheiden, werden wir versuchen, die Speicherung neuer Präferenzdaten in Ihrem Browser zu stoppen, aber Ihr Browser kann noch vorhandene Daten speichern, bis Sie es löschen.</li></ul><h2>5. Kinderschutz</h2><p>Unsere Website richtet sich nicht an Kinder unter 13 Jahren (oder ein höheres Alter nach dem lokalen Recht), und wir sammeln keine persönlichen Daten von Kindern. Da wir überhaupt keine personenbezogenen Daten sammeln, erstellen wir keine Profile von Kindern oder zielen sie für beliebige Zwecke an.</p><h2>6. Dienstleistungen Dritter Teil</h2><p>Wir entwerfen unsere Website nicht, um Fremdanalytik, Werbung oder Tracking-Dienste zu integrieren, die persönliche Informationen sammeln. Wenn wir in Zukunft Inhalte oder Tools von Drittanbietern integrieren, die personenbezogene Daten verarbeiten könnten, werden wir diese Datenschutzerklärung aktualisieren und klare Informationen und Kontrollen im Einklang mit den geltenden Datenschutzgesetzen bereitstellen.</p><h2>7. Internationale Nutzer</h2><p>Unsere Website kann aus verschiedenen Ländern aufgerufen werden, aber unsere Praktiken sind so konzipiert, dass wir keine persönlichen Informationen von jedem Benutzer sammeln, unabhängig von Standort. Soweit ein Datenschutzrecht (z.B. DSGVO oder LGPD) gilt, ist unser Ansatz, die Datenerhebung auf nicht personenbezogene Daten, die lokal in Ihrem Browser gespeichert sind, zu minimieren.</p><h2>8. Änderungen an dieser Datenschutzerklärung</h2><p>Wir können diese Datenschutzerklärung von Zeit zu Zeit aktualisieren, zum Beispiel, wenn wir ändern, wie wir Präferenzen speichern oder wenn wir in Zukunft die Verarbeitung personenbezogener Daten beginnen. Wenn wir Änderungen vornehmen, werden wir das \"Letzte aktualisierte\" Datum oben auf dieser Seite aktualisieren und die überarbeitete Datenschutzerklärung auf dieser Seite veröffentlichen. Wenn wir jemals beginnen, personenbezogene Daten zu sammeln, werden wir diese Datenschutzerklärung aktualisieren, bevor diese Sammlung beginnt und, falls erforderlich, Ihre Einwilligung einholen.</p><h2>9. Kontaktieren Sie uns</h2><p>Wenn Sie Fragen zu dieser Datenschutzerklärung haben oder glauben, dass wir unabsichtlich personenbezogene Daten gesammelt haben, können Sie sich an uns wenden:</p><p>Email: planfence (at) kx1t (dot) com<br/>Postanschrift: PO Box 11, Belmont, MA 02478, USA</p><p>Wir werden nach den geltenden Datenschutzgesetzen überprüfen und reagieren.</p>"
      }
    },
    "fr-FR": {
      "name": "Français",
      "flag": "fr",
      "flag_path": "",
      "strings": {
        "privacy.title": "Déclaration de confidentialité",
        "privacy.lastUpdated": "Dernière mise à jour 24 janvier-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (« nous ») s'engage à protéger votre vie privée. La présente Déclaration de confidentialité explique comment nous traitons l'information lorsque vous utilisez notre site Web.</p><p>Planefence est distribué comme un paquet logiciel (conteneur Docker) et est installé, déployé et/ou exploité par des personnes (« Opérateurs ») sans lien avec l’auteur ou l’organisation SDR-Enthusiasts. Ces Opérateurs exécutent Planefence selon les termes de la GNU Public License, version 3, et assument seuls l’entière responsabilité du comportement du logiciel et du respect des lois et règlements applicables.</p><h2>1. Aucun renseignement personnel recueilli</h2><p>Nous avons conçu ce site Web afin de ne pas recueillir, stocker ou traiter des informations personnelles au sens du règlement général sur la protection des données (RGPD) de l'UE/Royaume-Uni, de la California Consumer Privacy Act et de la California Privacy Rights Act (CCPA/CPRA) et du Brésil Lei Geral de Protecao de Dados Pessoais (LGPD). Notez que votre demande d'accès peut passer par d'autres serveurs Web avant qu'ils ne nous parviennent, et que ces serveurs peuvent gérer vos données différemment. Nous n'en avons aucune connaissance, et ils sont hors de notre portée de contrôle; vous devriez gérer vos exigences de confidentialité directement avec ces services si nécessaire.</p><p>Nous ne collectons, ne stockons ni ne traitons aucune information qui identifie ou peut raisonnablement être liée à une personne (« renseignements personnels » ou « données personnelles »), comme :</p><ul><li>Noms, adresses e-mail, numéros de téléphone ou adresses postales</li><li>Comptes utilisateur ou informations de connexion</li><li>Adresses IP liées à des particuliers</li><li>Identifications en ligne ou données de profilage</li><li>Données de localisation</li><li>Informations sur le paiement ou la transaction</li></ul><p>Nous n'utilisons pas non plus d'analyse, de cookies publicitaires, de pixels de suivi ou de technologies similaires qui nous permettraient ou permettraient à des tiers d'identifier ou de suivre des utilisateurs individuels au fil du temps.</p><p>Parce que nous ne recueillons pas de renseignements personnels, nous :</p><ul><li>Ne pas vendre, partager ou communiquer des renseignements personnels à des tiers</li><li>Ne pas utiliser les renseignements personnels pour la publicité, le profilage ou la commercialisation</li><li>Ne prenez pas de décision ou de profil automatisés sur la base de données personnelles</li></ul><h2>2. Informations stockées dans votre navigateur (entreposage local / Cookies)</h2><p>Le site ne stocke une très petite quantité d'informations que dans votre navigateur, uniquement pour se souvenir de vos préférences. Ces informations ne sont pas envoyées à nos serveurs et ne nous sont pas accessibles sous une forme qui vous identifie.</p><p>Nous pouvons stocker des données de préférences dans votre navigateur (par le biais du stockage local, des cookies ou des technologies similaires), incluses mais non limitées à:</p><ul><li>Préférence pour le thème: que vous préfériez le mode sombre ou le mode lumineux</li><li>Dernière page visitée : si vous avez visité la dernière page \"planefence\" ou \"plan-alerte\"</li><li>Langue préférée : votre langue sélectionnée pour le site</li><li>Consentement enregistré (si choisi): si vous avez consenti à nous stocker ces préférences dans votre navigateur</li></ul><p>Ces valeurs de préférence:</p><ul><li>Ne sont utilisés que pour améliorer votre expérience (p. ex., se souvenir de votre thème, langue et dernière page)</li><li>Sont stockés localement dans votre navigateur et ne nous sont pas transmis comme données personnelles</li><li>Ne pas contenir votre nom, email, adresse IP ou tout autre identifiant personnel</li></ul><p>Si vous choisissez de ne pas autoriser ce stockage préférentiel, vous pouvez toujours utiliser le site Web, mais vous devrez peut-être sélectionner de nouveau vos préférences chaque fois que vous visitez.</p><h2>3. Base juridique et conformité (RGPD, CCPA/CRPA, LGPD)</h2><p>En vertu du RGPD et de la LGPD, nous ne traitons pas les données personnelles. L'information de préférence limitée stockée dans votre navigateur est soit nécessaire pour fournir la fonctionnalité de base du site et l'expérience utilisateur (par exemple, garder votre choix de langue), ou stockée avec votre consentement, le cas échéant. Vous pouvez désactiver ce stockage à tout moment via les paramètres de votre navigateur ou en ajustant les préférences disponibles sur notre site Web (si fourni).</p><p>Pour les résidents de la Californie: Nous ne recueillons, ne vendons pas ou ne partageons pas de « renseignements personnels » tels que définis par l'ACCP/ERCP. Nous ne divulguons pas de renseignements personnels à des tiers pour une contrepartie pécuniaire ou autre. Nous n'utilisons ni ne divulguons de « renseignements personnels sensibles ». Étant donné que nous ne recueillons pas de renseignements personnels, les droits typiques de l'ACSP/ACDP (comme le droit d'accéder, de supprimer ou de corriger des renseignements personnels et le droit de refuser de vendre ou de partager) ne s'appliquent généralement pas à notre site Web. Si vous pensez que nous avons peut-être recueilli des renseignements personnels par inadvertance, veuillez nous contacter en utilisant les détails ci-dessous, et nous répondrons à votre demande conformément à la loi applicable.</p><h2>4. Vos choix et votre contrôle</h2><p>Vous pouvez contrôler comment les informations de préférence sont stockées dans votre navigateur de la manière suivante:</p><ul><li><strong>Paramètres du navigateur & #160;:</strong> Vous pouvez bloquer ou supprimer les cookies et les données de stockage local via les paramètres de confidentialité ou de sécurité de votre navigateur. Si vous le faites, le site peut ne plus se souvenir de votre mode sombre/lumière, de votre dernière page visitée, de votre langue ou de votre statut de consentement.</li><li><strong>Paramètres sur place (s'il y a lieu):</strong> Nous pouvons offrir un contrôle dans la page (p. ex., un basculement ou une bannière) vous permettant d'opter pour des préférences de stockage. Si vous vous retirez, nous tenterons d'arrêter de stocker de nouvelles données de préférence dans votre navigateur, mais votre navigateur peut conserver les données existantes jusqu'à ce que vous les effaciez.</li></ul><h2>5. Vie privée des enfants</h2><p>Notre site Web n'est pas destiné aux enfants de moins de 13 ans (ou à un âge plus élevé tel que défini par la législation locale), et nous ne recueillons pas sciemment des renseignements personnels auprès des enfants. Comme nous ne recueillons pas du tout de renseignements personnels, nous ne créons pas de profils d'enfants ou ne les ciblons à aucune fin.</p><h2>6. Services à des tiers</h2><p>Nous concevons notre site Web pour ne pas intégrer des services d'analyse, de publicité ou de suivi tiers qui recueillent des renseignements personnels. Si, à l'avenir, nous intégrons tout contenu ou outil de tiers qui pourrait traiter des renseignements personnels, nous mettrons à jour la présente Déclaration de confidentialité et fournirons des renseignements et des contrôles clairs conformément aux lois applicables sur la protection des renseignements personnels.</p><h2>7. Utilisateurs internationaux</h2><p>Notre site Web peut être consulté à partir de différents pays, mais nos pratiques sont conçues de façon à ce que nous ne recueillons aucune information personnelle d'un utilisateur, quel que soit son emplacement. Dans la mesure où une loi sur la protection de la vie privée (comme le RGPD ou le LGPD) s'applique, notre approche consiste à minimiser la collecte de données aux données non personnelles privilégiées stockées localement dans votre navigateur seulement.</p><h2>8. Changements apportés à la présente déclaration de confidentialité</h2><p>Nous pouvons mettre à jour cette déclaration de confidentialité de temps à autre, par exemple, si nous changeons la façon dont nous stockons nos préférences ou si nous commençons à traiter des renseignements personnels à l'avenir. Lorsque nous apporterons des modifications, nous mettrons à jour la date de la dernière mise à jour en haut de cette page et publierons la Déclaration de confidentialité révisée sur cette page. Si nous commençons à recueillir des renseignements personnels, nous mettrons à jour cette déclaration de confidentialité avant de commencer cette collecte et, au besoin, d'obtenir votre consentement.</p><h2>9. Contactez-nous</h2><p>Si vous avez des questions au sujet de cette déclaration de confidentialité ou si vous croyez que nous avons peut-être recueilli des renseignements personnels par inadvertance, vous pouvez communiquer avec nous à l'adresse suivante :</p><p>Courriel: planfence (at) kx1t (dot) com<br/>Adresse postale: PO Box 11, Belmont, MA 02478, USA</p><p>Nous examinerons et répondrons conformément aux lois applicables sur la protection des renseignements personnels.</p>"
      }
    },
    "it-IT": {
      "name": "Italiano",
      "flag": "it",
      "flag_path": "",
      "strings": {
        "privacy.title": "Informativa sulla privacy",
        "privacy.lastUpdated": "Ultimo aggiornamento: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"noi\", \"noi\",\" o \"nostro\") si impegna a proteggere la tua privacy. Questa informativa sulla privacy spiega come gestiamo le informazioni quando utilizzi il nostro sito web.</p><p>Planefence è distribuito come pacchetto software (contenitore Docker) ed è installato, distribuito e/o gestito da persone (\"Operatori\") senza alcun legame con l’autore o con l’organizzazione SDR-Enthusiasts. Questi Operatori eseguono Planefence secondo i termini della GNU Public License, versione 3, e hanno la responsabilità unica ed esclusiva del comportamento del software e del rispetto di tutte le leggi e normative applicabili.</p><h2>1. No Dati personali raccolti</h2><p>Abbiamo progettato questo sito in modo da non raccogliere, memorizzare o elaborare le informazioni personali ai sensi del Regolamento generale sulla protezione dei dati UE/UK (\"GDPR\"), della legge sulla privacy dei consumatori della California e della legge sulla privacy della California (\"CCPA/CPRA\"), e del Brasile Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Si noti che la richiesta di accesso può passare attraverso altri server web prima di raggiungerci, e che questi server possono gestire i dati in modo diverso. Non abbiamo conoscenza di questi, e sono al di fuori della nostra portata di controllo; si dovrebbe gestire i vostri requisiti di privacy direttamente con questi servizi, se necessario.</p><p>Non raccogliamo, archiviamo o elaboriamo alcuna informazione che identifica o possa ragionevolmente essere collegata a un individuo (\"informazioni personali\" o \"dati personali\"), come ad esempio:</p><ul><li>Nomi, indirizzi email, numeri di telefono o indirizzi postali</li><li>Conti utente o dettagli di login</li><li>Indirizzi IP collegati a persone</li><li>Identificatori online o dati di profilazione</li><li>Dati di localizzazione</li><li>Informazioni sul pagamento o sulle transazioni</li></ul><p>Inoltre non utilizziamo cookie di analisi, pubblicità, pixel di tracciamento o tecnologie simili che ci consentano o terze parti di identificare o monitorare gli utenti individuali nel tempo.</p><p>Perché non raccogliamo informazioni personali, noi:</p><ul><li>Non vendere, condividere o divulgare informazioni personali a terzi</li><li>Non utilizzare dati personali per la pubblicità, la profilazione o il marketing</li><li>Non condurre processi decisionali automatizzati o di profilazione in base ai dati personali</li></ul><h2>2. Informazioni memorizzate nel Browser (Local Storage / Cookies)</h2><p>Il sito web memorizza una quantità molto piccola di informazioni solo nel tuo browser, solo per ricordare le tue preferenze. Queste informazioni non vengono inviate ai nostri server e non sono accessibili a noi in un modulo che ti identifica.</p><p>Possiamo memorizzare i dati di preferenza nel tuo browser (tramite storage locale, cookie o tecnologie simili), inclusi ma non limitati a:</p><ul><li>Preferenze a tema: se si preferisce la modalità oscura o la modalità luminosa</li><li>Ultima pagina visualizzata: se hai visitato l'ultima pagina \"planefence\" o \"plane-alert\"</li><li>Preferenze linguistiche: la lingua selezionata per il sito</li><li>Consent record (se optato per): se hai acconsentito a memorizzare queste preferenze nel tuo browser</li></ul><p>Questi valori di preferenza:</p><ul><li>Sono utilizzati solo per migliorare la vostra esperienza (ad esempio, ricordando il tema scelto, la lingua e l'ultima pagina)</li><li>Sono memorizzati localmente nel vostro browser e non vengono trasmessi a noi come dati personali</li><li>Non contengono il tuo nome, email, indirizzo IP o qualsiasi altro identificativo personale</li></ul><p>Se si sceglie di non consentire questa memorizzazione delle preferenze, è ancora possibile utilizzare il sito web, ma si potrebbe dover ri-selezionare le preferenze ogni volta che si visita.</p><h2>3. Base giuridica e conformità (GDPR, CCPA/CPRA, LGPD)</h2><p>Ai sensi del GDPR e della LGPD, non elaboriamo dati personali. Le informazioni di preferenza limitate memorizzate nel vostro browser sono necessarie per fornire funzionalità di base del sito e l'esperienza dell'utente (ad esempio, mantenere la selezione della lingua), o memorizzate con il vostro consenso laddove applicabile. È possibile disattivare questa memorizzazione in qualsiasi momento attraverso le impostazioni del browser o regolando le preferenze disponibili sul nostro sito web (se fornito).</p><p>Per i residenti della California: Non raccogliamo, vendiamo o condividiamo \"informazioni personali\" come definito dal CCPA/CPRA. Non divulghiamo informazioni personali a terzi per la valuta o altre considerazioni di valore. Non usiamo o divulghiamo \"informazioni personali sensibili\". Poiché non raccogliamo informazioni personali, i diritti tipici di CCPA/CPRA (come il diritto di accesso, cancellazione o corrette informazioni personali, e il diritto di optare per la vendita o la condivisione) non sono generalmente applicabili al nostro sito web. Se ritenete che potremmo avere informazioni personali inavvertitamente raccolte, vi preghiamo di contattarci utilizzando i dettagli qui sotto, e noi affronteremo la vostra richiesta in conformità con la legge applicabile.</p><h2>4. Le tue scelte e controllo</h2><p>È possibile controllare come le informazioni di preferenza vengono memorizzate nel browser nei seguenti modi:</p><ul><li><strong>Impostazioni del browser:</strong> È possibile bloccare o eliminare i cookie e i dati di archiviazione locali attraverso le impostazioni di privacy o sicurezza del browser. Se lo fai, il sito web non può più ricordare la modalità dark/light, l'ultima pagina visitata, la lingua o lo stato del consenso.</li><li><strong>Impostazioni in loco (se fornite):</strong> Possiamo offrire un controllo in-page (ad es., un toggle o un banner) che consente di scegliere in o fuori di memorizzare le preferenze. Se si opta, cercheremo di smettere di memorizzare nuovi dati di preferenza nel browser, ma il browser potrebbe ancora conservare i dati esistenti fino a quando non si chiarisce.</li></ul><h2>5. Privacy dei bambini</h2><p>Il nostro sito web non è rivolto ai bambini di età inferiore ai 13 anni (o ad un'età più alta definita dalla legge locale), e non raccogliamo consapevolmente informazioni personali dai bambini. Dal momento che non raccogliamo affatto informazioni personali, non creiamo profili di bambini o li beviamo per qualsiasi scopo.</p><h2>6. Servizi di terze parti</h2><p>Progettiamo il nostro sito web per non incorporare servizi di analisi, pubblicità o monitoraggio di terze parti che raccolgono informazioni personali. Se in futuro integriamo qualsiasi contenuto o strumento di terze parti in grado di elaborare le informazioni personali, aggiorneremo questa Informativa sulla privacy e fornire informazioni chiare e controlli coerenti con le leggi sulla privacy applicabili.</p><h2>7. Utenti internazionali</h2><p>Il nostro sito web può essere accessibile da diversi paesi, ma le nostre pratiche sono progettate in modo che non raccogliamo informazioni personali da qualsiasi utente, indipendentemente dalla posizione. Nella misura in cui si applica qualsiasi legge sulla privacy (come il GDPR o LGPD), il nostro approccio è quello di minimizzare la raccolta dei dati ai dati di preferenza non personali memorizzati localmente nel tuo browser solo.</p><h2>8. Modifiche alla presente informativa sulla privacy</h2><p>Possiamo aggiornare la presente Informativa sulla privacy di volta in volta, ad esempio, se modifichiamo come memorizzare le preferenze o se iniziamo a trattare le informazioni personali in futuro. Quando modificheremo, aggiorneremo la data \"Ultimo aggiornamento\" in cima a questa pagina e pubblicheremo la nuova Informativa sulla privacy in questa pagina. Se mai iniziamo a raccogliere informazioni personali, aggiorneremo la presente Informativa sulla privacy prima dell'inizio della raccolta e, se necessario, ottenere il tuo consenso.</p><h2>9. Contattaci</h2><p>Se hai domande su questa Informativa sulla privacy o credi che potremmo avere informazioni personali inavvertitamente raccolte, puoi contattarci a:</p><p>Email: planfence (at) kx1t (dot) com<br/>Indirizzo postale: PO Box 11, Belmont, MA 02478, USA</p><p>Rivedremo e risponderemo in conformità con le leggi sulla privacy applicabili.</p>"
      }
    },
    "la": {
      "name": "Latina",
      "flag": "va",
      "flag_path": "./assets/flags/Roman_Empire.jpg",
      "strings": {
        "privacy.title": "Declaratio de Privatis",
        "privacy.lastUpdated": "Novissime renovatum: 24-Ian-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"nos\") tuae privati tutelae studet. Haec Declaratio explicat quomodo informationes tractemus cum nostrum locum interretialem uteris.</p><p>Planefence tamquam fasciculus programmatis (dolium Docker) distribuitur et a singulis (\"Operatoribus\") qui neque cum auctore neque cum SDR-Enthusiasts consociatione coniuncti sunt instituutur, explicatur vel administratur. Hi Operatores Planefence sub condicionibus GNU Public License, versio 3, currunt atque soli et exclusive responsabilitatem ferunt de moribus programmatis et de observantia legum ac regularum omnium applicabilium.</p><h2>1. Nulla notitia personalis collecta</h2><p>Locum sic designavimus ut nullas notitias personales colligamus, reponamus, aut tractemus iuxta GDPR EU/UK, CCPA/CPRA Californiae, et LGPD Brasiliae. Petitio tua per alia servientia transire potest antequam ad nos perveniat; illa notitias tuas aliter tractare possunt. De his nihil scimus nec eas regere possumus; tuas postulationes cum illis pertracta.</p><p>Non colligimus, reponimus, nec tractamus ullas notitias quae personam designant aut rationabiliter conecti possunt, ut:</p><ul><li>Nomina, inscriptiones electronicae, telephona, aut domicilia</li><li>Rationes usoris aut data aditum</li><li>Inscriptiones IP personis adnexae</li><li>Identificatoria online aut data profilandi</li><li>Data locorum</li><li>Informationes solutionum aut transactionum</li></ul><p>Nec utimur analytica, crustulis publicitatis, pixelis vestigantibus, aut similibus technologiis ad utentes per tempus sequi.</p><p>Quia notitias personales non colligimus, hoc non facimus:</p><ul><li>Non vendimus, communicamus, neque patefacimus notitias personales ad tertios</li><li>Non utimur notitiis personalibus ad mercatum, profiling, aut promotionem</li><li>Non exercemus decisiones automatas aut profiling fundatas in datis personalibus</li></ul><h2>2. Notitia in tuo navigatro (repositio localis / crustula)</h2><p>Pagina minimum notitiarum tantum in tuo navigatro servat, ad memoriam tuarum optionum. Haec ad nostra servientia non mittuntur nec a nobis tamquam data personalia attingi possunt.</p><p>Servare possumus data praeferentiarum in navigatro tuo (repositio localis, crustula, aut similia), inter quae:</p><ul><li>Thema: modus ater vel clarus</li><li>Ultima pagina visa: \"planefence\" aut \"plane-alert\"</li><li>Lingua: lingua selecta situs</li><li>Memoria consensus (si optasti): utrum consensum dedisti ad has praeferentias servandas</li></ul><p>Haec praeferentiae:</p><ul><li>Tantum ad experientiam tuam emendandam utuntur (thema, linguam, ultimam paginam meminisse)</li><li>Localiter servantur et non transmittuntur nobis ut data personalia</li><li>Non continent nomen, inscriptionem electronicam, IP, aut aliud indicium identificans</li></ul><p>Si hanc repositiônem vetas, situs manebit utilis, sed praeferentias saepius iterum eligere debebis.</p><h2>3. Basis iuridica et observantia (GDPR, CCPA/CPRA, LGPD)</h2><p>Sub GDPR et LGPD non tractamus data personalia. Pauca praeferentiarum data in navigatro tuo vel necessaria sunt ad functiones fundamentales (p. ex. linguam meminisse) vel cum consensu tuo servantur. Hanc repositiônem inhibere potes per configurationes navigatri aut per optiones in situ (si praebentur).</p><p>Pro civibus Californiae: Non colligimus, vendimus, nec communicamus \"informationes personales\" ut definitur in CCPA/CPRA. Non tradimus notitias personalis ad tertios pro pretio. Non utimur nec communicamus \"informationes personales sensibiles\". Quia notitias personales non colligimus, iura solita CCPA/CPRA (accessus, deletio, correctio, aut opt-out venditionis/communicationis) plerumque non applicant. Putasne nos forte notitias personalis accepisse? Contactum cape et iuxta legem agam.</p><h2>4. Optiones tuae et moderatio</h2><p>Modum repositiônis praeferentiarum regere potes:</p><ul><li><strong>Configurationes navigatri:</strong> Crustula et repositiônem localem in tabulis privatis aut securitatis prohibere vel delere. Situs dan thema, ultimam paginam, linguam, aut statum consensus non meminerit.</li><li><strong>Optiones in pagina (si praebentur):</strong> Clavis aut vexillum praeberi potest ut repositiônem foederes. Si recusas, novas praeferentias non servabimus; data antiqua manent donec ea purges.</li></ul><h2>5. Privatas puerorum</h2><p>Situs non est destinatus pueris sub 13 annis (aut maiori aetate ut lex localis statuit) et non consulto colligimus notitias personales puerorum. Non facimus perfiles puerorum nec eos ad aliquem finem adtingimus.</p><h2>6. Tertia servitia</h2><p>Situm ita componimus ut nec analytics nec advertentiae nec tracking tertiorum quae notitias personales colligant adhibeantur. Si aliquando mutemus, hanc Declarationem renovabimus et claram informationem et moderamina praebebimus secundum legem.</p><h2>7. Usoribus internationalibus</h2><p>Situs ubique terrarum accedi potest, sed consilium nostrum est nullas notitias personales cuiusquam colligere. Si lex privatis (ut GDPR aut LGPD) applicatur, collectionem minimis ad praeferentias non personales localiter in tuo navigatro repositas reducimus.</p><h2>8. Mutationes huius Declarationis</h2><p>Hanc Declarationem renovare possumus si mutamus quomodo praeferentias servamus aut si in futurum data personalia tractare incipimus. Tunc diem \"Novissime renovatum\" in summo mutabimus et hanc paginam renovabimus. Si umquam data personalia colligere incipiamus, antea hanc Declarationem renovabimus et, si opus est, consensum petemus.</p><h2>9. Contactus</h2><p>Si quaestiones habes aut putas nos forte data personalia collegisse, contingere potes:</p><p>Email: planefence (at) kx1t (dot) com<br>Adres: PO Box 11, Belmont, MA 02478, USA</p><p>Respondebimus secundum leges privatis applicabiles.</p>"
      }
    },
    "fi-FI": {
      "name": "Suomi",
      "flag": "fi",
      "flag_path": "",
      "strings": {
        "privacy.title": "Tietosuojalauseke",
        "privacy.lastUpdated": "Päivitetty viimeksi: 24. tammikuuta-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"me,\" \"me\" tai \"meidän\") on sitoutunut suojelemaan yksityisyyttäsi. Tämä tietosuojaseloste selittää, miten käsittelemme tietoja, kun käytät sivustoamme.</p><p>Planefence jaellaan ohjelmistopakettina (Docker-kontti) ja sen asentavat, ottavat käyttöön ja/tai käyttävät yksityishenkilöt (\"Operaattorit\"), joilla ei ole yhteyttä tekijään tai SDR-Enthusiasts -organisaatioon. Nämä operaattorit ajavat Planefenceä GNU Public License -lisenssin version 3 ehtojen mukaisesti ja ovat yksin vastuussa ohjelmiston toiminnasta sekä kaikkien sovellettavien lakien ja määräysten noudattamisesta.</p><h2>1. Ei kerättyjä henkilötietoja</h2><p>Suunnittelimme tämän sivuston niin, ettemme kerää, tallenna tai käsittele henkilötietoja EU:n ja Yhdistyneen kuningaskunnan yleisen tietosuoja-asetuksen (GDPR), Kalifornia Consumer Privacy Act and California Privacy Rights Act (CCPA/CPRA) ja Brasilian Lei Geral de Protecao de Dados Pessoais (LGPD) mukaisesti. Huomaa, että pääsypyyntösi voi kulkea muiden verkkopalvelimien kautta ennen kuin se saavuttaa meidät ja että nämä palvelimet voivat käsitellä tietojasi eri tavalla. Meillä ei ole tietoa näistä, ja ne ovat meidän hallinnassa; sinun pitäisi hallita yksityisyyttäsi suoraan näillä palveluilla tarvittaessa.</p><p>Emme kerää, tallenna tai käsittele mitään tietoja, jotka yksilöivät tai voivat olla kohtuullisesti yhteydessä henkilöön (\"henkilötiedot\" tai \"henkilötiedot\"), kuten:</p><ul><li>Nimet, sähköpostiosoitteet, puhelinnumerot tai postiosoitteet</li><li>Käyttäjätilit tai kirjautumistiedot</li><li>Yksityishenkilöihin liittyvät IP-osoitteet</li><li>Online-tunnisteet tai profilointitiedot</li><li>Sijaintitiedot</li><li>Maksu- tai transaktiotiedot</li></ul><p>Emme myöskään käytä analytiikkaa, mainosevästeitä, jäljityspikseleitä tai vastaavia tekniikoita, joiden avulla voisimme tunnistaa tai seurata yksittäisiä käyttäjiä ajan mittaan.</p><p>Koska emme kerää henkilötietoja, me:</p><ul><li>Älä myy, jaa tai luovuta henkilötietoja kolmansille osapuolille</li><li>Älä käytä henkilökohtaisia tietoja mainontaan, profilointiin tai markkinointiin</li><li>Älä tee henkilötietojen perusteella automaattista päätöksentekoa tai profilointia</li></ul><h2>2. Selaimeesi tallennetut tiedot (Paikallinen säilytys / evästeet)</h2><p>Sivusto tallentaa hyvin vähän tietoa vain selaimeesi, vain muistaaksesi mieltymyksesi. Tätä tietoa ei lähetetä palvelimillemme eikä se ole käytettävissämme muodossa, joka tunnistaa sinut.</p><p>Voimme tallentaa selaimeesi (paikallista tallennusta, evästeitä tai vastaavia tekniikoita käyttäen) haluamasi tiedot, mutta emme rajoitu seuraaviin:</p><ul><li>Teemaasetukset: pidätkö tummasta vai valotilasta</li><li>Viimeksi katsottu sivu: kävitpä viimeksi \"planefence\" tai \"plane-alert\" sivulla</li><li>Kielivalinta: valitsemasi kieli sivustolle</li><li>Suostumusrekisteri (jos valittu): Suostuitko, että tallensimme nämä asetukset selaimeesi</li></ul><p>Nämä etuuskohteluarvot:</p><ul><li>Käytetään vain parantamaan kokemusta (esim., muistaa valittu teema, kieli, ja viimeinen sivu)</li><li>Tallennetaan paikallisesti selaimeesi, eikä niitä välitetä meille henkilötietoina</li><li>Älä sisällä nimeäsi, sähköpostia, IP-osoitetta tai muuta henkilökohtaista tunnistetta</li></ul><p>Jos päätät olla sallimatta tätä valintatallennusta, voit silti käyttää sivustoa, mutta voit joutua valitsemaan asetukset uudelleen joka kerta kun käyt.</p><h2>3. Oikeusperusta ja vaatimustenmukaisuus (GDPR, CPA/CPRA, LGPD)</h2><p>GDPR:n ja LGPD:n mukaan emme käsittele henkilötietoja. Selaimeesi tallennetut rajoitetut mieltymystä koskevat tiedot ovat joko tarpeen sivuston perustoimintojen ja käyttökokemuksen tarjoamiseksi (esim. Voit poistaa tämän tallennuksen milloin tahansa selaimesi asetusten kautta tai muuttamalla verkkosivuillamme olevia asetuksia (jos ne on toimitettu).</p><p>Kalifornian asukkaat: Emme kerää, myy tai jaa \"henkilökohtaisia tietoja,\" sellaisina kuin ne on määritelty keskusvastapuolessa/CPRA:ssa. Emme luovuta henkilötietoja kolmansille osapuolille rahallista tai muuta arvokasta vastiketta varten. Emme käytä tai paljasta \"arkaluonteisia henkilötietoja.\" Koska emme kerää henkilökohtaisia tietoja, tyypilliset CPA/CPRA-oikeudet (kuten oikeus saada, poistaa tai korjata henkilötietoja sekä oikeus olla myymättä tai jakamatta) eivät yleensä koske verkkosivustoamme. Jos uskot, että olemme saattaneet kerätä henkilötietoja vahingossa, ota yhteyttä alla oleviin tietoihin ja vastaamme pyyntöösi sovellettavan lain mukaisesti.</p><h2>4. Valinnat ja valvonta</h2><p>Voit hallita sitä, miten selaimeesi tallennetaan etusijatietoja seuraavilla tavoilla:</p><ul><li><strong>Selaimen asetukset:</strong> Voit estää tai poistaa evästeitä ja paikallisia tallennustietoja selaimesi yksityisyys- tai tietoturva-asetusten kautta. Jos teet niin, sivusto ei ehkä enää muista tumma / valo-tila, viimeksi vieraillut sivu, kieli tai suostumus tila.</li><li><strong>Paikan päällä olevat asetukset (jos on):</strong> Voimme tarjota in-page-ohjausta (esim. vaihto tai banner), jonka avulla voit valita tallennusasetukset tai poistaa ne. Jos jätät pois, yritämme lopettaa uusien etutietojen tallentamisen selaimeesi, mutta selaimesi voi silti säilyttää olemassa olevat tiedot, kunnes tyhjennät sen.</li></ul><h2>5. Lasten tietosuoja</h2><p>Sivustomme ei ole suunnattu alle 13-vuotiaille lapsille (tai paikallisessa lainsäädännössä määritellyille vanhemmille), emmekä tietoisesti kerää henkilötietoja lapsilta. Koska emme kerää henkilötietoja lainkaan, emme luo lapsiprofiileja emmekä kohdista niitä mihinkään tarkoitukseen.</p><h2>6. Kolmansien osapuolten palvelut</h2><p>Suunnittelemme sivustomme ei sisälly kolmannen osapuolen analytiikka, mainonta, tai seuranta palveluja, jotka keräävät henkilökohtaisia tietoja. Jos tulevaisuudessa integroimme kolmannen osapuolen sisältöä tai työkaluja, jotka voivat käsitellä henkilötietoja, päivitämme tämän tietosuojaselosteen ja tarjoamme selkeitä tietoja ja valvontaa sovellettavien tietosuojalakien mukaisesti.</p><h2>7. Kansainväliset käyttäjät</h2><p>Sivuillemme pääsee eri maista, mutta käytäntömme on suunniteltu niin, että emme kerää henkilökohtaisia tietoja keneltäkään käyttäjältä sijainnista riippumatta. Siinä määrin kuin yksityisyyden suojaa koskevaa lainsäädäntöä (kuten GDPR tai LGPD) sovelletaan, lähestymistapamme on minimoida tietojen kerääminen vain selaimeesi tallennettuihin muihin kuin henkilökohtaisiin mieltymyksiin.</p><h2>8. Muutokset tähän tietosuojaselosteeseen</h2><p>Voimme päivittää tätä tietosuojaselostetta ajoittain esimerkiksi, jos muutamme asetuksiamme tai jos alamme käsitellä henkilötietoja tulevaisuudessa. Kun teemme muutoksia, päivitämme \"Viimeksi päivitetty\" päivämäärän tämän sivun yläreunaan ja julkaisemme tarkistetun tietosuojaselosteen tällä sivulla. Jos joskus alamme kerätä henkilötietoja, päivitämme tietosuojaselosteen ennen kuin tällainen kerääminen alkaa ja tarvittaessa hankimme suostumuksesi.</p><h2>9. Ota yhteyttä</h2><p>Jos sinulla on kysyttävää tästä tietosuojalausunnosta tai uskot, että olemme vahingossa keränneet henkilötietoja, voit ottaa yhteyttä:</p><p>Sähköposti: planefence (at) kx1t (piste) com<br/>Postiosoite: PO Box 11, Belmont, MA 02478, Yhdysvallat</p><p>Tarkistamme ja vastaamme sovellettavien tietosuojalakien mukaisesti.</p>"
      }
    },
    "sv-SE": {
      "name": "Svenska",
      "flag": "se",
      "flag_path": "",
      "strings": {
        "privacy.title": "Integritetspolicy",
        "privacy.lastUpdated": "Senast uppdaterad: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p><p>Planefence distribueras som ett mjukvarupaket (Docker-container) och installeras, driftsätts och/eller drivs av personer (\"Operatörer\") som inte är knutna till upphovsmannen eller organisationen SDR-Enthusiasts. Dessa operatörer kör Planefence enligt villkoren i GNU Public License, version 3, och har det enda och exklusiva ansvaret för programvarans beteende och för att följa alla tillämpliga lagar och regler.</p><h2>1. No Personal Information Collected</h2><p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p><p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p><ul><li>Names, email addresses, phone numbers, or postal addresses</li><li>User accounts or login details</li><li>IP addresses linked to individuals</li><li>Online identifiers or profiling data</li><li>Location data</li><li>Payment or transaction information</li></ul><p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p><p>Because we do not collect personal information, we:</p><ul><li>Do not sell, share, or disclose personal information to third parties</li><li>Do not use personal information for advertising, profiling, or marketing</li><li>Do not conduct automated decision-making or profiling based on personal data</li></ul><h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2><p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p><p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p><ul><li>Theme preference: whether you prefer dark mode or light mode</li><li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li><li>Language preference: your selected language for the website</li><li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li></ul><p>These preference values:</p><ul><li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li><li>Are stored locally in your browser and are not transmitted to us as personal data</li><li>Do not contain your name, email, IP address, or any other personal identifier</li></ul><p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p><h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2><p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p><p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p><h2>4. Your Choices and Control</h2><p>You can control how preference information is stored in your browser in the following ways:</p><ul><li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li><li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li></ul><h2>5. Children's Privacy</h2><p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p><h2>6. Third-Party Services</h2><p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p><h2>7. International Users</h2><p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p><h2>8. Changes to This Privacy Statement</h2><p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p><h2>9. Contact Us</h2><p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p><p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p><p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "pt-BR": {
      "name": "Português (Brasil)",
      "flag": "br",
      "flag_path": "",
      "strings": {
        "privacy.title": "Declaração de privacidade",
        "privacy.lastUpdated": "Última actualização: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p><p>O Planefence é distribuído como um pacote de software (container Docker) e é instalado, implantado e/ou operado por pessoas (\"Operadores\") sem relação com o(s) autor(es) ou com a organização SDR-Enthusiasts. Esses Operadores executam o Planefence sob os termos da Licença Pública Geral GNU, versão 3, e têm a responsabilidade única e exclusiva pelo comportamento do software e pelo cumprimento das leis e regulamentos aplicáveis.</p><h2>1. No Personal Information Collected</h2><p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p><p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p><ul><li>Names, email addresses, phone numbers, or postal addresses</li><li>User accounts or login details</li><li>IP addresses linked to individuals</li><li>Online identifiers or profiling data</li><li>Location data</li><li>Payment or transaction information</li></ul><p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p><p>Because we do not collect personal information, we:</p><ul><li>Do not sell, share, or disclose personal information to third parties</li><li>Do not use personal information for advertising, profiling, or marketing</li><li>Do not conduct automated decision-making or profiling based on personal data</li></ul><h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2><p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p><p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p><ul><li>Theme preference: whether you prefer dark mode or light mode</li><li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li><li>Language preference: your selected language for the website</li><li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li></ul><p>These preference values:</p><ul><li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li><li>Are stored locally in your browser and are not transmitted to us as personal data</li><li>Do not contain your name, email, IP address, or any other personal identifier</li></ul><p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p><h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2><p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p><p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p><h2>4. Your Choices and Control</h2><p>You can control how preference information is stored in your browser in the following ways:</p><ul><li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li><li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li></ul><h2>5. Children's Privacy</h2><p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p><h2>6. Third-Party Services</h2><p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p><h2>7. International Users</h2><p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p><h2>8. Changes to This Privacy Statement</h2><p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p><h2>9. Contact Us</h2><p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p><p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p><p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "fr-CJ": {
      "name": "Français cadien",
      "flag": "us",
      "flag_path": "",
      "strings": {
        "privacy.title": "Déclaration de confidentialité",
        "privacy.lastUpdated": "Dernière mise à jour : 24-janv-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"nous\") s’engage à protéger votre vie privée. Cette Déclaration de confidentialité explique comment nous traitons les informations lorsque vous utilisez notre site.</p><p>Planefence est distribué comme un paquet de logiciel (conteneur Docker) et il est installé, déployé et/ou exploité par des personnes (« Opérateurs ») sans lien avec l’auteur ou l’organisation SDR-Enthusiasts. Ces Opérateurs font tourner Planefence selon les termes de la GNU Public License, version 3, et portent seuls et exclusivement la responsabilité du comportement du logiciel et du respect des lois et règlements applicables.</p><h2>1. Aucune information personnelle collectée</h2><p>Nous avons conçu ce site pour ne pas collecter, stocker ou traiter d’informations personnelles au sens du RGPD UE/R.-U., du CCPA/CPRA de Californie et de la LGPD du Brésil. Votre demande peut passer par d’autres serveurs avant de nous atteindre; ils peuvent traiter vos données autrement. Nous ne les contrôlons pas; gérez vos exigences de confidentialité directement avec ces services.</p><p>Nous ne collectons, ne stockons ni ne traitons d’informations permettant d’identifier une personne ou pouvant raisonnablement y être liées, telles que :</p><ul><li>Noms, e-mails, numéros de téléphone ou adresses postales</li><li>Comptes utilisateurs ou identifiants de connexion</li><li>Adresses IP liées à des individus</li><li>Identifiants en ligne ou données de profilage</li><li>Données de localisation</li><li>Informations de paiement ou de transaction</li></ul><p>Nous n’utilisons pas non plus d’analytics, de cookies publicitaires, de pixels de suivi ou de technologies similaires pour suivre les utilisateurs dans le temps.</p><p>Parce que nous ne collectons pas d’informations personnelles, nous ne :</p><ul><li>Vendons, ne partageons ou ne divulguons pas d’informations personnelles à des tiers</li><li>N’utilisons pas d’informations personnelles pour la publicité, le profilage ou le marketing</li><li>Ne réalisons pas de décisions automatisées ou de profilage basés sur des données personnelles</li></ul><h2>2. Informations stockées dans votre navigateur (stockage local / cookies)</h2><p>Le site stocke une très petite quantité d’informations uniquement dans votre navigateur, pour mémoriser vos préférences. Ces données ne sont pas envoyées à nos serveurs et ne nous sont pas accessibles comme données personnelles.</p><p>Nous pouvons stocker des préférences dans votre navigateur (stockage local, cookies ou technologies similaires), notamment :</p><ul><li>Préférence de thème : mode sombre ou clair</li><li>Dernière page consultée : \"planefence\" ou \"plane-alert\"</li><li>Préférence de langue : langue sélectionnée pour le site</li><li>Trace de consentement (si choisie) : si vous avez consenti au stockage de ces préférences</li></ul><p>Ces valeurs de préférence :</p><ul><li>Sont utilisées uniquement pour améliorer votre expérience (mémoriser thème, langue, dernière page)</li><li>Sont stockées localement et ne sont pas transmises comme données personnelles</li><li>Ne contiennent ni nom, ni e-mail, ni IP, ni autre identifiant</li></ul><p>Si vous refusez ce stockage, le site fonctionnera toujours, mais vous devrez peut-être ressaisir vos préférences à chaque visite.</p><h2>3. Base légale et conformité (RGPD, CCPA/CPRA, LGPD)</h2><p>Au titre du RGPD et de la LGPD, nous ne traitons pas de données personnelles. Les préférences limitées stockées dans votre navigateur sont nécessaires aux fonctions de base (p. ex. mémoriser la langue) ou sont stockées avec votre consentement. Vous pouvez désactiver ce stockage via votre navigateur ou, si disponible, via les préférences sur le site.</p><p>Pour les résidents de Californie : Nous ne collectons, ne vendons ni ne partageons d’\"informations personnelles\" selon le CCPA/CPRA. Nous ne les divulguons pas à des tiers en échange de valeur. Nous n’utilisons ni ne divulguons d’\"informations personnelles sensibles\". Parce que nous ne collectons pas d’informations personnelles, les droits CCPA/CPRA (accès, suppression, correction, ou opt-out de vente/partage) ne s’appliquent généralement pas. Si vous pensez que nous avons recueilli des informations personnelles par erreur, contactez-nous et nous agirons conformément à la loi.</p><h2>4. Vos choix et contrôles</h2><p>Vous pouvez contrôler comment les préférences sont stockées dans votre navigateur :</p><ul><li><strong>Paramètres du navigateur :</strong> bloquez ou supprimez cookies et stockage local dans les réglages de confidentialité ou de sécurité. Le site pourra alors oublier le thème, la dernière page, la langue ou l’état de consentement.</li><li><strong>Contrôles sur le site (le cas échéant) :</strong> nous pouvons proposer un interrupteur ou une bannière pour accepter ou refuser le stockage des préférences. En cas de refus, nous arrêterons de stocker de nouvelles préférences; les données existantes restent jusqu’à ce que vous les effaciez.</li></ul><h2>5. Confidentialité des enfants</h2><p>Le site ne vise pas les enfants de moins de 13 ans (ou âge supérieur fixé localement) et nous ne collectons pas sciemment d’informations personnelles d’enfants. Nous ne créons pas de profils d’enfants ni ne les ciblons.</p><h2>6. Services tiers</h2><p>Nous concevons le site pour éviter les services tiers d’analytics, de publicité ou de suivi qui collectent des données personnelles. Si cela change, nous mettrons à jour cette Déclaration et fournirons des informations et contrôles clairs selon la loi.</p><h2>7. Utilisateurs internationaux</h2><p>Le site peut être consulté partout; notre pratique est de ne pas collecter de données personnelles, peu importe votre localisation. Si une loi (comme le RGPD ou la LGPD) s’applique, nous réduisons la collecte aux seules données de préférences non personnelles stockées localement.</p><h2>8. Modifications de cette Déclaration</h2><p>Nous pouvons mettre cette Déclaration à jour si nous changeons la façon de stocker les préférences ou si nous commençons à traiter des données personnelles. Nous mettrons alors à jour la date \"Dernière mise à jour\" en haut et publierons la version révisée ici. Si un jour nous collectons des données personnelles, nous le ferons seulement après mise à jour de cette Déclaration et, si requis, avec votre consentement.</p><h2>9. Contact</h2><p>Questions ou pensez-vous que nous avons collecté des données personnelles par erreur ? Contactez-nous :</p><p>Email : planefence (at) kx1t (dot) com<br>Adresse postale : PO Box 11, Belmont, MA 02478, USA</p><p>Nous répondrons conformément aux lois applicables.</p>"
      }
    },
    "pap-CW": {
      "name": "Papiamentu",
      "flag": "cw",
      "flag_path": "",
      "strings": {
        "privacy.title": "Deklarashon di Privasidat",
        "privacy.lastUpdated": "Ultimo aktualisashon: 24-yan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"nos\") ta komprometé pa protehá bo privasidat. E Deklarashon di privasidat aki ta splika kon nos ta maneha informashon ora bo ta usa nos website.</p><p>Planefence ta distribuí komo un pake di software (kontené Docker) i ta instalá, desplegá i/of operá pa hende (\"Operadornan\") ku no tin relashon ku e autor(es) ni ku e organizashon SDR-Enthusiasts. E Operadornan aki ta kore Planefence bou di e términos di GNU Public License, vershon 3, i nan ta tin e úniko i eksklusivo responsablidat pa e komportashon di e software i pa cumplí ku tur lei i regulashon aplikabel.</p><h2>1. Ningun informashon personal ta kolektá</h2><p>Nos a disena e site aki pa no kolektá, warda òf procesa informashon personal segun GDPR di EU/UK, CCPA/CPRA di California, i LGPD di Brasil. Bo petishon por pasa riba otro server promé ku yega na nos; esnan por trata bo dato difarente. Nos no tin kontrol riba esaki; bo mes mester regla bo privasidat ku esnan.</p><p>Nos no ta kolektá, warda òf procesa informashon ku ta identifiká un persona òf por konektá ku dje, manera:</p><ul><li>Nòmber, email, telefòn òf adrès postal</li><li>Kuenta di usuario òf dato di login</li><li>Adres IP konektá ku persona</li><li>Identifikadó online òf dato di perfil</li><li>Dato di lokashon</li><li>Informashon di pago òf transakshon</li></ul><p>Tampoko nos ta usa analytics, cookies di anunsio, tracking pixels òf téknika similar pa sigui usuario den tempu.</p><p>Paso nos no ta kolektá informashon personal, nos no ta:</p><ul><li>Vende, kompartí òf publiká informashon personal ku partido di tres</li><li>Usa informashon personal pa anunsio, profiling òf marketing</li><li>Hasi desishon automátiko òf profiling basá riba dato personal</li></ul><h2>2. Informashon warda den bo browser (local storage / cookies)</h2><p>E website ta warda un tiki informashon solamente den bo browser, solamente pa rekordá bo preferensia. E informashon aki no ta bai na nos server i nos no por mira dje manera dato personal.</p><p>Nos por warda dato di preferensia den bo browser (local storage, cookies òf téknika similar), inkluí pero no limitá na:</p><ul><li>Preferensia di tema: modo skur òf kla</li><li>Ultimo pagina wak: \"planefence\" òf \"plane-alert\"</li><li>Preferensia di idioma: e idioma selektá di e site</li><li>Rekòrd di konsento (si bo a skohe): si bo a duna nos konsento pa warda e preferensianan</li></ul><p>E preferensianan aki:</p><ul><li>Ta usa solamente pa mehorá bo eksperensia (rekordá tema, idioma, ultimo pagina)</li><li>Ta warda lokalmente den bo browser i no ta manda na nos manera dato personal</li><li>No tin bo nòmber, email, IP òf otro identifikadó personal</li></ul><p>Si bo no ta permití e opshon di warda, e site lo keda traha, pero bo lo mester skohe preferensianan kada biaha.</p><h2>3. Base legal i kumplimentu (GDPR, CCPA/CPRA, LGPD)</h2><p>Bou di GDPR i LGPD nos no ta procesa dato personal. E tiki preferensia den bo browser ta of nesesario pa funshon basiko (p.e. rekordá idioma) of ta warda ku bo konsento. Bo por deskonektá e warda via settings di browser òf via preferensia na e site (si e ta disponibel).</p><p>Pa residente di California: Nos no ta kolektá, bende òf kompartí \"informashon personal\" segun CCPA/CPRA. Nos no ta duna informashon personal na partido di tres pa sèn òf otro balor. Nos no ta usa òf duna \"informashon personal sensitivo\". Paso nos no ta kolektá informashon personal, e derechonan di CCPA/CPRA (akses, eliminashon, korrekshon, òf opt-out di benta/kompartí) generalment no ta apliká. Si bo ta kere ku nos a risibí informashon personal pa aksidente, tuma kontakto ku nos; nos lo aktua segun e lei.</p><h2>4. Bo eskoho i kontrol</h2><p>Bo por kontrolá kon preferensianan ta warda den bo browser:</p><ul><li><strong>Browser settings:</strong> Blokia òf kita cookies i local storage den privacy/security settings. E site por no rekorda tema, ultimo pagina, idioma òf estado di konsento.</li><li><strong>Kontrol na e site (si tin):</strong> Nos por ofrece un switch òf banner pa bo opt-in/out pa warda preferensianan. Si bo skeiru, nos lo intenta no warda preferensia nobo; dato bieuw ta keda te ora bo elimina nan.</li></ul><h2>5. Privasidat di mucha</h2><p>E site no ta dirigi na mucha bou di 13 aña (òf mas haltu segun lei lokal), i nos no ta sa kolektá informashon personal di mucha. Nos no ta krea perfíl di mucha ni ta target nan.</p><h2>6. Serbisionan di tercero</h2><p>Nos ta disena e site pa no inkluí analytics, publisidat òf tracking di tercero ku por kolektá dato personal. Si den futuro nos integra kontenido òf tool di tercero ku por procesa dato personal, nos lo aktialisá e Deklarashon aki i duna informashon klaro i kontrolnan segun lei.</p><h2>7. Usuaronan internashonal</h2><p>E site por wordu akedé for di diferente pais, pero nos prátika ta no kolektá informashon personal di niun usuario, indi bo ta. Si un lei di privasidat (manera GDPR òf LGPD) ta apliká, nos ta minimisa kolekshon na preferensia no-personal warda lokalmente den bo browser.</p><h2>8. Kambionan na e Deklarashon</h2><p>Nos por aktualisá e Deklarashon ora nos kambia kon nos ta warda preferensia òf si nos kuminsa procesa dato personal. Ora nos kambia, nos ta kambia e fecha di \"Ultimo aktualisashon\" ariba i ta pone e version nobo aki. Si un dia nos kuminsa kolektá informashon personal, nos lo hasi esaki despues di aktualisashon i, si mester, ku bo konsento.</p><h2>9. Kontakto</h2><p>Si bo tin pregunta òf bo ta kere ku nos a kolektá informashon personal pa aksidente, por tuma kontakto:</p><p>Email: planefence (at) kx1t (dot) com<br>Adrès postal: PO Box 11, Belmont, MA 02478, USA</p><p>Nos lo reeinda segun e lei di privasidat ku ta apliká.</p>"
      }
    },
    "jam-JM": {
      "name": "Patwa (Jamaica)",
      "flag": "jm",
      "flag_path": "",
      "strings": {
        "privacy.title": "Praisiv Staetment",
        "privacy.lastUpdated": "Las updiet: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"wi\") committed fi protek yu privacy. Dis Praisiv Staetment explain how wi hanl info wen yu use wi website.</p><p>Planefence distribute as one software package (Docker container) an people (\"Operators\") weh nuh link to di author or di SDR-Enthusiasts group install, deploy, an/or run it. Dem Operators run Planefence under di GNU Public License, version 3, an dem alone responsible fi how di software behave an fi follow any law or regulation weh apply.</p><h2>1. Wi naw collect personal info</h2><p>Wi build dis site so wi naw collect, store, or process personal info under EU/UK GDPR, California CCPA/CPRA, an Brazil LGPD. Yu request might pass tru odda server dem before it reach wi; dem server might deal wid yu data different. Wi nuh control dem; deal wid yu privacy need wid dem service direct.</p><p>Wi naw collect, store, or process any info weh identify or link back to somebody (\"personal information\" or \"personal data\"), like:</p><ul><li>Name, email, phone, or mailing address</li><li>User account or login detail</li><li>IP address tie to people</li><li>Online ID or profiling data</li><li>Location data</li><li>Payment or transaction info</li></ul><p>Wi also naw use analytics, ads cookies, tracking pixel, or any similar tech fi follow users over time.</p><p>Cause wi naw collect personal info, wi naw:</p><ul><li>Sell, share, or disclose personal info to third party</li><li>Use personal info fi ads, profiling, or marketing</li><li>Do automated decision-making or profiling based pon personal data</li></ul><h2>2. Info store inna yu browser (local storage / cookies)</h2><p>Di website store likkle info inna yu browser only fi memba yu preference. Dis info naw send to wi server an wi cyaa reach it as personal data.</p><p>Wi might store preference data inna yu browser (local storage, cookies, or similar tech), including:</p><ul><li>Theme choice: dark or light mode</li><li>Las page yu view: \"planefence\" or \"plane-alert\"</li><li>Language choice: weh language yu pick fi di site</li><li>Consent record (if yu opt in): whether yu gimme consent fi store dese preference</li></ul><p>Dese preference value dem:</p><ul><li>Use only fi mek yu experience better (memba yu theme, language, las page)</li><li>Store local inna yu browser; naw send to wi as personal data</li><li>Naw contain yu name, email, IP, or any oda personal ID</li></ul><p>If yu choose fi block dis storage, di site still wuk, but yu might haffi choose preference every visit.</p><h2>3. Legal basis an compliance (GDPR, CCPA/CPRA, LGPD)</h2><p>Under GDPR an LGPD, wi naw process personal data. Di likkle preference data inna yu browser a either needed fi basic function (like keep yu language) or store wid yu consent. Yu can disable it tru yu browser setting or any on-site preference (if available).</p><p>Fi California resident: Wi naw collect, sell, or share \"personal information\" under CCPA/CPRA. Wi naw hand it to third party fi money or value. Wi naw use or share \"sensitive personal information\". Since wi naw collect personal info, di regular CCPA/CPRA rights (access, delete, correct, or opt-out of sell/share) mostly nuh apply. If yu tink wi might a collect personal info by mistake, link wi an wi deal wid it by law.</p><h2>4. Yu choices an control</h2><p>Yu can control how preference store in yu browser:</p><ul><li><strong>Browser setting:</strong> Block or delete cookies/local storage in privacy or security setting. If yu do dat, di site might nuh memba theme, las page, language, or consent status.</li><li><strong>On-site control (if present):</strong> Wi might show toggle or banner fi opt in/out. If yu opt out, wi stop store new preference; yu browser might keep old data til yu clear it.</li></ul><h2>5. Pickney privacy</h2><p>Wi site nuh target pickney under 13 (or higher age if law seh so), an wi naw knowingly collect pickney personal info. Since wi naw collect personal info, wi naw build pickney profile or target dem.</p><h2>6. Third-party service</h2><p>Wi design di site fi avoid third-party analytics, ads, or tracking weh collect personal info. If wi ever add third-party content or tool weh could process personal info, wi update dis statement an give clear info an control as di law require.</p><h2>7. International users</h2><p>People can access di site from anywhere, but wi practice still fi naw collect personal info. If any privacy law (like GDPR or LGPD) apply, wi minimize collection to non-personal preference data store local in yu browser.</p><h2>8. Change to dis statement</h2><p>Wi might update dis statement if wi change how wi store preference or if wi start process personal info. Wi update di \"Las updiet\" date at top an post di new version ya. If wi ever start collect personal info, wi update dis statement first an, if required, get yu consent.</p><h2>9. Contact wi</h2><p>If yu have question or tink wi collect personal info by mistake, reach out:</p><p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p><p>Wi respond according to privacy law.</p>"
      }
    },
    "uk-UA": {
      "name": "Українська",
      "flag": "ua",
      "flag_path": "",
      "strings": {
        "privacy.title": "Заява про конфіденційність",
        "privacy.lastUpdated": "Останнє оновлення: 24-Джан-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p><p>Planefence поширюється як програмний пакет (контейнер Docker) і встановлюється, розгортається та/або експлуатується особами («Операторами»), які не пов’язані з автором чи організацією SDR-Enthusiasts. Ці Оператори запускають Planefence за умовами GNU Public License версії 3 і несуть повну та виключну відповідальність за роботу програмного забезпечення та дотримання всіх чинних законів і нормативних актів.</p><h2>1. No Personal Information Collected</h2><p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p><p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p><ul><li>Names, email addresses, phone numbers, or postal addresses</li><li>User accounts or login details</li><li>IP addresses linked to individuals</li><li>Online identifiers or profiling data</li><li>Location data</li><li>Payment or transaction information</li></ul><p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p><p>Because we do not collect personal information, we:</p><ul><li>Do not sell, share, or disclose personal information to third parties</li><li>Do not use personal information for advertising, profiling, or marketing</li><li>Do not conduct automated decision-making or profiling based on personal data</li></ul><h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2><p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p><p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p><ul><li>Theme preference: whether you prefer dark mode or light mode</li><li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li><li>Language preference: your selected language for the website</li><li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li></ul><p>These preference values:</p><ul><li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li><li>Are stored locally in your browser and are not transmitted to us as personal data</li><li>Do not contain your name, email, IP address, or any other personal identifier</li></ul><p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p><h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2><p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p><p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p><h2>4. Your Choices and Control</h2><p>You can control how preference information is stored in your browser in the following ways:</p><ul><li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li><li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li></ul><h2>5. Children's Privacy</h2><p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p><h2>6. Third-Party Services</h2><p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p><h2>7. International Users</h2><p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p><h2>8. Changes to This Privacy Statement</h2><p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p><h2>9. Contact Us</h2><p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p><p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p><p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "tlh-QA": {
      "name": "Klingon (tlhIngan Hol)",
      "flag": "tlh",
      "flag_path": "./assets/flags/Klingon.gif",
      "strings": {
        "privacy.title": "pegh mu'mey",
        "privacy.lastUpdated": "poH chu'qu'lu'bogh: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"maH\") peghlIj wIcherqang 'ej wIHoS. mu'meyvamDaq juHwIj Dalo'DI' De' chutmeymaj 'e' wIja'.</p><p>Planefence Docker container rurbogh software 'oH; SDR-Enthusiasts ghunwI'vaD pImbogh nuvpu' (\"Operators\") 'oH luchen, luyong, luyongqa'. GPL version 3 chutmey bop 'ej Qaplaw' 'e' luqel nuvpu'vam neH; De' Qap chut je luqImnIS Hoch.</p><h2>1. De' pegh wIboqbe'</h2><p>EU/UK GDPR, California CCPA/CPRA, Brazil LGPD qelmeH wI'oghta' net Sov: De' pegh wInobbe', wIpolbe', wInunbe'. poHmajDaq lojmItmey latlh web servermeyvo' may'laH requestlIj; De'lIj 'e' lIghajchu'chu'be'. maHvaD pIm; lajQo'mo' maH, ghomvamvaD peghlIj DamIS.</p><p>\"personal information\" / \"personal data\" rurbogh De' vay' (nuv wa' 'e' Dellu' pagh rarlaHbogh) wI'ochbe':</p><ul><li>pong, email, De' wab, nav rar</li><li>lo'wI' accountmey, login De'</li><li>nuvvaD rarbogh IP mI'</li><li>online SovmoHmeH De' / profiling De'</li><li>Sep De' (location)</li><li>Huch HInobmeH De' / muq De'</li></ul><p>analytics, ad cookies, tracking pixels, latlh pabmey je wIlo'be'; poH nI' qaSDI', lo'wI' wa' wIwIvbe'.</p><p>De' pegh wIboqbe'mo', wImISbe' je:</p><ul><li>De' pegh wIngev, wIchup, wIghItlhbe' latlhvaD</li><li>ads, profiling, marketing mIwvaD De' pegh wIlo'be'</li><li>De' peghvo' maH neH wuq mIw tIwbe', maw'Ha'be'</li></ul><h2>2. browserlIjDaq polbogh De' (local storage / cookies)</h2><p>websiteDaq De'Hom neH browserlIjDaq wIpollaH; ngoDmeylIj qawmeH neH. meQ De'vam maHvaD ngeHbe', maHvaD De' pegh rurbe'.</p><p>browserlIjDaq qawmeH De' wIpollaH (local storage, cookies, latlh pab), chImbe':</p><ul><li>theme DuH: Hurgh ghap wov</li><li>poH Qav DalaDbogh: \"planefence\" pagh \"plane-alert\"</li><li>Hol DaWIvbogh: juHwIjvaD Holvetlh Dalo'</li><li>Consent De' (DaQapchugh): De'vam browserlIjDaq maPol 'e' Datob'a'?</li></ul><p>De'vam:</p><ul><li>mIw yIqaqmeH neH: theme, Hol, poH Qav Daqaw</li><li>browserlIjDaq neH pollu', maHvaD De' pegh rurbe'</li><li>ponglIj, emaillIj, IP mI'lIj, latlh De' pegh tu'lu'be'</li></ul><p>polHa' DaneHchugh, juHwIj Qapbej, 'ach reH DuHmeylIj DacheghnIS.</p><h2>3. QulwI' pat & chut qIm (GDPR, CCPA/CPRA, LGPD)</h2><p>GDPR, LGPD qelchugh De' pegh wInunbe'. browserlIjDaq pollu'bogh De' qaw DuH 'oH motlh; pagh bIHmeH laj Datobpu'. settingslIjDaq pagh on-site DuHmeyDaq (Suqchugh) DatobHa'laH.</p><p>California nuvpu': CCPA/CPRA qelchugh \"personal information\" wIboqbe', wIngevbe'. HuchvaD je maSo'be'. \"sensitive personal information\" wIlo'be'. vaj CCPA/CPRA wuqDu' motlh (legh, polHa', choH, sell/share yImev) naDev motlhHa'. maHvaD nIDpu' 'e' DaHarchugh, De' yInob; chut qImmeH maQap.</p><h2>4. yISeH De' qawlu'bogh</h2><p>browserlIjDaq chay' De' qawlu' 'e' DaSeHlaH:</p><ul><li><strong>browser settings:</strong> cookies, local storage DatobHa' pagh DapolHa' privacy/secu settingsDaq; vaj theme, poH Qav, Hol, consent je Qawlu'be'.</li><li><strong>on-site DuH (Suqchugh):</strong> toggle/banner ma'anglaH qap-in/qap-out; bIcheghchugh, De' chu' pol wImev, 'ach browserlIjDaq De' tIQ poltaH may'.</li></ul><h2>5. puqpu' pegh</h2><p>13 DIS (pagh nIvbogh poH) puqpu' wI'angbe', 'ej puq De' pegh wIboqbe' maSov. puqpu' wIwIvbe', wIpIHbe'.</p><h2>6. latlh patmey</h2><p>websiteDaq analytics/ads/tracking latlh patmey wIchelbe'. wa'leS patmeyvam wIchelchugh, mu'meyvam wIchoH 'ej chut qImmeH De' wInobchu'.</p><h2>7. qo' HochDaq lo'wI'</h2><p>Sepmey law'vo' naDev DalaH, 'ach qapchu' maSov: lo'wI'vo' De' pegh wInobbe'. chut (GDPR, LGPD) qelchugh, browserlIjDaq polbogh De' qaw neH wInoH.</p><h2>8. mu'meyvam choH</h2><p>qaw mIw wIchoHchugh, pagh wa'leS De' pegh wInunchoHchugh, mu'meyvam wIchuqqa'. \"poH chu'qu'lu'bogh\" De' wIchoH je, naDev wIlab. De' pegh boqnISchugh, maH choHta' maq before; poQlu'chugh laj wItlhap.</p><h2>9. maHvaD yIghItlh</h2><p>mu'meyvam DaqIj DaneHchugh, pagh De' pegh wIboqta' 'e' DaHarchugh, naDev yIlo':</p><p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p><p>chutmey pegh lughmoHmeH majang.</p>"
      }
    },
    "en-PI": {
      "name": "Pig Latin",
      "flag": "us",
      "flag_path": "",
      "strings": {
        "privacy.title": "Pig Lating Privacy Proclamation",
        "privacy.lastUpdated": "Last hoisted: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Arrr, Planefence (\"we\") be guardin’ yer privacy. This here Proclamation tells how we handle yer info when ye sail our site.</p><p>Planefence is distributed as a software package (Docker container) and is installed, deployed, and/or operated by individuals (\"Operators\") unrelated to the author(s) or the SDR-Enthusiasts organization. These Operators run Planefence under the terms of the GNU Public License, version 3, and they have the sole and exclusive responsibility for the behavior of the software and for compliance with any applicable laws and regulations.</p><h2>1. No booty o’ personal info taken</h2><p>We rigged this site so we don’t collect, stash, or handle personal treasure under EU/UK GDPR, California CCPA/CPRA, or Brazil LGPD. Yer request may pass other ships afore it reaches us; they may treat yer data different. We don’t command ’em; mind yer privacy with those crews.</p><p>We don’t collect, stash, or handle any info that pegs a matey or could link to one, like:</p><ul><li>Names, emails, phone numbers, or postal ports</li><li>User accounts or login keys</li><li>IP addresses tied to souls</li><li>Online marks or profiling cargo</li><li>Location bearings</li><li>Payment or trade tallies</li></ul><p>We also shun analytics, ad cookies, tracking pixels, or any spyglass tech to tail ye over time.</p><p>Since we take no personal bounty, we shan’t:</p><ul><li>Sell, share, or blab personal info to third parties</li><li>Use personal info for ads, profiling, or marketing</li><li>Run automated judgments or profiling from personal data</li></ul><h2>2. Info stowed in yer browser (local storage / cookies)</h2><p>This site stows a wee bit o’ info in yer browser, just to remember yer choices. It ne’er leaves fer our servers nor reaches us as personal data.</p><p>We may stow in yer browser (local storage, cookies, or the like):</p><ul><li>Theme fancy: dark or light</li><li>Last viewed page: \"planefence\" or \"plane-alert\"</li><li>Tongue o’ the site ye picked</li><li>Consent log (if ye opt in): whether ye let us stow these choices</li></ul><p>These bits o’ preference:</p><ul><li>Only better yer voyage (remember theme, tongue, last page)</li><li>Stay local in yer browser, ne’er sent to us as personal loot</li><li>Hold no name, email, IP, nor other mark o’ ye</li></ul><p>Refuse this stowage and the site still sails, but ye may re-pick choices each visit.</p><h2>3. Legal keel (GDPR, CCPA/CPRA, LGPD)</h2><p>Under GDPR and LGPD we don’t process personal cargo. The scant preference bits in yer browser be needed for basic riggin’ (like keepin’ yer tongue) or stowed with yer consent. Ye can disable stowage via yer browser or any on-site levers (if offered).</p><p>California mates: We don’t collect, sell, or share \"personal information\" under CCPA/CPRA. We don’t hand it to third ships for coin or favor. We don’t use or share \"sensitive personal information.\" Since we collect none, the usual CCPA/CPRA rights (access, delete, correct, or opt-out o’ sell/share) mostly don’t apply. Think we snared personal info in error? Send word and we’ll handle by law.</p><h2>4. Yer choices and helm</h2><p>Ye can steer how preferences stow:</p><ul><li><strong>Browser rig:</strong> Block or clear cookies/local storage in privacy or security settings. Then the site may forget theme, last page, tongue, or consent flag.</li><li><strong>On-site levers (if any):</strong> We may show a toggle/banner to opt in/out. Opt out, and we’ll stop stowin’ new bits; old ones stay till ye clear ’em.</li></ul><h2>5. Little buccaneers</h2><p>This site ain’t aimed at sprogs under 13 (or higher by local law), and we don’t knowingly net their personal loot. Since we collect none, we don’t profile nor target the young’uns.</p><h2>6. Third-party ships</h2><p>We rig the site to avoid third-party analytics, ads, or trackers that haul personal cargo. If ever we add such cargo, we’ll update this Proclamation and give clear charts and controls per law.</p><h2>7. Mates from any port</h2><p>Ye can board from any shore, but our practice is to take no personal loot. Where privacy law (like GDPR or LGPD) holds sway, we trim collection to non-personal preferences stowed local in yer browser.</p><h2>8. Changes to this Proclamation</h2><p>We may update this doc if we change how we stow preferences or if we start haulin’ personal cargo. We’ll refresh the \"Last hoisted\" date atop and post the new chart here. If ever we collect personal info, we’ll update first and, if needed, get yer say-so.</p><h2>9. Hail us</h2><p>Questions or think we nabbed personal info by mistake? Holler at:</p><p>Email: planefence (at) kx1t (dot) com<br>Post: PO Box 11, Belmont, MA 02478, USA</p><p>We’ll answer accordin’ to the law o’ privacy.</p>"
      }
    },
    "en-PT": {
      "name": "Pirate",
      "flag": "pirate",
      "flag_path": "./assets/flags/Jolly_Roger.png",
      "strings": {
        "privacy.title": "Pirate Privacy Proclamation",
        "privacy.lastUpdated": "Last updated: 24-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p><p>Planefence (\"we\") is committed to keeping your privacy safe. This Privacy Notice explains how we handle information when you use our site.</p><p>Planefence is distributed as a software package (Docker container) and is installed, deployed, and/or operated by individuals (\"Operators\") unrelated to the author(s) or the SDR-Enthusiasts organization. These Operators run Planefence under the terms of the GNU Public License, version 3, and they have the sole and exclusive responsibility for the behavior of the software and for compliance with any applicable laws and regulations.</p><h2>1. We do not collect personal information</h2><p>We built this site so we do not collect, store, or process personal information under the EU/UK GDPR, California CCPA/CPRA, or Brazil LGPD. Your request may pass other servers before it reaches us; they may treat your data differently. We do not control them; handle your privacy needs with those services directly.</p><p>We do not collect, store, or process any information that identifies a person or can be linked to one, such as:</p><ul><li>Names, emails, phone numbers, or mailing addresses</li><li>User accounts or login details</li><li>IP addresses linked to people</li><li>Online identifiers or profiling data</li><li>Location data</li><li>Payment or transaction information</li></ul><p>We also do not use analytics, ad cookies, tracking pixels, or similar tech to follow users over time.</p><p>Because we do not collect personal information, we do not:</p><ul><li>Sell, share, or disclose personal information to third parties</li><li>Use personal information for ads, profiling, or marketing</li><li>Run automated decisions or profiling based on personal data</li></ul><h2>2. Information kept in your browser (local storage / cookies)</h2><p>The site keeps a tiny amount of information only in your browser, just to remember your preferences. It is not sent to our servers and is not reachable by us as personal data.</p><p>We may keep preference data in your browser (local storage, cookies, or similar), including:</p><ul><li>Theme preference: dark or light mode</li><li>Last viewed page: \"planefence\" or \"plane-alert\"</li><li>Language preference: the language you chose for the site</li><li>Consent record (if you opted in): whether you agreed to store these preferences</li></ul><p>These preferences:</p><ul><li>Are used only to improve your experience (remember theme, language, last page)</li><li>Stay local in your browser and are not sent to us as personal data</li><li>Do not contain your name, email, IP, or any other identifier</li></ul><p>If you block this storage, the site still works, but you may need to choose preferences each visit.</p><h2>3. Legal basis and compliance (GDPR, CCPA/CPRA, LGPD)</h2><p>Under GDPR and LGPD, we do not process personal data. The limited preference data in your browser is either needed for basic functions (like keeping your language choice) or stored with your consent. You can disable it via your browser settings or on-site preferences (if offered).</p><p>For California residents: We do not collect, sell, or share \"personal information\" under CCPA/CPRA. We do not hand it to third parties for money or value. We do not use or share \"sensitive personal information.\" Since we do not collect personal information, the usual CCPA/CPRA rights (access, delete, correct, or opt-out of selling/sharing) usually do not apply. Think we got personal information by mistake? Contact us and we will handle it under the law.</p><h2>4. Your choices and control</h2><p>You can control how preferences are stored in your browser:</p><ul><li><strong>Browser settings:</strong> Block or delete cookies/local storage in privacy or security settings. The site may then forget theme, last page, language, or consent status.</li><li><strong>On-site controls (if provided):</strong> We may show a toggle or banner to let you opt in/out. If you opt out, we will stop storing new preferences; your browser may keep old data until you clear it.</li></ul><h2>5. Children’s privacy</h2><p>The site is not aimed at children under 13 (or higher if local law says so), and we do not knowingly collect personal information from children. Since we do not collect personal information, we do not profile or target children.</p><h2>6. Third-party services</h2><p>We design the site to avoid third-party analytics, ads, or trackers that collect personal information. If we ever add third-party content or tools that could process personal information, we will update this Notice and provide clear information and controls consistent with the law.</p><h2>7. International users</h2><p>The site can be accessed worldwide, but our practice is not to collect personal information from any user, wherever they are. If a privacy law (like GDPR or LGPD) applies, we minimize collection to non-personal preference data stored locally in your browser only.</p><h2>8. Changes to this Notice</h2><p>We may update this Notice if we change how we store preferences or if we start processing personal information. When we do, we will update the \"Last updated\" date at the top and post the new version here. If we ever begin collecting personal information, we will update this Notice first and, where needed, get your consent.</p><h2>9. Contact us</h2><p>If you have questions or believe we collected personal information by mistake, contact us at:</p><p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p><p>We will respond under applicable privacy laws.</p>"
      }
    }
  }
}