{
  "defaultLanguage": "en-US",
  "fallbackLanguage": "en-US",
  "languages": {
    "en-US": {
      "name": "English (US)",
      "flag": "us",
      "flag_path": "",
      "strings": {
        "privacy.title": "Privacy Statement",
        "privacy.lastUpdated": "Last updated: 18-Jan-2026",
        "privacy.fullText": "<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence@kx1t.com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "es-ES": {
      "name": "Español",
      "flag": "es",
      "flag_path": "",
      "strings": {
        "privacy.title": "Declaración de Privacidad",
        "privacy.lastUpdated": "Última actualización: 18-ene-2026",
        "privacy.fullText": "<p>Planefence (\"nosotros\") se compromete a proteger su privacidad. Esta Declaración de Privacidad explica cómo tratamos la información cuando usa nuestro sitio web.</p>\n<h2>1. No se recopila información personal</h2>\n<p>Hemos diseñado este sitio para no recopilar, almacenar ni procesar información personal según el RGPD de la UE/Reino Unido, la CCPA/CPRA de California y la LGPD de Brasil. Su solicitud puede pasar por otros servidores antes de llegar a nosotros; estos pueden tratar sus datos de forma diferente. No los controlamos; gestione sus requisitos de privacidad directamente con esos servicios si es necesario.</p>\n<p>No recopilamos, almacenamos ni procesamos información que identifique o pueda vincularse razonablemente con una persona (\"información personal\" o \"datos personales\"), como:</p>\n<ul>\n<li>Nombres, correos electrónicos, teléfonos o direcciones postales</li>\n<li>Cuentas de usuario o credenciales de inicio de sesión</li>\n<li>Direcciones IP vinculadas a individuos</li>\n<li>Identificadores en línea o datos de perfilado</li>\n<li>Datos de ubicación</li>\n<li>Información de pago o transacción</li>\n</ul>\n<p>Tampoco usamos analíticas, cookies publicitarias, píxeles de seguimiento ni tecnologías similares que permitan identificarnos o rastrear usuarios en el tiempo.</p>\n<p>Como no recopilamos información personal:</p>\n<ul>\n<li>No vendemos, compartimos ni divulgamos información personal a terceros</li>\n<li>No usamos información personal para publicidad, perfilado o marketing</li>\n<li>No realizamos decisiones automatizadas ni perfilado basados en datos personales</li>\n</ul>\n<h2>2. Información almacenada en su navegador (almacenamiento local / cookies)</h2>\n<p>El sitio guarda una cantidad mínima de información solo en su navegador para recordar sus preferencias. Esta información no se envía a nuestros servidores ni es accesible de forma que le identifique.</p>\n<p>Podemos guardar datos de preferencia en su navegador (almacenamiento local, cookies o tecnologías similares), entre ellos:</p>\n<ul>\n<li>Preferencia de tema: modo oscuro o claro</li>\n<li>Última página vista: \"planefence\" o \"plane-alert\"</li>\n<li>Preferencia de idioma: idioma seleccionado del sitio</li>\n<li>Registro de consentimiento (si opta por él): si consintió que guardemos estas preferencias</li>\n</ul>\n<p>Estas preferencias:</p>\n<ul>\n<li>Se usan solo para mejorar su experiencia (p. ej., recordar tema, idioma y última página)</li>\n<li>Se almacenan localmente en su navegador y no se transmiten a nosotros como datos personales</li>\n<li>No contienen su nombre, correo, IP ni ningún otro identificador personal</li>\n</ul>\n<p>Si no permite este almacenamiento, puede usar el sitio igualmente, pero quizá deba elegir sus preferencias en cada visita.</p>\n<h2>3. Base legal y cumplimiento (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Según el GDPR y la LGPD, no procesamos datos personales. La información limitada de preferencias en su navegador es necesaria para la funcionalidad básica (p. ej., mantener su idioma) o se guarda con su consentimiento cuando corresponde. Puede desactivar este almacenamiento en la configuración de su navegador o mediante las preferencias del sitio (si se ofrecen).</p>\n<p>Para residentes de California: No recopilamos, vendemos ni compartimos \"información personal\" según la CCPA/CPRA. No la divulgamos a terceros por contraprestación monetaria u otro valor. No usamos ni divulgamos \"información personal sensible\". Como no recopilamos información personal, los derechos típicos de la CCPA/CPRA (acceso, eliminación, corrección u optar por no vender/compartir) generalmente no aplican. Si cree que pudimos recopilar información personal por error, contáctenos y atenderemos su solicitud conforme a la ley.</p>\n<h2>4. Sus opciones y control</h2>\n<p>Puede controlar cómo se guardan las preferencias en su navegador:</p>\n<ul>\n<li><strong>Configuración del navegador:</strong> puede bloquear o borrar cookies y almacenamiento local en los ajustes de privacidad o seguridad. Si lo hace, el sitio puede dejar de recordar tema, última página, idioma o estado de consentimiento.</li>\n<li><strong>Controles en el sitio (si existen):</strong> podemos ofrecer un control en la página (conmutador o banner) para permitir o rechazar el almacenamiento de preferencias. Si opta por no guardarlas, intentaremos dejar de almacenar nuevos datos; su navegador puede conservar los existentes hasta que los borre.</li>\n</ul>\n<h2>5. Privacidad infantil</h2>\n<p>El sitio no está dirigido a menores de 13 años (o edad superior según la ley local), ni recopilamos conscientemente información personal de menores. Como no recopilamos información personal, no creamos perfiles de menores ni los dirigimos para ningún fin.</p>\n<h2>6. Servicios de terceros</h2>\n<p>Diseñamos el sitio para no incorporar analíticas, publicidad o rastreadores de terceros que recopilen información personal. Si en el futuro integramos contenido o herramientas de terceros que puedan procesar información personal, actualizaremos esta Declaración y ofreceremos información y controles claros conforme a la ley.</p>\n<h2>7. Usuarios internacionales</h2>\n<p>El sitio puede accederse desde distintos países, pero nuestras prácticas están diseñadas para no recopilar información personal de ningún usuario, sin importar su ubicación. Si aplica alguna ley de privacidad (como GDPR o LGPD), nuestra postura es minimizar la recopilación a datos de preferencias no personales almacenados localmente en su navegador.</p>\n<h2>8. Cambios en esta Declaración</h2>\n<p>Podemos actualizar esta Declaración cuando cambiemos cómo almacenamos preferencias o si empezamos a procesar información personal. Al hacerlo, actualizaremos la fecha de \"Última actualización\" y publicaremos la versión revisada aquí. Si alguna vez comenzamos a recopilar información personal, actualizaremos esta Declaración antes de hacerlo y, cuando se requiera, obtendremos su consentimiento.</p>\n<h2>9. Contacto</h2>\n<p>Si tiene preguntas sobre esta Declaración o cree que pudimos recopilar información personal por error, puede contactarnos en:</p>\n<p>Correo: planefence@kx1t.com<br>Dirección postal: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Revisaremos y responderemos conforme a las leyes de privacidad aplicables.</p>"
      }
    }
  }
}
