{
  "defaultLanguage": "en-US",
  "fallbackLanguage": "en-US",
  "languages": {
    "en-US": {
      "name": "English (US)",
      "flag": "us",
      "flag_path": "",
      "strings": {
        "privacy.title": "Privacy Statement",
        "privacy.lastUpdated": "Last updated: 18-Jan-2026",
        "privacy.fullText": "<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "es-ES": {
      "name": "Español",
      "flag": "es",
      "flag_path": "",
      "strings": {
        "privacy.title": "Declaración de privacidad",
        "privacy.lastUpdated": "Última actualización: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"nosotros\") se compromete a proteger su privacidad. Esta Declaración de Privacidad explica cómo tratamos la información cuando usa nuestro sitio web.</p>\n<h2>1. No se recopila información personal</h2>\n<p>Hemos diseñado este sitio para no recopilar, almacenar ni procesar información personal según el RGPD de la UE/Reino Unido, la CCPA/CPRA de California y la LGPD de Brasil. Su solicitud puede pasar por otros servidores antes de llegar a nosotros; estos pueden tratar sus datos de forma diferente. No los controlamos; gestione sus requisitos de privacidad directamente con esos servicios si es necesario.</p>\n<p>No recopilamos, almacenamos ni procesamos información que identifique o pueda vincularse razonablemente con una persona (\"información personal\" o \"datos personales\"), como:</p>\n<ul>\n<li>Nombres, correos electrónicos, teléfonos o direcciones postales</li>\n<li>Cuentas de usuario o credenciales de inicio de sesión</li>\n<li>Direcciones IP vinculadas a individuos</li>\n<li>Identificadores en línea o datos de perfilado</li>\n<li>Datos de ubicación</li>\n<li>Información de pago o transacción</li>\n</ul>\n<p>Tampoco usamos analíticas, cookies publicitarias, píxeles de seguimiento ni tecnologías similares que permitan identificarnos o rastrear usuarios en el tiempo.</p>\n<p>Como no recopilamos información personal:</p>\n<ul>\n<li>No vendemos, compartimos ni divulgamos información personal a terceros</li>\n<li>No usamos información personal para publicidad, perfilado o marketing</li>\n<li>No realizamos decisiones automatizadas ni perfilado basados en datos personales</li>\n</ul>\n<h2>2. Información almacenada en su navegador (almacenamiento local / cookies)</h2>\n<p>El sitio guarda una cantidad mínima de información solo en su navegador para recordar sus preferencias. Esta información no se envía a nuestros servidores ni es accesible de forma que le identifique.</p>\n<p>Podemos guardar datos de preferencia en su navegador (almacenamiento local, cookies o tecnologías similares), entre ellos:</p>\n<ul>\n<li>Preferencia de tema: modo oscuro o claro</li>\n<li>Última página vista: \"planefence\" o \"plane-alert\"</li>\n<li>Preferencia de idioma: idioma seleccionado del sitio</li>\n<li>Registro de consentimiento (si opta por él): si consintió que guardemos estas preferencias</li>\n</ul>\n<p>Estas preferencias:</p>\n<ul>\n<li>Se usan solo para mejorar su experiencia (p. ej., recordar tema, idioma y última página)</li>\n<li>Se almacenan localmente en su navegador y no se transmiten a nosotros como datos personales</li>\n<li>No contienen su nombre, correo, IP ni ningún otro identificador personal</li>\n</ul>\n<p>Si no permite este almacenamiento, puede usar el sitio igualmente, pero quizá deba elegir sus preferencias en cada visita.</p>\n<h2>3. Base legal y cumplimiento (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Según el GDPR y la LGPD, no procesamos datos personales. La información limitada de preferencias en su navegador es necesaria para la funcionalidad básica (p. ej., mantener su idioma) o se guarda con su consentimiento cuando corresponde. Puede desactivar este almacenamiento en la configuración de su navegador o mediante las preferencias del sitio (si se ofrecen).</p>\n<p>Para residentes de California: No recopilamos, vendemos ni compartimos \"información personal\" según la CCPA/CPRA. No la divulgamos a terceros por contraprestación monetaria u otro valor. No usamos ni divulgamos \"información personal sensible\". Como no recopilamos información personal, los derechos típicos de la CCPA/CPRA (acceso, eliminación, corrección u optar por no vender/compartir) generalmente no aplican. Si cree que pudimos recopilar información personal por error, contáctenos y atenderemos su solicitud conforme a la ley.</p>\n<h2>4. Sus opciones y control</h2>\n<p>Puede controlar cómo se guardan las preferencias en su navegador:</p>\n<ul>\n<li><strong>Configuración del navegador:</strong> puede bloquear o borrar cookies y almacenamiento local en los ajustes de privacidad o seguridad. Si lo hace, el sitio puede dejar de recordar tema, última página, idioma o estado de consentimiento.</li>\n<li><strong>Controles en el sitio (si existen):</strong> podemos ofrecer un control en la página (conmutador o banner) para permitir o rechazar el almacenamiento de preferencias. Si opta por no guardarlas, intentaremos dejar de almacenar nuevos datos; su navegador puede conservar los existentes hasta que los borre.</li>\n</ul>\n<h2>5. Privacidad infantil</h2>\n<p>El sitio no está dirigido a menores de 13 años (o edad superior según la ley local), ni recopilamos conscientemente información personal de menores. Como no recopilamos información personal, no creamos perfiles de menores ni los dirigimos para ningún fin.</p>\n<h2>6. Servicios de terceros</h2>\n<p>Diseñamos el sitio para no incorporar analíticas, publicidad o rastreadores de terceros que recopilen información personal. Si en el futuro integramos contenido o herramientas de terceros que puedan procesar información personal, actualizaremos esta Declaración y ofreceremos información y controles claros conforme a la ley.</p>\n<h2>7. Usuarios internacionales</h2>\n<p>El sitio puede accederse desde distintos países, pero nuestras prácticas están diseñadas para no recopilar información personal de ningún usuario, sin importar su ubicación. Si aplica alguna ley de privacidad (como GDPR o LGPD), nuestra postura es minimizar la recopilación a datos de preferencias no personales almacenados localmente en su navegador.</p>\n<h2>8. Cambios en esta Declaración</h2>\n<p>Podemos actualizar esta Declaración cuando cambiemos cómo almacenamos preferencias o si empezamos a procesar información personal. Al hacerlo, actualizaremos la fecha de \"Última actualización\" y publicaremos la versión revisada aquí. Si alguna vez comenzamos a recopilar información personal, actualizaremos esta Declaración antes de hacerlo y, cuando se requiera, obtendremos su consentimiento.</p>\n<h2>9. Contacto</h2>\n<p>Si tiene preguntas sobre esta Declaración o cree que pudimos recopilar información personal por error, puede contactarnos en:</p>\n<p>Correo: planefence (at) kx1t (dot) com<br>Dirección postal: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Revisaremos y responderemos conforme a las leyes de privacidad aplicables.</p>"
      }
    },
    "ca-ES": {
      "name": "Català",
      "flag": "es-ct",
      "flag_path": "",
      "strings": {
        "privacy.title": "Etiqueta de privadesa",
        "privacy.lastUpdated": "Darrera actualització: 18- Jan- 2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "eu-ES": {
      "name": "Euskara",
      "flag": "es-pv",
      "flag_path": "",
      "strings": {
        "privacy.title": "Pribatutasun-adierazpena",
        "privacy.lastUpdated": "Azken eguneraketa: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "gl-ES": {
      "name": "Galego",
      "flag": "es-ga",
      "flag_path": "",
      "strings": {
        "privacy.title": "Declaración de privacidade",
        "privacy.lastUpdated": "Última actualización: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "qu-PE": {
      "name": "Quechua",
      "flag": "pe",
      "flag_path": "",
      "strings": {
        "privacy.title": "Rikchʼayqa Rimay",
        "privacy.lastUpdated": "Qhipa kunan: 18-ina-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"ñuqayku\") llapaq ñawinchayki waqaychayman qhawapachkan. Kay Rikchʼayqa rimaymi imayna manejasunchik willakuyta qankuna wasichaqku ruwaspa.</p>\n<h2>1. Mana runa willakuyta apaykuq</h2>\n<p>Kay wasichaqa rurasqa kayku mana ima runa willakuyta qhapaq, almacenaqa, ni procesaqqa, EU/UK GDPR, California CCPA/CPRA, huknin Brasil LGPD nisqapi. Qankuna tapuykiqa aswan servidorukunamanta pasaykusaq, chaykunaqa hinaptin imayna kasqantaqa mana riqsichiyku; chaymanta qankunaqa chaykunawan hina qhawakuyki.</p>\n<p>Mana apaykuyku, almacenaqa, ni procesaqqa runakunata riqsichiq willakuyta (\"personal information\" o \"personal data\"), kaykuna hina:</p>\n<ul>\n<li>Suti, correo electrónico, celular, utaq wasi direccionkuna</li>\n<li>Cuenta de usuario utaq lliw yaykuna</li>\n<li>IP direccionkuna runawan tʼinkisqa</li>\n<li>Online identificadorkuna utaq perfil willakuy</li>\n<li>Kawsay lugar willakuy</li>\n<li>Pago utaq transacción willakuy</li>\n</ul>\n<p>Manaqa analytics, publicidad cookies, tracking pixel ni huk tecnología kananpaq llamkʼayku mana sapa runata qatiqpaq.</p>\n<p>Manam runa willakuyta apaykuyku, chayrayku:</p>\n<ul>\n<li>Manam willakuyta rantikunchu, repartikunchu, ni qapaqkunaman churanchu</li>\n<li>Manam publicidadda, perfil nisqapi, utaq marketingpi llamkʼakunchu</li>\n<li>Manam decisión automatizada ni profiling ruwaykuqchu personal datawan</li>\n</ul>\n<h2>2. Qankuna navegadorpi waqaychasqa willakuy (local storage / cookies)</h2>\n<p>Wasichaqa achka mana, pisilla willakuyta navegadorniyki-pi waqaychanki, qankuta llapa preferenciayki yuyarinapaq. Mana servidorniyku-man apachikusqachu, manam ñuqaykuqa hapʼinanchu.</p>\n<p>Waqaychaykuchkan preferenciakuna navegadorniyki-pi (local storage, cookies utaq huk tecnologia):</p>\n<ul>\n<li>Tema preferencia: yana utaq yuraq modo</li>\n<li>Qhipa ñawiriykikuna: \"planefence\" utaq \"plane-alert\"</li>\n<li>Simi aklla: imayna simita munanki</li>\n<li>Konsento record (hinaspa akllanki): hinaqa ñuqayku waqaychaniykiku hinataqmi</li>\n</ul>\n<p>Kay preferenciakuna:</p>\n<ul>\n<li>Servicio allinta ruraypaq sapa kuti (tema, simi, qhipa panqa yuyay)</li>\n<li>Navegadorniyki-pilla chaskisqa, mana ñuqaykumanta personal dataman apachikusqachu</li>\n<li>Manam suti, correo, IP, utaq huk runa riqsichiqta hapʼinanchu</li>\n</ul>\n<p>Mana waqaychay munanki chaykuna, hinaqa wasichaqa llamkanqa, ichaqa sapa kuti preferenciaykiqa wakmanta akllananki.</p>\n<h2>3. Ley base nisqa (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>GDPR hinallataq LGPD nisqapi manam personal datata procesakuchu. Navegadorniyki-pi waqaychasqa preferenciakunaqa básica funcionalidadpaq uyayniyoqmi (simi akllay hina), utaq consentoniymi waqaychasqa. Browserniyki settings utaq wasichaq preferenciakunapi pichaspa hichʼayta atinki.</p>\n<p>California runakunapaq: manam CCPA/CPRA nisqapi \"personal information\" apaykuqchu, rantikuqchu, ni repartikuqchu. Manam \"sensitive personal information\" llamkʼakuqchu. Manam runa willakuyta apaykuqtaq, chayrayku derecho kananpiqa (acceso, pichana, allinchay, utaq venta/compartirpi mana munay) generalmentem mana applychu. Yachankiña, qhawariy warmiqa willakuyta hapʼisqa chayta, rikhuriptiyki ñuqayku churayku leywan ruranayku.</p>\n<h2>4. Akllanakuykikuna</h2>\n<p>Imayna preferenciakuna navegadorpi waqaychanataqa controla atinki:</p>\n<ul>\n<li><strong>Navegador settings:</strong> Cookies, local storage chinkachiy utaq pichaykuy privacidad/siguridaddi qutupi. Chayta ruwaspa, wasichaqa manaña yuyarinchu tema, qhipa panqa, simi, consentoni.</li>\n<li><strong>Wasichaq control (kaykuchkanchik kaptin):</strong> Panqapi toggleta utaq bannerqa churanchik consentopa. Mana munaspayki, chaymantaqa llapan musuq preferenciata mana waqaychasunchik; navegadorniykiqa qhipaq hina waqaychasqa kachkanqa chayta mana pichanki kashanqaman.</li>\n</ul>\n<h2>5. Wawa waqaychay</h2>\n<p>Kay wasichaqa manam 13 watapi (utaq ley sutiyoq aswan hatun watapi) wawakunaman llamkaykuchu, manam willakuyta apaykuqchu wawakunamanta. Mana personal datata apaykuqtaq, chayrayku manam perfilniyoqchu utaq targeteokuchu wawakunata.</p>\n<h2>6. Trato maska masi</h2>\n<p>Kay wasichaqa manam huk analytics, publicidad utaq tracker tercerokunata churanapaq rurasqachu. Hinaspaqa, ñoqayku imaynataq ruwasunchik chaykuna willakuyta, controlkuna sutʼisqa leywan uyariqmi.</p>\n<h2>7. Tawa suyumanta qankuna</h2>\n<p>Wasichaqa llaqtakuna hukninmanta llamkʼasqa, ichaqa ñoqayku manam ima personal datata apaykuyku, maypi kashaspa chayrayku. Huk privacy ley kanan (GDPR utaq LGPD hina) applykiptinchik, ñoqaykuqa pisillata apaykuyta, preferenciakuna navegadorniyki-pi localmente waqaychasqa.</p>\n<h2>8. Hukmanta tikraykuna</h2>\n<p>Hinaptinqa kay Rikchʼayqa hukmanta tikrankuman, hukmanta preferenciakuna imayna waqaychasunchik utaq personal data llamkʼayta qallarimunanchik. Tikrakuspan, \"Qhipa kunan\" fecha tikranku chaypi, kay panqapi huk versiónta churanku. Personal datata apaykuyta qallarimusaq kay rikchʼayta ñawpaqta churayku, mosoq consentimientoqa hinaspaqa.</p>\n<h2>9. Ñawpaqta rimakuy</h2>\n<p>Kay Rikchʼaymanta tapuykuna kashanki utaq imapaq mana munasqa personal willakuyta chaskirqayku niruwaykita yuyarispa, qawayku chaypin:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Dirección postal: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Leyta uyarispa qhawarisunchik huknin willakuykuna.</p>"
      }
    },
    "nl-NL": {
      "name": "Nederlands",
      "flag": "nl",
      "flag_path": "",
      "strings": {
        "privacy.title": "Privacyverklaring",
        "privacy.lastUpdated": "Laatst bijgewerkt: 18-jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "fy-NL": {
      "name": "Frysk",
      "flag": "nl",
      "flag_path": "./assets/flags/Friesland.gif",
      "strings": {
        "privacy.title": "Privacyferklearring",
        "privacy.lastUpdated": "Lêst bywurke: 18-jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"wy\") set him yn foar dyn privacy. Dizze Privacyferklearring leit út hoe’t wy ynformaasje behannelje as do ús webside brûkst.</p>\n<h2>1. Gjin persoanlike gegevens sammelje</h2>\n<p>Wy ha de side sa makke dat wy gjin persoanlike gegevens sammelje, opslaan of ferwurkje neffens de EU/UK GDPR, de California CCPA/CPRA, en de Braziliaanske LGPD. Dyn fersyk kin oer oare servers gean foardat it ús berikt; dy kinne dyn gegevens oars behannelje. Wy hawwe dêr gjin kontrôle oer; regelje dyn privacy-easken mei dy tsjinsten sels.</p>\n<p>Wy sammelje, bewarje of ferwurkje gjin gegevens dy’t in persoan identifisearje of ridlikerwize keppele wurde kinne, lykas:</p>\n<ul>\n<li>Namme, e-mail, telefoannûmer of postadres</li>\n<li>Brûkersakkounts of oanmeldgegevens</li>\n<li>IP-adressen keppele oan persoanen</li>\n<li>Online identifiers of profylgegevens</li>\n<li>Lokasjedata</li>\n<li>Betelling of transaksje-ynformaasje</li>\n</ul>\n<p>Wy brûke ek gjin analytics, advertinsjecookies, trackingpixels of ferlykbere techniken om brûkers oer tiid te folgjen.</p>\n<p>Omdat wy gjin persoanlike gegevens sammelje, dogge wy it folgjende net:</p>\n<ul>\n<li>Ferkeapje, diele of iepenbierje persoanlike gegevens oan tredden</li>\n<li>Brûke persoanlike gegevens foar reklame, profiling of marketing</li>\n<li>Utfiere automatyske besluten of profiling op basis fan persoanlike gegevens</li>\n</ul>\n<h2>2. Ynformaasje bewarre yn dyn browser (lokale opslach / cookies)</h2>\n<p>De webside bewarret in hiel lyts bytsje ynformaasje yn dyn browser, allinnich om dyn foarkarren te ûnthâlden. Dy ynformaasje giet net nei ús servers en is foar ús net tagonklik as persoansgegevens.</p>\n<p>Wy kinne foarkarsgegevens yn dyn browser bewarje (lokale opslach, cookies of ferlykbere techniken), ûnder oaren:</p>\n<ul>\n<li>Tema: donker of ljocht</li>\n<li>Lêst besochte side: \"planefence\" of \"plane-alert\"</li>\n<li>Taal: de selektearre taal fan de webside</li>\n<li>Consentrecord (as keazen): oftst tastimming joech om dizze foarkarren te bewarjen</li>\n</ul>\n<p>Dizze foarkarswearden:</p>\n<ul>\n<li>Wurden allinnich brûkt om dyn ûnderfining te ferbetterjen (tema, taal, lêste side ûnthâlde)</li>\n<li>Steane lokaal yn dyn browser en wurde net as persoansgegevens nei ús stjoerd</li>\n<li>Bevatte gjin namme, e-mail, IP of oare identifisearjende gegevens</li>\n</ul>\n<p>Kiest net foar dizze opslach, dan wurket de side noch, mar moatst elke kear op ’e nij foarkarren kieze.</p>\n<h2>3. Juridyske basis en neilibjen (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under GDPR en LGPD ferwurkje wy gjin persoansgegevens. De beheinde foarkarsynformaasje yn dyn browser is nedich foar basisfunksjes (bgl. taal ûnthâlde) of wurdt mei dyn tastimming bewarre. Do kinst dizze opslach útskeakelje yn de browsersettings of yn de foarkarren fan de side (as oanbean).</p>\n<p>Foar ynwenners fan Kalifornje: Wy sammelje, ferkeapje of diele gjin \"persoanlike ynformaasje\" neffens CCPA/CPRA. Wy jouwe gjin persoansgegevens oan tredden foar jild of oare wearde. Wy brûke of diele gjin \"gefoelige persoanlike ynformaasje\". Om’t wy gjin persoansgegevens sammelje, jilde de measte CCPA/CPRA-rjochten (tagong, wiskjen, korrizjearjen, of ôfmelde foar ferkeap/dielen) meast net. Tinkst dat wy per ûngelok persoansgegevens krigen hawwe, nim kontakt op; wy hannelje it neffens de wet ôf.</p>\n<h2>4. Dyn keuzes en kontrôle</h2>\n<p>Do kinst beheare hoe’t foarkarren bewarre wurde yn dyn browser:</p>\n<ul>\n<li><strong>Browsersettings:</strong> Cookies en lokale opslach blokkearje of wiskje yn privacy- of feilichheidsynstellingen. De side kin dan tema, lêste side, taal of tastimmingsstatus net mear ûnthâlde.</li>\n<li><strong>Yn-site kontrôles (as oanbean):</strong> In schakelaar of banner kin oanbean wurde om foarkarsopslach oan/út te setten. Setst it út, dan stopje wy mei nije foarkarren; besteande gegevens bliuwe oant do se sels wiskest.</li>\n</ul>\n<h2>5. Bern</h2>\n<p>De webside is net bedoeld foar bern ûnder 13 jier (of hegere leeftyd neffens lokale wet) en wy sammelje bewust gjin persoansgegevens fan bern. Wy meitsje gjin profilen fan bern en rjochtsje ús net spesifyk op harren.</p>\n<h2>6. Tsjinsten fan tredden</h2>\n<p>Wy ûntwerpe de side sa dat der gjin analytics-, advertinsje- of trackingtsjinsten fan tredden mei persoansgegevens brûkt wurde. Mocht dat yn ’e takomst feroarje, dan wurkje wy dizze ferklearring by en leverje dúdlike ynformaasje en kontrôles neffens de wet.</p>\n<h2>7. Ynternasjonale brûkers</h2>\n<p>De side kin wrâldwiid besjoen wurde, mar ús praktyk is om gjin persoansgegevens fan hokker brûker dan ek te sammeljen. As in privacywet (lykas GDPR of LGPD) fan tapassing is, minimalisearje wy de samling ta net-persoanlike foarkarsgegevens bewarre yn dyn browser.</p>\n<h2>8. Wizigingen fan dizze ferklearring</h2>\n<p>Wy kinne dizze ferklearring bywurkje as wy foarkarsopslach oanpasse of persoansgegevens begjinne te ferwurkjen. Wy ferfarskje dan de datum \"Lêst bywurke\" boppe-oan en publisearje de nije ferzje hjir. As wy ea persoansgegevens sammelje, dogge wy dat pas nei in bywurke ferklearring en, wêr’t nedich, mei dyn tastimming.</p>\n<h2>9. Kontakt</h2>\n<p>Fragen of tinkst dat wy persoansgegevens per ûngelok krigen hawwe? Nim kontakt op mei:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postadres: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Wy beäntwurdzje neffens jildende privacywetjouwing.</p>"
      }
    },
    "li-NL": {
      "name": "Limburgs",
      "flag": "nl",
      "flag_path": "./assets/flags/Limburg.gif",
      "strings": {
        "privacy.title": "Privacyverklaring",
        "privacy.lastUpdated": "Laatste aanpassing: 18-jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"veur mich\") set zich in veur dien privacy. Dees Privacyverklaring leet zien hoe veer mit informatie umgaon as geer ós website gebroek.</p>\n<h2>1. Gein persoonsgegajevene verzuumele</h2>\n<p>We höbbe de site zo opgezet dat veer gein persoonsgegajevene verzuumele, opsjlaon of verwerke ónger de EU/UK GDPR, de Californische CCPA/CPRA en de Braziliaanse LGPD. Dien verzeuk kin via anger servers gaon veur ’t ós bereik; die kinne angers mit dien gegajeve umgaon. Veer höbbe daar gein invloead op; regelt dien privacywense zelf mit die diens.</p>\n<p>Veer verzuumele, bewere of verwerke gein gegajeve die ’n persoon kinne óngerkennen of realisties koppelen, such as:</p>\n<ul>\n<li>Name, e-mail, telefoon of postadres</li>\n<li>Gebroekersaccounts of inloggegajeve</li>\n<li>IP-adresse gekoppeld aan personen</li>\n<li>Online identifiers of profielgegajeve</li>\n<li>Locatiegegajeve</li>\n<li>Betalings- of transactie-informatie</li>\n</ul>\n<p>Veer gebroeke ouch gein analytics, advertentiecookies, trackingpixels of vergelijkbare technieken óm gebroekers euver tied te volgke.</p>\n<p>Omdat veer gein persoonsgegajevene verzuumele, doon veer ’t volgende neet:</p>\n<ul>\n<li>Persoonsgegajevene verkaupe, deile of openbaar make aan derden</li>\n<li>Persoonsgegajevene gebroeke veur reclames, profiling of marketing</li>\n<li>Automatisch beslute of profilere op basis van persoonsgegajevene</li>\n</ul>\n<h2>2. Informatie in dien browser (locale opsjlaog / cookies)</h2>\n<p>De website bewaart ’n klein beetje informatie allein in dien browser, óm dien voorkeuren te onthauwe. Dat geit neet nao ós servers en is veur ós neet te zien as persoonsgegajeve.</p>\n<p>Veer kinne voorkeurgegajeve opsjlaon in dien browser (locale opsjlaog, cookies of vergelijkbare technieken), ónger anger:</p>\n<ul>\n<li>Themapreferentie: donkeren of lichte modus</li>\n<li>Laotste bezoch site: \"planefence\" of \"plane-alert\"</li>\n<li>Taalpreferentie: de geselekteerde taal van de site</li>\n<li>Consent-registratie (as geer ’t aanzet): of geer toestem eigs veur ’t opsjlaon van dizze voorkeuren</li>\n</ul>\n<p>Deze voorkeurwaarden:</p>\n<ul>\n<li>Gebroek veur ’t verbetere van dien ervaoring (thema, taal, laotste pagina onthauwe)</li>\n<li>Staon lokaal in dien browser en gaon neet as persoonsgegajeve nao ós</li>\n<li>Bevotte gein name, e-mail, IP of anger identificerende gegajeve</li>\n</ul>\n<p>Kiest geer neet veur diese opsjlaog, dan blieft de site werke, mer mot geer mogelijk elke kiër opnuuj voorkeuren instelle.</p>\n<h2>3. Juridische basis en naleving (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Ónger GDPR en LGPD verweke veer gein persoonsgegajevene. De beperkte voorkeurinformatie in dien browser is óf noodzakelek veur basisfuncties (b.v. taal onthauwe) óf bewaard mit dien toestem. Geer kinne deze opsjlaog uitschaekele in browserinstellingen of in de site-voorkeuren (as aangebaj).</p>\n<p>Veur inwoners van Californië: Veer verzuumele, verkaupe of deile gein \"persoonsinformasie\" ónger de CCPA/CPRA. Veer geave gein persoonsgegajeve aan derden veur geld of anger wearde. Veer gebroeke of deile gein \"gevoelige persoonsinformasie\". Omdat veer gein persoonsgegajevene verzuumele, zint de meiste CCPA/CPRA-rechte (toegang, wisse, corrigere, of ófmelden veur verkoop/deling) meestal neet van toepassing. Dinkse dat veer per ongelt persoongsgegajeve kriege höbbe, meld ’t ós; veer hanjele neet volgens de wet.</p>\n<h2>4. Dien keuzen en controle</h2>\n<p>Geer kinne bepaole hoe voorkeurinformatie in dien browser bewaart weurt:</p>\n<ul>\n<li><strong>Browserinstellingen:</strong> Cookies en locale opsjlaog blokkere of wisse in privacy- of beveiligingsinstellingen. De site kan dan thema, laotste pagina, taal of consentstatus neet mie onthauwe.</li>\n<li><strong>In-site controles (as aangebaj):</strong> ’n Schakelaar of banner kan aangebaj weure om opsjlaog van voorkeuren aan/uit te setten. Zet geer ’t oet, dan höbbe veer op houwe mit nieuwe voorkeuren; bestaande data blief tot geer ze zelf wisse.</li>\n</ul>\n<h2>5. Kinger</h2>\n<p>De site is neet bedoeld veur kinger ónger 13 jaor (of ’n hogere leefdied volgens locale wet) en veer verzuumele bewust gein persoonsgegajevene van kinger. Veer make gein profielen van kinger en richtse ós neet op höbbe.</p>\n<h2>6. Derdepatsdiensten</h2>\n<p>Veer ontwerpe de site zo dat gein analytics-, advertinsje- of trackingdiensten van derden die persoonsgegajeve verweke yngezet weure. As dat in de toekomst toch gebaort, passe veer deze ferklearing aan en biede duidlike informatie en controles neet de wet.</p>\n<h2>7. Internasjonale gebroekers</h2>\n<p>De site kin wereldwijd bezoch weure, mer ós praktyk is gein persoonsgegajevene van ook wae gebroeker te verzuumele. As ’n privacywet (b.v. GDPR of LGPD) geld, minimalisere veer de sameling tot niet-persoonlike voorkeurdata lokaal opsjlaon in dien browser.</p>\n<h2>8. Wizjigingen</h2>\n<p>Veer kinne deze ferklearing bieje as veer de opsjlaog fan voorkeuren oanpasse of begós mit persoonsgegajeve. Veer werk de datum \"Laatste aanpassing\" boppe biij en publiceer de nije versie hie. As veer oait persoongsgegajeve verzuumele, dóón veer dat pas nao ’n bieje ferklearing en, waernodig, mit dien toestem.</p>\n<h2>9. Contact</h2>\n<p>Vraoge of vermoedens dat veer per ongelt persoonsgegajeve kriege höbbe? Nem contact op:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postadres: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Veer reageere neet de geljende privacywetgeving.</p>"
      }
    },
    "de-DE": {
      "name": "Deutsch",
      "flag": "de",
      "flag_path": "",
      "strings": {
        "privacy.title": "Datenschutzerklärung",
        "privacy.lastUpdated": "Letzte Aktualisierung: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "de-CH": {
      "name": "Schwiizerdütsch",
      "flag": "ch",
      "flag_path": "",
      "strings": {
        "privacy.title": "Datenschutzerklärung",
        "privacy.lastUpdated": "Letzte Aktualisierung: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "fr-FR": {
      "name": "Français",
      "flag": "fr",
      "flag_path": "",
      "strings": {
        "privacy.title": "Déclaration de confidentialité",
        "privacy.lastUpdated": "Dernière mise à jour 18 janvier-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "it-IT": {
      "name": "Italiano",
      "flag": "it",
      "flag_path": "",
      "strings": {
        "privacy.title": "Informativa sulla privacy",
        "privacy.lastUpdated": "Ultimo aggiornamento: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "la": {
      "name": "Latina",
      "flag": "va",
      "flag_path": "./assets/flags/Roman_Empire.jpg",
      "strings": {
        "privacy.title": "Declaratio de Privatis",
        "privacy.lastUpdated": "Novissime renovatum: 18-Ian-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"nos\") tuae privati tutelae studet. Haec Declaratio explicat quomodo informationes tractemus cum nostrum locum interretialem uteris.</p>\n<h2>1. Nulla notitia personalis collecta</h2>\n<p>Locum sic designavimus ut nullas notitias personales colligamus, reponamus, aut tractemus iuxta GDPR EU/UK, CCPA/CPRA Californiae, et LGPD Brasiliae. Petitio tua per alia servientia transire potest antequam ad nos perveniat; illa notitias tuas aliter tractare possunt. De his nihil scimus nec eas regere possumus; tuas postulationes cum illis pertracta.</p>\n<p>Non colligimus, reponimus, nec tractamus ullas notitias quae personam designant aut rationabiliter conecti possunt, ut:</p>\n<ul>\n<li>Nomina, inscriptiones electronicae, telephona, aut domicilia</li>\n<li>Rationes usoris aut data aditum</li>\n<li>Inscriptiones IP personis adnexae</li>\n<li>Identificatoria online aut data profilandi</li>\n<li>Data locorum</li>\n<li>Informationes solutionum aut transactionum</li>\n</ul>\n<p>Nec utimur analytica, crustulis publicitatis, pixelis vestigantibus, aut similibus technologiis ad utentes per tempus sequi.</p>\n<p>Quia notitias personales non colligimus, hoc non facimus:</p>\n<ul>\n<li>Non vendimus, communicamus, neque patefacimus notitias personales ad tertios</li>\n<li>Non utimur notitiis personalibus ad mercatum, profiling, aut promotionem</li>\n<li>Non exercemus decisiones automatas aut profiling fundatas in datis personalibus</li>\n</ul>\n<h2>2. Notitia in tuo navigatro (repositio localis / crustula)</h2>\n<p>Pagina minimum notitiarum tantum in tuo navigatro servat, ad memoriam tuarum optionum. Haec ad nostra servientia non mittuntur nec a nobis tamquam data personalia attingi possunt.</p>\n<p>Servare possumus data praeferentiarum in navigatro tuo (repositio localis, crustula, aut similia), inter quae:</p>\n<ul>\n<li>Thema: modus ater vel clarus</li>\n<li>Ultima pagina visa: \"planefence\" aut \"plane-alert\"</li>\n<li>Lingua: lingua selecta situs</li>\n<li>Memoria consensus (si optasti): utrum consensum dedisti ad has praeferentias servandas</li>\n</ul>\n<p>Haec praeferentiae:</p>\n<ul>\n<li>Tantum ad experientiam tuam emendandam utuntur (thema, linguam, ultimam paginam meminisse)</li>\n<li>Localiter servantur et non transmittuntur nobis ut data personalia</li>\n<li>Non continent nomen, inscriptionem electronicam, IP, aut aliud indicium identificans</li>\n</ul>\n<p>Si hanc repositiônem vetas, situs manebit utilis, sed praeferentias saepius iterum eligere debebis.</p>\n<h2>3. Basis iuridica et observantia (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Sub GDPR et LGPD non tractamus data personalia. Pauca praeferentiarum data in navigatro tuo vel necessaria sunt ad functiones fundamentales (p. ex. linguam meminisse) vel cum consensu tuo servantur. Hanc repositiônem inhibere potes per configurationes navigatri aut per optiones in situ (si praebentur).</p>\n<p>Pro civibus Californiae: Non colligimus, vendimus, nec communicamus \"informationes personales\" ut definitur in CCPA/CPRA. Non tradimus notitias personalis ad tertios pro pretio. Non utimur nec communicamus \"informationes personales sensibiles\". Quia notitias personales non colligimus, iura solita CCPA/CPRA (accessus, deletio, correctio, aut opt-out venditionis/communicationis) plerumque non applicant. Putasne nos forte notitias personalis accepisse? Contactum cape et iuxta legem agam.</p>\n<h2>4. Optiones tuae et moderatio</h2>\n<p>Modum repositiônis praeferentiarum regere potes:</p>\n<ul>\n<li><strong>Configurationes navigatri:</strong> Crustula et repositiônem localem in tabulis privatis aut securitatis prohibere vel delere. Situs dan thema, ultimam paginam, linguam, aut statum consensus non meminerit.</li>\n<li><strong>Optiones in pagina (si praebentur):</strong> Clavis aut vexillum praeberi potest ut repositiônem foederes. Si recusas, novas praeferentias non servabimus; data antiqua manent donec ea purges.</li>\n</ul>\n<h2>5. Privatas puerorum</h2>\n<p>Situs non est destinatus pueris sub 13 annis (aut maiori aetate ut lex localis statuit) et non consulto colligimus notitias personales puerorum. Non facimus perfiles puerorum nec eos ad aliquem finem adtingimus.</p>\n<h2>6. Tertia servitia</h2>\n<p>Situm ita componimus ut nec analytics nec advertentiae nec tracking tertiorum quae notitias personales colligant adhibeantur. Si aliquando mutemus, hanc Declarationem renovabimus et claram informationem et moderamina praebebimus secundum legem.</p>\n<h2>7. Usoribus internationalibus</h2>\n<p>Situs ubique terrarum accedi potest, sed consilium nostrum est nullas notitias personales cuiusquam colligere. Si lex privatis (ut GDPR aut LGPD) applicatur, collectionem minimis ad praeferentias non personales localiter in tuo navigatro repositas reducimus.</p>\n<h2>8. Mutationes huius Declarationis</h2>\n<p>Hanc Declarationem renovare possumus si mutamus quomodo praeferentias servamus aut si in futurum data personalia tractare incipimus. Tunc diem \"Novissime renovatum\" in summo mutabimus et hanc paginam renovabimus. Si umquam data personalia colligere incipiamus, antea hanc Declarationem renovabimus et, si opus est, consensum petemus.</p>\n<h2>9. Contactus</h2>\n<p>Si quaestiones habes aut putas nos forte data personalia collegisse, contingere potes:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Adres: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Respondebimus secundum leges privatis applicabiles.</p>"
      }
    },
    "fi-FI": {
      "name": "Suomi",
      "flag": "fi",
      "flag_path": "",
      "strings": {
        "privacy.title": "Tietosuojalauseke",
        "privacy.lastUpdated": "Päivitetty viimeksi: 18. tammikuuta-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "sv-SE": {
      "name": "Svenska",
      "flag": "se",
      "flag_path": "",
      "strings": {
        "privacy.title": "Integritetspolicy",
        "privacy.lastUpdated": "Senast uppdaterad: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "pt-BR": {
      "name": "Português (Brasil)",
      "flag": "br",
      "flag_path": "",
      "strings": {
        "privacy.title": "Declaração de privacidade",
        "privacy.lastUpdated": "Última actualização: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "fr-CJ": {
      "name": "Français cadien",
      "flag": "us",
      "flag_path": "",
      "strings": {
        "privacy.title": "Déclaration de confidentialité",
        "privacy.lastUpdated": "Dernière mise à jour : 18-janv-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"nous\") s’engage à protéger votre vie privée. Cette Déclaration de confidentialité explique comment nous traitons les informations lorsque vous utilisez notre site.</p>\n<h2>1. Aucune information personnelle collectée</h2>\n<p>Nous avons conçu ce site pour ne pas collecter, stocker ou traiter d’informations personnelles au sens du RGPD UE/R.-U., du CCPA/CPRA de Californie et de la LGPD du Brésil. Votre demande peut passer par d’autres serveurs avant de nous atteindre; ils peuvent traiter vos données autrement. Nous ne les contrôlons pas; gérez vos exigences de confidentialité directement avec ces services.</p>\n<p>Nous ne collectons, ne stockons ni ne traitons d’informations permettant d’identifier une personne ou pouvant raisonnablement y être liées, telles que :</p>\n<ul>\n<li>Noms, e-mails, numéros de téléphone ou adresses postales</li>\n<li>Comptes utilisateurs ou identifiants de connexion</li>\n<li>Adresses IP liées à des individus</li>\n<li>Identifiants en ligne ou données de profilage</li>\n<li>Données de localisation</li>\n<li>Informations de paiement ou de transaction</li>\n</ul>\n<p>Nous n’utilisons pas non plus d’analytics, de cookies publicitaires, de pixels de suivi ou de technologies similaires pour suivre les utilisateurs dans le temps.</p>\n<p>Parce que nous ne collectons pas d’informations personnelles, nous ne :</p>\n<ul>\n<li>Vendons, ne partageons ou ne divulguons pas d’informations personnelles à des tiers</li>\n<li>N’utilisons pas d’informations personnelles pour la publicité, le profilage ou le marketing</li>\n<li>Ne réalisons pas de décisions automatisées ou de profilage basés sur des données personnelles</li>\n</ul>\n<h2>2. Informations stockées dans votre navigateur (stockage local / cookies)</h2>\n<p>Le site stocke une très petite quantité d’informations uniquement dans votre navigateur, pour mémoriser vos préférences. Ces données ne sont pas envoyées à nos serveurs et ne nous sont pas accessibles comme données personnelles.</p>\n<p>Nous pouvons stocker des préférences dans votre navigateur (stockage local, cookies ou technologies similaires), notamment :</p>\n<ul>\n<li>Préférence de thème : mode sombre ou clair</li>\n<li>Dernière page consultée : \"planefence\" ou \"plane-alert\"</li>\n<li>Préférence de langue : langue sélectionnée pour le site</li>\n<li>Trace de consentement (si choisie) : si vous avez consenti au stockage de ces préférences</li>\n</ul>\n<p>Ces valeurs de préférence :</p>\n<ul>\n<li>Sont utilisées uniquement pour améliorer votre expérience (mémoriser thème, langue, dernière page)</li>\n<li>Sont stockées localement et ne sont pas transmises comme données personnelles</li>\n<li>Ne contiennent ni nom, ni e-mail, ni IP, ni autre identifiant</li>\n</ul>\n<p>Si vous refusez ce stockage, le site fonctionnera toujours, mais vous devrez peut-être ressaisir vos préférences à chaque visite.</p>\n<h2>3. Base légale et conformité (RGPD, CCPA/CPRA, LGPD)</h2>\n<p>Au titre du RGPD et de la LGPD, nous ne traitons pas de données personnelles. Les préférences limitées stockées dans votre navigateur sont nécessaires aux fonctions de base (p. ex. mémoriser la langue) ou sont stockées avec votre consentement. Vous pouvez désactiver ce stockage via votre navigateur ou, si disponible, via les préférences sur le site.</p>\n<p>Pour les résidents de Californie : Nous ne collectons, ne vendons ni ne partageons d’\"informations personnelles\" selon le CCPA/CPRA. Nous ne les divulguons pas à des tiers en échange de valeur. Nous n’utilisons ni ne divulguons d’\"informations personnelles sensibles\". Parce que nous ne collectons pas d’informations personnelles, les droits CCPA/CPRA (accès, suppression, correction, ou opt-out de vente/partage) ne s’appliquent généralement pas. Si vous pensez que nous avons recueilli des informations personnelles par erreur, contactez-nous et nous agirons conformément à la loi.</p>\n<h2>4. Vos choix et contrôles</h2>\n<p>Vous pouvez contrôler comment les préférences sont stockées dans votre navigateur :</p>\n<ul>\n<li><strong>Paramètres du navigateur :</strong> bloquez ou supprimez cookies et stockage local dans les réglages de confidentialité ou de sécurité. Le site pourra alors oublier le thème, la dernière page, la langue ou l’état de consentement.</li>\n<li><strong>Contrôles sur le site (le cas échéant) :</strong> nous pouvons proposer un interrupteur ou une bannière pour accepter ou refuser le stockage des préférences. En cas de refus, nous arrêterons de stocker de nouvelles préférences; les données existantes restent jusqu’à ce que vous les effaciez.</li>\n</ul>\n<h2>5. Confidentialité des enfants</h2>\n<p>Le site ne vise pas les enfants de moins de 13 ans (ou âge supérieur fixé localement) et nous ne collectons pas sciemment d’informations personnelles d’enfants. Nous ne créons pas de profils d’enfants ni ne les ciblons.</p>\n<h2>6. Services tiers</h2>\n<p>Nous concevons le site pour éviter les services tiers d’analytics, de publicité ou de suivi qui collectent des données personnelles. Si cela change, nous mettrons à jour cette Déclaration et fournirons des informations et contrôles clairs selon la loi.</p>\n<h2>7. Utilisateurs internationaux</h2>\n<p>Le site peut être consulté partout; notre pratique est de ne pas collecter de données personnelles, peu importe votre localisation. Si une loi (comme le RGPD ou la LGPD) s’applique, nous réduisons la collecte aux seules données de préférences non personnelles stockées localement.</p>\n<h2>8. Modifications de cette Déclaration</h2>\n<p>Nous pouvons mettre cette Déclaration à jour si nous changeons la façon de stocker les préférences ou si nous commençons à traiter des données personnelles. Nous mettrons alors à jour la date \"Dernière mise à jour\" en haut et publierons la version révisée ici. Si un jour nous collectons des données personnelles, nous le ferons seulement après mise à jour de cette Déclaration et, si requis, avec votre consentement.</p>\n<h2>9. Contact</h2>\n<p>Questions ou pensez-vous que nous avons collecté des données personnelles par erreur ? Contactez-nous :</p>\n<p>Email : planefence (at) kx1t (dot) com<br>Adresse postale : PO Box 11, Belmont, MA 02478, USA</p>\n<p>Nous répondrons conformément aux lois applicables.</p>"
      }
    },
    "pap-CW": {
      "name": "Papiamentu",
      "flag": "cw",
      "flag_path": "",
      "strings": {
        "privacy.title": "Deklarashon di Privasidat",
        "privacy.lastUpdated": "Ultimo aktualisashon: 18-yan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"nos\") ta komprometé pa protehá bo privasidat. E Deklarashon di privasidat aki ta splika kon nos ta maneha informashon ora bo ta usa nos website.</p>\n<h2>1. Ningun informashon personal ta kolektá</h2>\n<p>Nos a disena e site aki pa no kolektá, warda òf procesa informashon personal segun GDPR di EU/UK, CCPA/CPRA di California, i LGPD di Brasil. Bo petishon por pasa riba otro server promé ku yega na nos; esnan por trata bo dato difarente. Nos no tin kontrol riba esaki; bo mes mester regla bo privasidat ku esnan.</p>\n<p>Nos no ta kolektá, warda òf procesa informashon ku ta identifiká un persona òf por konektá ku dje, manera:</p>\n<ul>\n<li>Nòmber, email, telefòn òf adrès postal</li>\n<li>Kuenta di usuario òf dato di login</li>\n<li>Adres IP konektá ku persona</li>\n<li>Identifikadó online òf dato di perfil</li>\n<li>Dato di lokashon</li>\n<li>Informashon di pago òf transakshon</li>\n</ul>\n<p>Tampoko nos ta usa analytics, cookies di anunsio, tracking pixels òf téknika similar pa sigui usuario den tempu.</p>\n<p>Paso nos no ta kolektá informashon personal, nos no ta:</p>\n<ul>\n<li>Vende, kompartí òf publiká informashon personal ku partido di tres</li>\n<li>Usa informashon personal pa anunsio, profiling òf marketing</li>\n<li>Hasi desishon automátiko òf profiling basá riba dato personal</li>\n</ul>\n<h2>2. Informashon warda den bo browser (local storage / cookies)</h2>\n<p>E website ta warda un tiki informashon solamente den bo browser, solamente pa rekordá bo preferensia. E informashon aki no ta bai na nos server i nos no por mira dje manera dato personal.</p>\n<p>Nos por warda dato di preferensia den bo browser (local storage, cookies òf téknika similar), inkluí pero no limitá na:</p>\n<ul>\n<li>Preferensia di tema: modo skur òf kla</li>\n<li>Ultimo pagina wak: \"planefence\" òf \"plane-alert\"</li>\n<li>Preferensia di idioma: e idioma selektá di e site</li>\n<li>Rekòrd di konsento (si bo a skohe): si bo a duna nos konsento pa warda e preferensianan</li>\n</ul>\n<p>E preferensianan aki:</p>\n<ul>\n<li>Ta usa solamente pa mehorá bo eksperensia (rekordá tema, idioma, ultimo pagina)</li>\n<li>Ta warda lokalmente den bo browser i no ta manda na nos manera dato personal</li>\n<li>No tin bo nòmber, email, IP òf otro identifikadó personal</li>\n</ul>\n<p>Si bo no ta permití e opshon di warda, e site lo keda traha, pero bo lo mester skohe preferensianan kada biaha.</p>\n<h2>3. Base legal i kumplimentu (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Bou di GDPR i LGPD nos no ta procesa dato personal. E tiki preferensia den bo browser ta of nesesario pa funshon basiko (p.e. rekordá idioma) of ta warda ku bo konsento. Bo por deskonektá e warda via settings di browser òf via preferensia na e site (si e ta disponibel).</p>\n<p>Pa residente di California: Nos no ta kolektá, bende òf kompartí \"informashon personal\" segun CCPA/CPRA. Nos no ta duna informashon personal na partido di tres pa sèn òf otro balor. Nos no ta usa òf duna \"informashon personal sensitivo\". Paso nos no ta kolektá informashon personal, e derechonan di CCPA/CPRA (akses, eliminashon, korrekshon, òf opt-out di benta/kompartí) generalment no ta apliká. Si bo ta kere ku nos a risibí informashon personal pa aksidente, tuma kontakto ku nos; nos lo aktua segun e lei.</p>\n<h2>4. Bo eskoho i kontrol</h2>\n<p>Bo por kontrolá kon preferensianan ta warda den bo browser:</p>\n<ul>\n<li><strong>Browser settings:</strong> Blokia òf kita cookies i local storage den privacy/security settings. E site por no rekorda tema, ultimo pagina, idioma òf estado di konsento.</li>\n<li><strong>Kontrol na e site (si tin):</strong> Nos por ofrece un switch òf banner pa bo opt-in/out pa warda preferensianan. Si bo skeiru, nos lo intenta no warda preferensia nobo; dato bieuw ta keda te ora bo elimina nan.</li>\n</ul>\n<h2>5. Privasidat di mucha</h2>\n<p>E site no ta dirigi na mucha bou di 13 aña (òf mas haltu segun lei lokal), i nos no ta sa kolektá informashon personal di mucha. Nos no ta krea perfíl di mucha ni ta target nan.</p>\n<h2>6. Serbisionan di tercero</h2>\n<p>Nos ta disena e site pa no inkluí analytics, publisidat òf tracking di tercero ku por kolektá dato personal. Si den futuro nos integra kontenido òf tool di tercero ku por procesa dato personal, nos lo aktialisá e Deklarashon aki i duna informashon klaro i kontrolnan segun lei.</p>\n<h2>7. Usuaronan internashonal</h2>\n<p>E site por wordu akedé for di diferente pais, pero nos prátika ta no kolektá informashon personal di niun usuario, indi bo ta. Si un lei di privasidat (manera GDPR òf LGPD) ta apliká, nos ta minimisa kolekshon na preferensia no-personal warda lokalmente den bo browser.</p>\n<h2>8. Kambionan na e Deklarashon</h2>\n<p>Nos por aktualisá e Deklarashon ora nos kambia kon nos ta warda preferensia òf si nos kuminsa procesa dato personal. Ora nos kambia, nos ta kambia e fecha di \"Ultimo aktualisashon\" ariba i ta pone e version nobo aki. Si un dia nos kuminsa kolektá informashon personal, nos lo hasi esaki despues di aktualisashon i, si mester, ku bo konsento.</p>\n<h2>9. Kontakto</h2>\n<p>Si bo tin pregunta òf bo ta kere ku nos a kolektá informashon personal pa aksidente, por tuma kontakto:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Adrès postal: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Nos lo reeinda segun e lei di privasidat ku ta apliká.</p>"
      }
    },
    "jam-JM": {
      "name": "Patwa (Jamaica)",
      "flag": "jm",
      "flag_path": "",
      "strings": {
        "privacy.title": "Praisiv Staetment",
        "privacy.lastUpdated": "Las updiet: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"wi\") committed fi protek yu privacy. Dis Praisiv Staetment explain how wi hanl info wen yu use wi website.</p>\n<h2>1. Wi naw collect personal info</h2>\n<p>Wi build dis site so wi naw collect, store, or process personal info under EU/UK GDPR, California CCPA/CPRA, an Brazil LGPD. Yu request might pass tru odda server dem before it reach wi; dem server might deal wid yu data different. Wi nuh control dem; deal wid yu privacy need wid dem service direct.</p>\n<p>Wi naw collect, store, or process any info weh identify or link back to somebody (\"personal information\" or \"personal data\"), like:</p>\n<ul>\n<li>Name, email, phone, or mailing address</li>\n<li>User account or login detail</li>\n<li>IP address tie to people</li>\n<li>Online ID or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction info</li>\n</ul>\n<p>Wi also naw use analytics, ads cookies, tracking pixel, or any similar tech fi follow users over time.</p>\n<p>Cause wi naw collect personal info, wi naw:</p>\n<ul>\n<li>Sell, share, or disclose personal info to third party</li>\n<li>Use personal info fi ads, profiling, or marketing</li>\n<li>Do automated decision-making or profiling based pon personal data</li>\n</ul>\n<h2>2. Info store inna yu browser (local storage / cookies)</h2>\n<p>Di website store likkle info inna yu browser only fi memba yu preference. Dis info naw send to wi server an wi cyaa reach it as personal data.</p>\n<p>Wi might store preference data inna yu browser (local storage, cookies, or similar tech), including:</p>\n<ul>\n<li>Theme choice: dark or light mode</li>\n<li>Las page yu view: \"planefence\" or \"plane-alert\"</li>\n<li>Language choice: weh language yu pick fi di site</li>\n<li>Consent record (if yu opt in): whether yu gimme consent fi store dese preference</li>\n</ul>\n<p>Dese preference value dem:</p>\n<ul>\n<li>Use only fi mek yu experience better (memba yu theme, language, las page)</li>\n<li>Store local inna yu browser; naw send to wi as personal data</li>\n<li>Naw contain yu name, email, IP, or any oda personal ID</li>\n</ul>\n<p>If yu choose fi block dis storage, di site still wuk, but yu might haffi choose preference every visit.</p>\n<h2>3. Legal basis an compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under GDPR an LGPD, wi naw process personal data. Di likkle preference data inna yu browser a either needed fi basic function (like keep yu language) or store wid yu consent. Yu can disable it tru yu browser setting or any on-site preference (if available).</p>\n<p>Fi California resident: Wi naw collect, sell, or share \"personal information\" under CCPA/CPRA. Wi naw hand it to third party fi money or value. Wi naw use or share \"sensitive personal information\". Since wi naw collect personal info, di regular CCPA/CPRA rights (access, delete, correct, or opt-out of sell/share) mostly nuh apply. If yu tink wi might a collect personal info by mistake, link wi an wi deal wid it by law.</p>\n<h2>4. Yu choices an control</h2>\n<p>Yu can control how preference store in yu browser:</p>\n<ul>\n<li><strong>Browser setting:</strong> Block or delete cookies/local storage in privacy or security setting. If yu do dat, di site might nuh memba theme, las page, language, or consent status.</li>\n<li><strong>On-site control (if present):</strong> Wi might show toggle or banner fi opt in/out. If yu opt out, wi stop store new preference; yu browser might keep old data til yu clear it.</li>\n</ul>\n<h2>5. Pickney privacy</h2>\n<p>Wi site nuh target pickney under 13 (or higher age if law seh so), an wi naw knowingly collect pickney personal info. Since wi naw collect personal info, wi naw build pickney profile or target dem.</p>\n<h2>6. Third-party service</h2>\n<p>Wi design di site fi avoid third-party analytics, ads, or tracking weh collect personal info. If wi ever add third-party content or tool weh could process personal info, wi update dis statement an give clear info an control as di law require.</p>\n<h2>7. International users</h2>\n<p>People can access di site from anywhere, but wi practice still fi naw collect personal info. If any privacy law (like GDPR or LGPD) apply, wi minimize collection to non-personal preference data store local in yu browser.</p>\n<h2>8. Change to dis statement</h2>\n<p>Wi might update dis statement if wi change how wi store preference or if wi start process personal info. Wi update di \"Las updiet\" date at top an post di new version ya. If wi ever start collect personal info, wi update dis statement first an, if required, get yu consent.</p>\n<h2>9. Contact wi</h2>\n<p>If yu have question or tink wi collect personal info by mistake, reach out:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>Wi respond according to privacy law.</p>"
      }
    },
    "uk-UA": {
      "name": "Українська",
      "flag": "ua",
      "flag_path": "",
      "strings": {
        "privacy.title": "Заява про конфіденційність",
        "privacy.lastUpdated": "Останнє оновлення: 18-Джан-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we,\" \"us,\" or \"our\") is committed to protecting your privacy. This Privacy Statement explains how we handle information when you use our website.</p>\n<h2>1. No Personal Information Collected</h2>\n<p>We designed this website so that we do not collect, store, or process personal information within the meaning of the EU/UK General Data Protection Regulation (\"GDPR\"), the California Consumer Privacy Act and California Privacy Rights Act (\"CCPA/CPRA\"), and Brazil's Lei Geral de Protecao de Dados Pessoais (\"LGPD\"). Note that your access request may pass through other web servers before it reaches us, and that these servers may handle your data differently. We have no knowledge of these, and they are outside of our span of control; you should manage your privacy requirements directly with these services if needed.</p>\n<p>We do not collect, store, or process any information that identifies or can reasonably be linked to an individual (\"personal information\" or \"personal data\"), such as:</p>\n<ul>\n<li>Names, email addresses, phone numbers, or postal addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to individuals</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, advertising cookies, tracking pixels, or similar technologies that would allow us or third parties to identify or track individual users over time.</p>\n<p>Because we do not collect personal information, we:</p>\n<ul>\n<li>Do not sell, share, or disclose personal information to third parties</li>\n<li>Do not use personal information for advertising, profiling, or marketing</li>\n<li>Do not conduct automated decision-making or profiling based on personal data</li>\n</ul>\n<h2>2. Information Stored in Your Browser (Local Storage / Cookies)</h2>\n<p>The website stores a very small amount of information only in your browser, solely to remember your preferences. This information is not sent to our servers and is not accessible to us in a form that identifies you.</p>\n<p>We may store preference data in your browser (via local storage, cookies, or similar technologies), included but not limited to:</p>\n<ul>\n<li>Theme preference: whether you prefer dark mode or light mode</li>\n<li>Last viewed page: whether you last visited the \"planefence\" or \"plane-alert\" page</li>\n<li>Language preference: your selected language for the website</li>\n<li>Consent record (if opted in): whether you consented to us storing these preferences in your browser</li>\n</ul>\n<p>These preference values:</p>\n<ul>\n<li>Are used only to improve your experience (e.g., remembering your chosen theme, language, and last page)</li>\n<li>Are stored locally in your browser and are not transmitted to us as personal data</li>\n<li>Do not contain your name, email, IP address, or any other personal identifier</li>\n</ul>\n<p>If you choose not to allow this preference storage, you can still use the website, but you may have to re-select your preferences each time you visit.</p>\n<h2>3. Legal Basis and Compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under the GDPR and LGPD, we do not process personal data. The limited preference information stored in your browser is either necessary for providing the website's basic functionality and user experience (e.g., keeping your language selection), or stored with your consent where applicable. You may disable this storage at any time through your browser settings or by adjusting the preferences available on our website (if provided).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" as defined by the CCPA/CPRA. We do not disclose personal information to third parties for monetary or other valuable consideration. We do not use or disclose \"sensitive personal information.\" Because we do not collect personal information, the typical CCPA/CPRA rights (such as the right to access, delete, or correct personal information, and the right to opt out of sale or sharing) are generally not applicable to our website. If you believe that we may have inadvertently collected personal information, please contact us using the details below, and we will address your request in accordance with applicable law.</p>\n<h2>4. Your Choices and Control</h2>\n<p>You can control how preference information is stored in your browser in the following ways:</p>\n<ul>\n<li><strong>Browser settings:</strong> You can block or delete cookies and local storage data through your browser's privacy or security settings. If you do so, the website may no longer remember your dark/light mode, last visited page, language, or consent status.</li>\n<li><strong>On-site settings (if provided):</strong> We may offer an in-page control (e.g., a toggle or banner) allowing you to opt in or out of storing preferences. If you opt out, we will attempt to stop storing new preference data in your browser, but your browser may still retain existing data until you clear it.</li>\n</ul>\n<h2>5. Children's Privacy</h2>\n<p>Our website is not directed to children under the age of 13 (or a higher age as defined by local law), and we do not knowingly collect personal information from children. Since we do not collect personal information at all, we do not create profiles of children or target them for any purposes.</p>\n<h2>6. Third-Party Services</h2>\n<p>We design our website not to incorporate third-party analytics, advertising, or tracking services that collect personal information. If in the future we integrate any third-party content or tools that could process personal information, we will update this Privacy Statement, and provide clear information and controls consistent with applicable privacy laws.</p>\n<h2>7. International Users</h2>\n<p>Our website may be accessed from different countries, but our practices are designed so that we do not collect personal information from any user, regardless of location. To the extent any privacy law (such as the GDPR or LGPD) applies, our approach is to minimize data collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to This Privacy Statement</h2>\n<p>We may update this Privacy Statement from time to time, for example, if we change how we store preferences or if we begin processing personal information in the future. When we make changes, we will update the \"Last updated\" date at the top of this page, and post the revised Privacy Statement on this page. If we ever begin collecting personal information, we will update this Privacy Statement before such collection begins and, where required, obtain your consent.</p>\n<h2>9. Contact Us</h2>\n<p>If you have any questions about this Privacy Statement or believe that we may have inadvertently collected personal information, you can contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will review and respond in accordance with applicable privacy laws.</p>"
      }
    },
    "en-PI": {
      "name": "Pig Latin",
      "flag": "us",
      "flag_path": "",
      "strings": {
        "privacy.title": "Pirate Privacy Proclamation",
        "privacy.lastUpdated": "Last hoisted: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Arrr, Planefence (\"we\") be guardin’ yer privacy. This here Proclamation tells how we handle yer info when ye sail our site.</p>\n<h2>1. No booty o’ personal info taken</h2>\n<p>We rigged this site so we don’t collect, stash, or handle personal treasure under EU/UK GDPR, California CCPA/CPRA, or Brazil LGPD. Yer request may pass other ships afore it reaches us; they may treat yer data different. We don’t command ’em; mind yer privacy with those crews.</p>\n<p>We don’t collect, stash, or handle any info that pegs a matey or could link to one, like:</p>\n<ul>\n<li>Names, emails, phone numbers, or postal ports</li>\n<li>User accounts or login keys</li>\n<li>IP addresses tied to souls</li>\n<li>Online marks or profiling cargo</li>\n<li>Location bearings</li>\n<li>Payment or trade tallies</li>\n</ul>\n<p>We also shun analytics, ad cookies, tracking pixels, or any spyglass tech to tail ye over time.</p>\n<p>Since we take no personal bounty, we shan’t:</p>\n<ul>\n<li>Sell, share, or blab personal info to third parties</li>\n<li>Use personal info for ads, profiling, or marketing</li>\n<li>Run automated judgments or profiling from personal data</li>\n</ul>\n<h2>2. Info stowed in yer browser (local storage / cookies)</h2>\n<p>This site stows a wee bit o’ info in yer browser, just to remember yer choices. It ne’er leaves fer our servers nor reaches us as personal data.</p>\n<p>We may stow in yer browser (local storage, cookies, or the like):</p>\n<ul>\n<li>Theme fancy: dark or light</li>\n<li>Last viewed page: \"planefence\" or \"plane-alert\"</li>\n<li>Tongue o’ the site ye picked</li>\n<li>Consent log (if ye opt in): whether ye let us stow these choices</li>\n</ul>\n<p>These bits o’ preference:</p>\n<ul>\n<li>Only better yer voyage (remember theme, tongue, last page)</li>\n<li>Stay local in yer browser, ne’er sent to us as personal loot</li>\n<li>Hold no name, email, IP, nor other mark o’ ye</li>\n</ul>\n<p>Refuse this stowage and the site still sails, but ye may re-pick choices each visit.</p>\n<h2>3. Legal keel (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under GDPR and LGPD we don’t process personal cargo. The scant preference bits in yer browser be needed for basic riggin’ (like keepin’ yer tongue) or stowed with yer consent. Ye can disable stowage via yer browser or any on-site levers (if offered).</p>\n<p>California mates: We don’t collect, sell, or share \"personal information\" under CCPA/CPRA. We don’t hand it to third ships for coin or favor. We don’t use or share \"sensitive personal information.\" Since we collect none, the usual CCPA/CPRA rights (access, delete, correct, or opt-out o’ sell/share) mostly don’t apply. Think we snared personal info in error? Send word and we’ll handle by law.</p>\n<h2>4. Yer choices and helm</h2>\n<p>Ye can steer how preferences stow:</p>\n<ul>\n<li><strong>Browser rig:</strong> Block or clear cookies/local storage in privacy or security settings. Then the site may forget theme, last page, tongue, or consent flag.</li>\n<li><strong>On-site levers (if any):</strong> We may show a toggle/banner to opt in/out. Opt out, and we’ll stop stowin’ new bits; old ones stay till ye clear ’em.</li>\n</ul>\n<h2>5. Little buccaneers</h2>\n<p>This site ain’t aimed at sprogs under 13 (or higher by local law), and we don’t knowingly net their personal loot. Since we collect none, we don’t profile nor target the young’uns.</p>\n<h2>6. Third-party ships</h2>\n<p>We rig the site to avoid third-party analytics, ads, or trackers that haul personal cargo. If ever we add such cargo, we’ll update this Proclamation and give clear charts and controls per law.</p>\n<h2>7. Mates from any port</h2>\n<p>Ye can board from any shore, but our practice is to take no personal loot. Where privacy law (like GDPR or LGPD) holds sway, we trim collection to non-personal preferences stowed local in yer browser.</p>\n<h2>8. Changes to this Proclamation</h2>\n<p>We may update this doc if we change how we stow preferences or if we start haulin’ personal cargo. We’ll refresh the \"Last hoisted\" date atop and post the new chart here. If ever we collect personal info, we’ll update first and, if needed, get yer say-so.</p>\n<h2>9. Hail us</h2>\n<p>Questions or think we nabbed personal info by mistake? Holler at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Post: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We’ll answer accordin’ to the law o’ privacy.</p>"
      }
    },
    "en-PT": {
      "name": "Pirate",
      "flag": "pirate",
      "flag_path": "./assets/flags/Jolly_Roger.png",
      "strings": {
        "privacy.title": "Plain English Privacy Notice",
        "privacy.lastUpdated": "Last updated: 18-Jan-2026",
        "privacy.fullText": "<p><strong>Note: This translation is provided for convenience. The <a href=\"/privacy.html?lang=en-US\">English Privacy Statement</a> is the controlling version. In case of conflict, the English version prevails.</strong></p>\n<p>Planefence (\"we\") is committed to keeping your privacy safe. This Privacy Notice explains how we handle information when you use our site.</p>\n<h2>1. We do not collect personal information</h2>\n<p>We built this site so we do not collect, store, or process personal information under the EU/UK GDPR, California CCPA/CPRA, or Brazil LGPD. Your request may pass other servers before it reaches us; they may treat your data differently. We do not control them; handle your privacy needs with those services directly.</p>\n<p>We do not collect, store, or process any information that identifies a person or can be linked to one, such as:</p>\n<ul>\n<li>Names, emails, phone numbers, or mailing addresses</li>\n<li>User accounts or login details</li>\n<li>IP addresses linked to people</li>\n<li>Online identifiers or profiling data</li>\n<li>Location data</li>\n<li>Payment or transaction information</li>\n</ul>\n<p>We also do not use analytics, ad cookies, tracking pixels, or similar tech to follow users over time.</p>\n<p>Because we do not collect personal information, we do not:</p>\n<ul>\n<li>Sell, share, or disclose personal information to third parties</li>\n<li>Use personal information for ads, profiling, or marketing</li>\n<li>Run automated decisions or profiling based on personal data</li>\n</ul>\n<h2>2. Information kept in your browser (local storage / cookies)</h2>\n<p>The site keeps a tiny amount of information only in your browser, just to remember your preferences. It is not sent to our servers and is not reachable by us as personal data.</p>\n<p>We may keep preference data in your browser (local storage, cookies, or similar), including:</p>\n<ul>\n<li>Theme preference: dark or light mode</li>\n<li>Last viewed page: \"planefence\" or \"plane-alert\"</li>\n<li>Language preference: the language you chose for the site</li>\n<li>Consent record (if you opted in): whether you agreed to store these preferences</li>\n</ul>\n<p>These preferences:</p>\n<ul>\n<li>Are used only to improve your experience (remember theme, language, last page)</li>\n<li>Stay local in your browser and are not sent to us as personal data</li>\n<li>Do not contain your name, email, IP, or any other identifier</li>\n</ul>\n<p>If you block this storage, the site still works, but you may need to choose preferences each visit.</p>\n<h2>3. Legal basis and compliance (GDPR, CCPA/CPRA, LGPD)</h2>\n<p>Under GDPR and LGPD, we do not process personal data. The limited preference data in your browser is either needed for basic functions (like keeping your language choice) or stored with your consent. You can disable it via your browser settings or on-site preferences (if offered).</p>\n<p>For California residents: We do not collect, sell, or share \"personal information\" under CCPA/CPRA. We do not hand it to third parties for money or value. We do not use or share \"sensitive personal information.\" Since we do not collect personal information, the usual CCPA/CPRA rights (access, delete, correct, or opt-out of selling/sharing) usually do not apply. Think we got personal information by mistake? Contact us and we will handle it under the law.</p>\n<h2>4. Your choices and control</h2>\n<p>You can control how preferences are stored in your browser:</p>\n<ul>\n<li><strong>Browser settings:</strong> Block or delete cookies/local storage in privacy or security settings. The site may then forget theme, last page, language, or consent status.</li>\n<li><strong>On-site controls (if provided):</strong> We may show a toggle or banner to let you opt in/out. If you opt out, we will stop storing new preferences; your browser may keep old data until you clear it.</li>\n</ul>\n<h2>5. Children’s privacy</h2>\n<p>The site is not aimed at children under 13 (or higher if local law says so), and we do not knowingly collect personal information from children. Since we do not collect personal information, we do not profile or target children.</p>\n<h2>6. Third-party services</h2>\n<p>We design the site to avoid third-party analytics, ads, or trackers that collect personal information. If we ever add third-party content or tools that could process personal information, we will update this Notice and provide clear information and controls consistent with the law.</p>\n<h2>7. International users</h2>\n<p>The site can be accessed worldwide, but our practice is not to collect personal information from any user, wherever they are. If a privacy law (like GDPR or LGPD) applies, we minimize collection to non-personal preference data stored locally in your browser only.</p>\n<h2>8. Changes to this Notice</h2>\n<p>We may update this Notice if we change how we store preferences or if we start processing personal information. When we do, we will update the \"Last updated\" date at the top and post the new version here. If we ever begin collecting personal information, we will update this Notice first and, where needed, get your consent.</p>\n<h2>9. Contact us</h2>\n<p>If you have questions or believe we collected personal information by mistake, contact us at:</p>\n<p>Email: planefence (at) kx1t (dot) com<br>Postal address: PO Box 11, Belmont, MA 02478, USA</p>\n<p>We will respond under applicable privacy laws.</p>"
      }
    }
  }
}
